#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ariral_pigBeater

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ariral_pigBeater.ariral_pigBeater_C.ExecuteUbergraph_ariral_pigBeater
// 0x0070 (0x0070 - 0x0000)
struct Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DestroyedActor;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGrayboar_C*>                    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGrayboar_C*>                    CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_closestActor_nearest;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_closestActor_nearest_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater) == 0x000008, "Wrong alignment on Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater");
static_assert(sizeof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater) == 0x000070, "Wrong size on Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, EntryPoint) == 0x000000, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, K2Node_Event_DestroyedActor) == 0x000008, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::K2Node_Event_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000030, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_closestActor_nearest) == 0x000040, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_closestActor_nearest' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_closestActor_nearest_1) == 0x000058, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_closestActor_nearest_1' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_GetDistanceTo_ReturnValue) == 0x000064, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'Ariral_pigBeater_C_ExecuteUbergraph_ariral_pigBeater::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ariral_pigBeater.ariral_pigBeater_C.targetDestroyed_d
// 0x0008 (0x0008 - 0x0000)
struct Ariral_pigBeater_C_TargetDestroyed_d final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ariral_pigBeater_C_TargetDestroyed_d) == 0x000008, "Wrong alignment on Ariral_pigBeater_C_TargetDestroyed_d");
static_assert(sizeof(Ariral_pigBeater_C_TargetDestroyed_d) == 0x000008, "Wrong size on Ariral_pigBeater_C_TargetDestroyed_d");
static_assert(offsetof(Ariral_pigBeater_C_TargetDestroyed_d, DestroyedActor) == 0x000000, "Member 'Ariral_pigBeater_C_TargetDestroyed_d::DestroyedActor' has a wrong offset!");

}

