#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirGun_shoot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function arirGun_shoot.arirGun_shoot_C.ExecuteUbergraph_arirGun_shoot
// 0x0450 (0x0450 - 0x0000)
struct ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_f_ReturnValue;                            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_f_ReturnValue2;                           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFiretank_C*                            K2Node_DynamicCast_AsFiretank;                     // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x01D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsMain_Player;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0248(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x030C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_f_ReturnValue_1;                          // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_f_ReturnValue2_1;                         // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x03C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot) == 0x000008, "Wrong alignment on ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot");
static_assert(sizeof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot) == 0x000450, "Wrong size on ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, EntryPoint) == 0x000000, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_f_ReturnValue) == 0x000018, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_f_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_f_ReturnValue2) == 0x000024, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_f_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Vector_Distance_ReturnValue) == 0x000030, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000034, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Lerp_ReturnValue_1) == 0x00003C, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, Temp_object_Variable) == 0x000050, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_MakeArray_Array) == 0x000070, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_SphereTraceMulti_OutHits) == 0x000080, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_SphereTraceMulti_ReturnValue) == 0x000090, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Array_Get_Item) == 0x000094, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_bBlockingHit) == 0x000120, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_bInitialOverlap) == 0x000121, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_Time) == 0x000124, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_Distance) == 0x000128, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_Location) == 0x00012C, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_ImpactPoint) == 0x000138, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_Normal) == 0x000144, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_ImpactNormal) == 0x000150, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_HitItem) == 0x000180, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_ElementIndex) == 0x000184, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_FaceIndex) == 0x000188, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_TraceStart) == 0x00018C, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_BreakHitResult_TraceEnd) == 0x000198, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_GetMass_ReturnValue) == 0x0001B4, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_DynamicCast_AsFiretank) == 0x0001B8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_DynamicCast_AsFiretank' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001C4, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_SetVectorLength_ReturnValue) == 0x0001C8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_SphereOverlapActors_OutActors) == 0x0001D8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_SphereOverlapActors_ReturnValue) == 0x0001E8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Array_Length_ReturnValue_1) == 0x0001F8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_DynamicCast_AsInt_Objects) == 0x000200, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_DynamicCast_bSuccess_1) == 0x000210, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_GetObjectClass_ReturnValue) == 0x000218, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000220, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_ClassDynamicCast_AsMain_Player) == 0x000230, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_ClassDynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_ClassDynamicCast_bSuccess) == 0x000238, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Vector_Distance_ReturnValue_1) == 0x00023C, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_SelectFloat_ReturnValue) == 0x000240, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_FClamp_ReturnValue) == 0x000244, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000248, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002D0, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_GetOwner_ReturnValue) == 0x0002D8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x0002E0, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Lerp_ReturnValue_2) == 0x0002E4, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, K2Node_CustomEvent_DestroyedActor) == 0x0002E8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, Temp_int_Loop_Counter_Variable_1) == 0x0002F0, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002F4, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002F8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002FC, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000300, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00030C, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000394, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_f_ReturnValue_1) == 0x000398, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_f_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_f_ReturnValue2_1) == 0x0003A4, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_f_ReturnValue2_1' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Add_VectorVector_ReturnValue) == 0x0003B0, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_Divide_VectorInt_ReturnValue) == 0x0003BC, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_Divide_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0003C8, "Member 'ArirGun_shoot_C_ExecuteUbergraph_arirGun_shoot::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");

// Function arirGun_shoot.arirGun_shoot_C.D
// 0x0008 (0x0008 - 0x0000)
struct ArirGun_shoot_C_D final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirGun_shoot_C_D) == 0x000008, "Wrong alignment on ArirGun_shoot_C_D");
static_assert(sizeof(ArirGun_shoot_C_D) == 0x000008, "Wrong size on ArirGun_shoot_C_D");
static_assert(offsetof(ArirGun_shoot_C_D, DestroyedActor) == 0x000000, "Member 'ArirGun_shoot_C_D::DestroyedActor' has a wrong offset!");

// Function arirGun_shoot.arirGun_shoot_C.F
// 0x0048 (0x0048 - 0x0000)
struct ArirGun_shoot_C_F final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue2;                                      // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirGun_shoot_C_F) == 0x000004, "Wrong alignment on ArirGun_shoot_C_F");
static_assert(sizeof(ArirGun_shoot_C_F) == 0x000048, "Wrong size on ArirGun_shoot_C_F");
static_assert(offsetof(ArirGun_shoot_C_F, ReturnValue) == 0x000000, "Member 'ArirGun_shoot_C_F::ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_F, ReturnValue2) == 0x00000C, "Member 'ArirGun_shoot_C_F::ReturnValue2' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_F, CallFunc_GetForwardVector_ReturnValue) == 0x000018, "Member 'ArirGun_shoot_C_F::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirGun_shoot_C_F, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000024, "Member 'ArirGun_shoot_C_F::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
