#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cig_cigar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"


namespace SDK::Params
{

// Function cig_cigar.cig_cigar_C.ExecuteUbergraph_cig_cigar
// 0x0170 (0x0170 - 0x0000)
struct Cig_cigar_C_ExecuteUbergraph_cig_cigar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_cigar_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x0090(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_addEquip_return;                          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_addEquip_rebug;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_cigar_C_ExecuteUbergraph_cig_cigar) == 0x000010, "Wrong alignment on Cig_cigar_C_ExecuteUbergraph_cig_cigar");
static_assert(sizeof(Cig_cigar_C_ExecuteUbergraph_cig_cigar) == 0x000170, "Wrong size on Cig_cigar_C_ExecuteUbergraph_cig_cigar");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, EntryPoint) == 0x000000, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000020, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, K2Node_DynamicCast_AsInt_Save_1) == 0x000070, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::K2Node_DynamicCast_AsInt_Save_1' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_getData_data) == 0x000090, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_addEquip_return) == 0x000150, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_addEquip_return' has a wrong offset!");
static_assert(offsetof(Cig_cigar_C_ExecuteUbergraph_cig_cigar, CallFunc_addEquip_rebug) == 0x000158, "Member 'Cig_cigar_C_ExecuteUbergraph_cig_cigar::CallFunc_addEquip_rebug' has a wrong offset!");

}

