#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"


namespace SDK::Params
{

// Function cig.cig_C.ExecuteUbergraph_cig
// 0x0180 (0x0180 - 0x0000)
struct Cig_C_ExecuteUbergraph_cig final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Pressed)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_pressed_2;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_pressed_1;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_pressed;                        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_lighter_C*                        K2Node_DynamicCast_AsProp_Lighter;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Pressed)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_LowEntry_LocalVariable_Value__Object;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFire_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut_1;       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_ExecuteUbergraph_cig) == 0x000010, "Wrong alignment on Cig_C_ExecuteUbergraph_cig");
static_assert(sizeof(Cig_C_ExecuteUbergraph_cig) == 0x000180, "Wrong size on Cig_C_ExecuteUbergraph_cig");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, EntryPoint) == 0x000000, "Member 'Cig_C_ExecuteUbergraph_cig::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000014, "Member 'Cig_C_ExecuteUbergraph_cig::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, Temp_bool_Has_Been_Initd_Variable) == 0x000015, "Member 'Cig_C_ExecuteUbergraph_cig::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainPlayer_AsMain_Player) == 0x000038, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000040, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_pressed_2) == 0x000042, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_pressed_2' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_pressed_1) == 0x000043, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_pressed_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000058, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getSaveSlot_saveSlot) == 0x000068, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_FMax_ReturnValue) == 0x000070, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000074, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_3) == 0x000078, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_pressed) == 0x000088, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_pressed' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, Temp_bool_IsClosed_Variable) == 0x000089, "Member 'Cig_C_ExecuteUbergraph_cig::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainPlayer_AsMain_Player_2) == 0x000090, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_DynamicCast_AsProp_Lighter) == 0x000098, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_DynamicCast_AsProp_Lighter' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_DestroyedActor) == 0x0000A8, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B0, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0000C0, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0000C8, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D0, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetComponentBounds_Origin) == 0x0000DC, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetComponentBounds_BoxExtent) == 0x0000E8, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetComponentBounds_SphereRadius) == 0x0000F4, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F8, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000104, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000140, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000150, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_FinishSpawningActor_ReturnValue) == 0x000158, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000160, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000164, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_VictoryFloatMinusEquals_FloatOut_1) == 0x000168, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_VictoryFloatMinusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00016C, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000170, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");

// Function cig.cig_C.destroyed
// 0x0008 (0x0008 - 0x0000)
struct Cig_C_Destroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_Destroyed) == 0x000008, "Wrong alignment on Cig_C_Destroyed");
static_assert(sizeof(Cig_C_Destroyed) == 0x000008, "Wrong size on Cig_C_Destroyed");
static_assert(offsetof(Cig_C_Destroyed, DestroyedActor) == 0x000000, "Member 'Cig_C_Destroyed::DestroyedActor' has a wrong offset!");

// Function cig.cig_C.usedRMB
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_UsedRMB final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_UsedRMB) == 0x000001, "Wrong alignment on Cig_C_UsedRMB");
static_assert(sizeof(Cig_C_UsedRMB) == 0x000001, "Wrong size on Cig_C_UsedRMB");
static_assert(offsetof(Cig_C_UsedRMB, Pressed) == 0x000000, "Member 'Cig_C_UsedRMB::Pressed' has a wrong offset!");

// Function cig.cig_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Cig_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_ReceiveTick) == 0x000004, "Wrong alignment on Cig_C_ReceiveTick");
static_assert(sizeof(Cig_C_ReceiveTick) == 0x000004, "Wrong size on Cig_C_ReceiveTick");
static_assert(offsetof(Cig_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Cig_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function cig.cig_C.usedR
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_UsedR final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_UsedR) == 0x000001, "Wrong alignment on Cig_C_UsedR");
static_assert(sizeof(Cig_C_UsedR) == 0x000001, "Wrong size on Cig_C_UsedR");
static_assert(offsetof(Cig_C_UsedR, Pressed) == 0x000000, "Member 'Cig_C_UsedR::Pressed' has a wrong offset!");

// Function cig.cig_C.usedAlt
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_UsedAlt final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_UsedAlt) == 0x000001, "Wrong alignment on Cig_C_UsedAlt");
static_assert(sizeof(Cig_C_UsedAlt) == 0x000001, "Wrong size on Cig_C_UsedAlt");
static_assert(offsetof(Cig_C_UsedAlt, Pressed) == 0x000000, "Member 'Cig_C_UsedAlt::Pressed' has a wrong offset!");

// Function cig.cig_C.lit
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_Lit final
{
public:
	bool                                          LitUp_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_Lit) == 0x000001, "Wrong alignment on Cig_C_Lit");
static_assert(sizeof(Cig_C_Lit) == 0x000001, "Wrong size on Cig_C_Lit");
static_assert(offsetof(Cig_C_Lit, LitUp_0) == 0x000000, "Member 'Cig_C_Lit::LitUp_0' has a wrong offset!");

// Function cig.cig_C.setLife
// 0x000C (0x000C - 0x0000)
struct Cig_C_SetLife final
{
public:
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_SetLife) == 0x000004, "Wrong alignment on Cig_C_SetLife");
static_assert(sizeof(Cig_C_SetLife) == 0x00000C, "Wrong size on Cig_C_SetLife");
static_assert(offsetof(Cig_C_SetLife, CallFunc_VLerp_ReturnValue) == 0x000000, "Member 'Cig_C_SetLife::CallFunc_VLerp_ReturnValue' has a wrong offset!");

// Function cig.cig_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct Cig_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_LoadData) == 0x000010, "Wrong alignment on Cig_C_LoadData");
static_assert(sizeof(Cig_C_LoadData) == 0x0000F0, "Wrong size on Cig_C_LoadData");
static_assert(offsetof(Cig_C_LoadData, Data) == 0x000000, "Member 'Cig_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Cig_C_LoadData, Return) == 0x0000C0, "Member 'Cig_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Cig_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Cig_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Cig_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Cig_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cig_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Cig_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Cig_C_LoadData, CallFunc_getMainPlayer_AsMain_Player) == 0x0000E0, "Member 'Cig_C_LoadData::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");

// Function cig.cig_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Cig_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_GetData) == 0x000010, "Wrong alignment on Cig_C_GetData");
static_assert(sizeof(Cig_C_GetData) == 0x000270, "Wrong size on Cig_C_GetData");
static_assert(offsetof(Cig_C_GetData, Data) == 0x000000, "Member 'Cig_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Cig_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Cig_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Cig_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Cig_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cig_C_GetData, K2Node_MakeStruct_struct_mFloat) == 0x000190, "Member 'Cig_C_GetData::K2Node_MakeStruct_struct_mFloat' has a wrong offset!");
static_assert(offsetof(Cig_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Cig_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Cig_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Cig_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

