#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cremator

#include "Basic.hpp"

#include "Struct_mFloat_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function cremator.cremator_C.landedOn
// 0x0010 (0x0010 - 0x0000)
struct Cremator_C_LandedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreFallDamage;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_LandedOn) == 0x000008, "Wrong alignment on Cremator_C_LandedOn");
static_assert(sizeof(Cremator_C_LandedOn) == 0x000010, "Wrong size on Cremator_C_LandedOn");
static_assert(offsetof(Cremator_C_LandedOn, Player) == 0x000000, "Member 'Cremator_C_LandedOn::Player' has a wrong offset!");
static_assert(offsetof(Cremator_C_LandedOn, IgnoreFallDamage) == 0x000008, "Member 'Cremator_C_LandedOn::IgnoreFallDamage' has a wrong offset!");

// Function cremator.cremator_C.isButtonUsed
// 0x0001 (0x0001 - 0x0000)
struct Cremator_C_IsButtonUsed final
{
public:
	bool                                          Failed;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_IsButtonUsed) == 0x000001, "Wrong alignment on Cremator_C_IsButtonUsed");
static_assert(sizeof(Cremator_C_IsButtonUsed) == 0x000001, "Wrong size on Cremator_C_IsButtonUsed");
static_assert(offsetof(Cremator_C_IsButtonUsed, Failed) == 0x000000, "Member 'Cremator_C_IsButtonUsed::Failed' has a wrong offset!");

// Function cremator.cremator_C.lookAt
// 0x03B0 (0x03B0 - 0x0000)
struct Cremator_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0138(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0150(0x0018)()
	class FString                                 CallFunc_getGasCanFuel_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0180(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x01B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0238(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0250(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0290(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x02D8(0x0018)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02F0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0338(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0348(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_2;               // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_3;               // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_4;               // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Cremator_C_LookAt) == 0x000008, "Wrong alignment on Cremator_C_LookAt");
static_assert(sizeof(Cremator_C_LookAt) == 0x0003B0, "Wrong size on Cremator_C_LookAt");
static_assert(offsetof(Cremator_C_LookAt, Player) == 0x000000, "Member 'Cremator_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, Hit) == 0x000008, "Member 'Cremator_C_LookAt::Hit' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, Return) == 0x000090, "Member 'Cremator_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, Text) == 0x000098, "Member 'Cremator_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Cremator_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, Number) == 0x0000B0, "Member 'Cremator_C_LookAt::Number' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B1, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B2, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_Time) == 0x0000B4, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_Distance) == 0x0000B8, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_Location) == 0x0000BC, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_ImpactPoint) == 0x0000C8, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_Normal) == 0x0000D4, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E0, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_PhysMat) == 0x0000F0, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_HitActor) == 0x0000F8, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_HitComponent) == 0x000100, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_HitBoneName) == 0x000108, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_HitItem) == 0x000110, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_ElementIndex) == 0x000114, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_FaceIndex) == 0x000118, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_TraceStart) == 0x00011C, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BreakHitResult_TraceEnd) == 0x000128, "Member 'Cremator_C_LookAt::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_MakeLiteralText_ReturnValue) == 0x000138, "Member 'Cremator_C_LookAt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000150, "Member 'Cremator_C_LookAt::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_getGasCanFuel_ReturnValue) == 0x000168, "Member 'Cremator_C_LookAt::CallFunc_getGasCanFuel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BooleanOR_ReturnValue) == 0x000178, "Member 'Cremator_C_LookAt::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000180, "Member 'Cremator_C_LookAt::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x000198, "Member 'Cremator_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BooleanOR_ReturnValue_1) == 0x0001A8, "Member 'Cremator_C_LookAt::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_BooleanOR_ReturnValue_2) == 0x0001A9, "Member 'Cremator_C_LookAt::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Conv_FloatToText_ReturnValue) == 0x0001B0, "Member 'Cremator_C_LookAt::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, K2Node_MakeStruct_FormatArgumentData) == 0x0001C8, "Member 'Cremator_C_LookAt::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000208, "Member 'Cremator_C_LookAt::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Conv_BoolToString_ReturnValue) == 0x000210, "Member 'Cremator_C_LookAt::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_SelectString_ReturnValue) == 0x000220, "Member 'Cremator_C_LookAt::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000230, "Member 'Cremator_C_LookAt::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Conv_StringToText_ReturnValue) == 0x000238, "Member 'Cremator_C_LookAt::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, K2Node_MakeStruct_FormatArgumentData_1) == 0x000250, "Member 'Cremator_C_LookAt::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, K2Node_MakeArray_Array) == 0x000290, "Member 'Cremator_C_LookAt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002A0, "Member 'Cremator_C_LookAt::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Format_ReturnValue) == 0x0002A8, "Member 'Cremator_C_LookAt::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0002C0, "Member 'Cremator_C_LookAt::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, Temp_bool_Variable) == 0x0002D0, "Member 'Cremator_C_LookAt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0002D1, "Member 'Cremator_C_LookAt::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, K2Node_Select_Default) == 0x0002D8, "Member 'Cremator_C_LookAt::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002F0, "Member 'Cremator_C_LookAt::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000330, "Member 'Cremator_C_LookAt::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, K2Node_MakeArray_Array_1) == 0x000338, "Member 'Cremator_C_LookAt::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Format_ReturnValue_1) == 0x000348, "Member 'Cremator_C_LookAt::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000360, "Member 'Cremator_C_LookAt::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_SelectString_ReturnValue_1) == 0x000370, "Member 'Cremator_C_LookAt::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_SelectString_ReturnValue_2) == 0x000380, "Member 'Cremator_C_LookAt::CallFunc_SelectString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_SelectString_ReturnValue_3) == 0x000390, "Member 'Cremator_C_LookAt::CallFunc_SelectString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Cremator_C_LookAt, CallFunc_SelectString_ReturnValue_4) == 0x0003A0, "Member 'Cremator_C_LookAt::CallFunc_SelectString_ReturnValue_4' has a wrong offset!");

// Function cremator.cremator_C.noRespawn
// 0x0002 (0x0002 - 0x0000)
struct Cremator_C_NoRespawn final
{
public:
	bool                                          NoRespawn_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_NoRespawn) == 0x000001, "Wrong alignment on Cremator_C_NoRespawn");
static_assert(sizeof(Cremator_C_NoRespawn) == 0x000002, "Wrong size on Cremator_C_NoRespawn");
static_assert(offsetof(Cremator_C_NoRespawn, NoRespawn_0) == 0x000000, "Member 'Cremator_C_NoRespawn::NoRespawn_0' has a wrong offset!");
static_assert(offsetof(Cremator_C_NoRespawn, Return) == 0x000001, "Member 'Cremator_C_NoRespawn::Return' has a wrong offset!");

// Function cremator.cremator_C.canPickup
// 0x0001 (0x0001 - 0x0000)
struct Cremator_C_CanPickup final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_CanPickup) == 0x000001, "Wrong alignment on Cremator_C_CanPickup");
static_assert(sizeof(Cremator_C_CanPickup) == 0x000001, "Wrong size on Cremator_C_CanPickup");
static_assert(offsetof(Cremator_C_CanPickup, Return) == 0x000000, "Member 'Cremator_C_CanPickup::Return' has a wrong offset!");

// Function cremator.cremator_C.asProp
// 0x0008 (0x0008 - 0x0000)
struct Cremator_C_AsProp final
{
public:
	class AProp_C*                                Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cremator_C_AsProp) == 0x000008, "Wrong alignment on Cremator_C_AsProp");
static_assert(sizeof(Cremator_C_AsProp) == 0x000008, "Wrong size on Cremator_C_AsProp");
static_assert(offsetof(Cremator_C_AsProp, Return) == 0x000000, "Member 'Cremator_C_AsProp::Return' has a wrong offset!");

// Function cremator.cremator_C.canBePutInContainer
// 0x0001 (0x0001 - 0x0000)
struct Cremator_C_CanBePutInContainer final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_CanBePutInContainer) == 0x000001, "Wrong alignment on Cremator_C_CanBePutInContainer");
static_assert(sizeof(Cremator_C_CanBePutInContainer) == 0x000001, "Wrong size on Cremator_C_CanBePutInContainer");
static_assert(offsetof(Cremator_C_CanBePutInContainer, Return) == 0x000000, "Member 'Cremator_C_CanBePutInContainer::Return' has a wrong offset!");

// Function cremator.cremator_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Cremator_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Cremator_C_GetData) == 0x000010, "Wrong alignment on Cremator_C_GetData");
static_assert(sizeof(Cremator_C_GetData) == 0x000270, "Wrong size on Cremator_C_GetData");
static_assert(offsetof(Cremator_C_GetData, Data) == 0x000000, "Member 'Cremator_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Cremator_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Cremator_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetData, K2Node_MakeStruct_struct_mFloat) == 0x000190, "Member 'Cremator_C_GetData::K2Node_MakeStruct_struct_mFloat' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Cremator_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Cremator_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function cremator.cremator_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Cremator_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cremator_C_LoadData) == 0x000010, "Wrong alignment on Cremator_C_LoadData");
static_assert(sizeof(Cremator_C_LoadData) == 0x0000E0, "Wrong size on Cremator_C_LoadData");
static_assert(offsetof(Cremator_C_LoadData, Data) == 0x000000, "Member 'Cremator_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Cremator_C_LoadData, Return) == 0x0000C0, "Member 'Cremator_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Cremator_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Cremator_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Cremator_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Cremator_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cremator_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Cremator_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function cremator.cremator_C.playLoudAsFuck
// 0x0078 (0x0078 - 0x0000)
struct Cremator_C_PlayLoudAsFuck final
{
public:
	float                                         InputPin;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_PlayLoudAsFuck) == 0x000008, "Wrong alignment on Cremator_C_PlayLoudAsFuck");
static_assert(sizeof(Cremator_C_PlayLoudAsFuck) == 0x000078, "Wrong size on Cremator_C_PlayLoudAsFuck");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, InputPin) == 0x000000, "Member 'Cremator_C_PlayLoudAsFuck::InputPin' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Cremator_C_PlayLoudAsFuck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000014, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'Cremator_C_PlayLoudAsFuck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00003C, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_getMainPlayer_AsMain_Player) == 0x000048, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, K2Node_MakeArray_Array) == 0x000050, "Member 'Cremator_C_PlayLoudAsFuck::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Array_Get_Item) == 0x000068, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cremator_C_PlayLoudAsFuck, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Cremator_C_PlayLoudAsFuck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function cremator.cremator_C.updPour
// 0x0002 (0x0002 - 0x0000)
struct Cremator_C_UpdPour final
{
public:
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_UpdPour) == 0x000001, "Wrong alignment on Cremator_C_UpdPour");
static_assert(sizeof(Cremator_C_UpdPour) == 0x000002, "Wrong size on Cremator_C_UpdPour");
static_assert(offsetof(Cremator_C_UpdPour, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000000, "Member 'Cremator_C_UpdPour::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_UpdPour, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'Cremator_C_UpdPour::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function cremator.cremator_C.calcFlamability
// 0x00C8 (0x00C8 - 0x0000)
struct Cremator_C_CalcFlamability final
{
public:
	class UPhysicalMaterial*                      Self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Flamability;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuelMultiply;                                      // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UPhysicalMaterial*, struct FVector2D> Flam;                                              // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class UPhysicalMaterial*, struct FVector2D> K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cremator_C_CalcFlamability) == 0x000008, "Wrong alignment on Cremator_C_CalcFlamability");
static_assert(sizeof(Cremator_C_CalcFlamability) == 0x0000C8, "Wrong size on Cremator_C_CalcFlamability");
static_assert(offsetof(Cremator_C_CalcFlamability, Self2) == 0x000000, "Member 'Cremator_C_CalcFlamability::Self2' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, Flamability) == 0x000008, "Member 'Cremator_C_CalcFlamability::Flamability' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, FuelMultiply) == 0x00000C, "Member 'Cremator_C_CalcFlamability::FuelMultiply' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, Flam) == 0x000010, "Member 'Cremator_C_CalcFlamability::Flam' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, K2Node_MakeVariable_MakeVariableOutput) == 0x000060, "Member 'Cremator_C_CalcFlamability::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, CallFunc_Map_Find_Value) == 0x0000B0, "Member 'Cremator_C_CalcFlamability::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, CallFunc_Map_Find_ReturnValue) == 0x0000B8, "Member 'Cremator_C_CalcFlamability::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, CallFunc_BreakVector2D_X) == 0x0000BC, "Member 'Cremator_C_CalcFlamability::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Cremator_C_CalcFlamability, CallFunc_BreakVector2D_Y) == 0x0000C0, "Member 'Cremator_C_CalcFlamability::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function cremator.cremator_C.setupBurning
// 0x0098 (0x0098 - 0x0000)
struct Cremator_C_SetupBurning final
{
public:
	TArray<class AActor*>                         Ac;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Volume_volume;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_GetPhysicalMaterial_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_calcFlamability_flamability;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_calcFlamability_fuelMultiply;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0088(0x0010)(ReferenceParm)
};
static_assert(alignof(Cremator_C_SetupBurning) == 0x000008, "Wrong alignment on Cremator_C_SetupBurning");
static_assert(sizeof(Cremator_C_SetupBurning) == 0x000098, "Wrong size on Cremator_C_SetupBurning");
static_assert(offsetof(Cremator_C_SetupBurning, Ac) == 0x000000, "Member 'Cremator_C_SetupBurning::Ac' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, Temp_int_Variable) == 0x000010, "Member 'Cremator_C_SetupBurning::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Cremator_C_SetupBurning::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, Temp_float_Variable) == 0x000018, "Member 'Cremator_C_SetupBurning::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Array_Get_Item) == 0x000020, "Member 'Cremator_C_SetupBurning::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'Cremator_C_SetupBurning::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Array_LastIndex_ReturnValue) == 0x000030, "Member 'Cremator_C_SetupBurning::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000038, "Member 'Cremator_C_SetupBurning::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Cremator_C_SetupBurning::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000041, "Member 'Cremator_C_SetupBurning::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_GetMaterial_ReturnValue) == 0x000048, "Member 'Cremator_C_SetupBurning::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Get_Volume_volume) == 0x000050, "Member 'Cremator_C_SetupBurning::CallFunc_Get_Volume_volume' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_GetPhysicalMaterial_ReturnValue) == 0x000058, "Member 'Cremator_C_SetupBurning::CallFunc_GetPhysicalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'Cremator_C_SetupBurning::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_calcFlamability_flamability) == 0x000064, "Member 'Cremator_C_SetupBurning::CallFunc_calcFlamability_flamability' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_calcFlamability_fuelMultiply) == 0x000068, "Member 'Cremator_C_SetupBurning::CallFunc_calcFlamability_fuelMultiply' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00006C, "Member 'Cremator_C_SetupBurning::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000070, "Member 'Cremator_C_SetupBurning::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'Cremator_C_SetupBurning::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Array_RemoveItem_ReturnValue) == 0x000078, "Member 'Cremator_C_SetupBurning::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'Cremator_C_SetupBurning::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, Temp_float_Variable_1) == 0x000080, "Member 'Cremator_C_SetupBurning::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000084, "Member 'Cremator_C_SetupBurning::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetupBurning, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000088, "Member 'Cremator_C_SetupBurning::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");

// Function cremator.cremator_C.upd
// 0x000C (0x000C - 0x0000)
struct Cremator_C_Upd final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cremator_C_Upd) == 0x000004, "Wrong alignment on Cremator_C_Upd");
static_assert(sizeof(Cremator_C_Upd) == 0x00000C, "Wrong size on Cremator_C_Upd");
static_assert(offsetof(Cremator_C_Upd, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'Cremator_C_Upd::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_Upd, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'Cremator_C_Upd::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_Upd, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'Cremator_C_Upd::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_Upd, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Cremator_C_Upd::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_Upd, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Cremator_C_Upd::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function cremator.cremator_C.setClosed
// 0x0070 (0x0070 - 0x0000)
struct Cremator_C_SetClosed final
{
public:
	bool                                          Close;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cremator_C_SetClosed) == 0x000010, "Wrong alignment on Cremator_C_SetClosed");
static_assert(sizeof(Cremator_C_SetClosed) == 0x000070, "Wrong size on Cremator_C_SetClosed");
static_assert(offsetof(Cremator_C_SetClosed, Close) == 0x000000, "Member 'Cremator_C_SetClosed::Close' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetClosed, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Cremator_C_SetClosed::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cremator_C_SetClosed, CallFunc_MakeTransform_ReturnValue_1) == 0x000040, "Member 'Cremator_C_SetClosed::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");

// Function cremator.cremator_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Cremator_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Cremator_C_GetActionOptions) == 0x000008, "Wrong alignment on Cremator_C_GetActionOptions");
static_assert(sizeof(Cremator_C_GetActionOptions) == 0x000060, "Wrong size on Cremator_C_GetActionOptions");
static_assert(offsetof(Cremator_C_GetActionOptions, Player) == 0x000000, "Member 'Cremator_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetActionOptions, Component) == 0x000008, "Member 'Cremator_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetActionOptions, Actor) == 0x000010, "Member 'Cremator_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetActionOptions, Options) == 0x000018, "Member 'Cremator_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Cremator_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Cremator_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetActionOptions, Number) == 0x000048, "Member 'Cremator_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Cremator_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Cremator_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function cremator.cremator_C.getGasCanFuel
// 0x00D0 (0x00D0 - 0x0000)
struct Cremator_C_GetGasCanFuel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0070(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Cremator_C_GetGasCanFuel) == 0x000008, "Wrong alignment on Cremator_C_GetGasCanFuel");
static_assert(sizeof(Cremator_C_GetGasCanFuel) == 0x0000D0, "Wrong size on Cremator_C_GetGasCanFuel");
static_assert(offsetof(Cremator_C_GetGasCanFuel, ReturnValue) == 0x000000, "Member 'Cremator_C_GetGasCanFuel::ReturnValue' has a wrong offset!");
