#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Custom_menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass custom_menu.custom_menu_C
// 0x00D8 (0x0338 - 0x0260)
class UCustom_menu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                DonateButton;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gear;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GearShadow;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoadedMods;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MenuBG;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MenuBGMinusRounded;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ModListButton;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ModSettingsButton;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SocialsButton;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VersionCredit;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         LIST_Mods;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         LIST_Variables;                                    // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         LIST_Values;                                       // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UOptionsmenu_mod_C*>             LIST_AddedModWidgets;                              // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FString>                         LIST_Added_Mods;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UOptionsmenu_mod_C*                     ChosenWidget;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundMod;                                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_menu_C*                            UmgMenu;                                           // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CreditsMenuUpdated;                                // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LIST_Descriptions;                                 // 0x0328(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__menuadditions_ModSettingsButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__menuadditions_ModListButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void BndEvt__custom_menu_DonateButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__custom_menu_SocialsButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_custom_menu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"custom_menu_C">();
	}
	static class UCustom_menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustom_menu_C>();
	}
};
static_assert(alignof(UCustom_menu_C) == 0x000008, "Wrong alignment on UCustom_menu_C");
static_assert(sizeof(UCustom_menu_C) == 0x000338, "Wrong size on UCustom_menu_C");
static_assert(offsetof(UCustom_menu_C, UberGraphFrame) == 0x000260, "Member 'UCustom_menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, DonateButton) == 0x000268, "Member 'UCustom_menu_C::DonateButton' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, Gear) == 0x000270, "Member 'UCustom_menu_C::Gear' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, GearShadow) == 0x000278, "Member 'UCustom_menu_C::GearShadow' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, LoadedMods) == 0x000280, "Member 'UCustom_menu_C::LoadedMods' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, MenuBG) == 0x000288, "Member 'UCustom_menu_C::MenuBG' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, MenuBGMinusRounded) == 0x000290, "Member 'UCustom_menu_C::MenuBGMinusRounded' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, ModListButton) == 0x000298, "Member 'UCustom_menu_C::ModListButton' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, ModSettingsButton) == 0x0002A0, "Member 'UCustom_menu_C::ModSettingsButton' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, SocialsButton) == 0x0002A8, "Member 'UCustom_menu_C::SocialsButton' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, VersionCredit) == 0x0002B0, "Member 'UCustom_menu_C::VersionCredit' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, LIST_Mods) == 0x0002B8, "Member 'UCustom_menu_C::LIST_Mods' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, LIST_Variables) == 0x0002C8, "Member 'UCustom_menu_C::LIST_Variables' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, LIST_Values) == 0x0002D8, "Member 'UCustom_menu_C::LIST_Values' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, LIST_AddedModWidgets) == 0x0002E8, "Member 'UCustom_menu_C::LIST_AddedModWidgets' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, LIST_Added_Mods) == 0x0002F8, "Member 'UCustom_menu_C::LIST_Added_Mods' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, ChosenWidget) == 0x000308, "Member 'UCustom_menu_C::ChosenWidget' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, FoundMod) == 0x000310, "Member 'UCustom_menu_C::FoundMod' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, UmgMenu) == 0x000318, "Member 'UCustom_menu_C::UmgMenu' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, CreditsMenuUpdated) == 0x000320, "Member 'UCustom_menu_C::CreditsMenuUpdated' has a wrong offset!");
static_assert(offsetof(UCustom_menu_C, LIST_Descriptions) == 0x000328, "Member 'UCustom_menu_C::LIST_Descriptions' has a wrong offset!");

}

