#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWall

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_physSound_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_food_structs.hpp"
#include "Struct_prop3_structs.hpp"


namespace SDK::Params
{

// Function customWall.customWall_C.ExecuteUbergraph_customWall
// 0x0520 (0x0520 - 0x0000)
struct CustomWall_C_ExecuteUbergraph_customWall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_customWall_material_material;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_drop;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_customWall_material_valid;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_customWall_material_Out_Row_Health_Mult;  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_customWall_material_Out_Row_Wall_Class;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x0038(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x0068(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_component;                            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x011C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x01CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_5;                               // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0380(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0474(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x04D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_2;            // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_customWall_getBricks_ToCeil;              // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Loge_ReturnValue;                         // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWall_C_ExecuteUbergraph_customWall) == 0x000010, "Wrong alignment on CustomWall_C_ExecuteUbergraph_customWall");
static_assert(sizeof(CustomWall_C_ExecuteUbergraph_customWall) == 0x000520, "Wrong size on CustomWall_C_ExecuteUbergraph_customWall");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, EntryPoint) == 0x000000, "Member 'CustomWall_C_ExecuteUbergraph_customWall::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Conv_StringToName_ReturnValue) == 0x000004, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_customWall_material_material) == 0x000010, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_customWall_material_material' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_customWall_material_drop) == 0x000018, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_customWall_material_drop' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_customWall_material_valid) == 0x000020, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_customWall_material_valid' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_customWall_material_Out_Row_Health_Mult) == 0x000024, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_customWall_material_Out_Row_Health_Mult' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_customWall_material_Out_Row_Wall_Class) == 0x000028, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_customWall_material_Out_Row_Wall_Class' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, Temp_int_Variable) == 0x000030, "Member 'CustomWall_C_ExecuteUbergraph_customWall::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_propToObject_ReturnValue) == 0x000034, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_propToObject_foodData) == 0x000038, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_propToObject_object) == 0x000058, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_propToObject_isFood) == 0x000060, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_propToObject_fuckYouRetard) == 0x000068, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_IsValidClass_ReturnValue) == 0x0000E8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E9, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_NotEqual_NameName_ReturnValue) == 0x0000F0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, Temp_int_Variable_1) == 0x0000F4, "Member 'CustomWall_C_ExecuteUbergraph_customWall::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, Temp_int_Variable_2) == 0x0000FC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000100, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Add_IntInt_ReturnValue_2) == 0x000104, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, Temp_int_Variable_3) == 0x000108, "Member 'CustomWall_C_ExecuteUbergraph_customWall::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, Temp_int_Variable_4) == 0x00010C, "Member 'CustomWall_C_ExecuteUbergraph_customWall::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_component) == 0x000110, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_damage_1) == 0x000118, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_hit_1) == 0x00011C, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_actor_1) == 0x0001A8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_impact_1) == 0x0001B0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_actor) == 0x0001C0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_damage) == 0x0001C8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_hit) == 0x0001CC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_impact) == 0x000254, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Event_skipSetting) == 0x000260, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_bBlockingHit) == 0x000261, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_bInitialOverlap) == 0x000262, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Time) == 0x000264, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Distance) == 0x000268, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Location) == 0x00026C, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_ImpactPoint) == 0x000278, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Normal) == 0x000284, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_ImpactNormal) == 0x000290, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_PhysMat) == 0x0002A0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitActor) == 0x0002A8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitComponent) == 0x0002B0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitBoneName) == 0x0002B8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitItem) == 0x0002C0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_ElementIndex) == 0x0002C4, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_FaceIndex) == 0x0002C8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_TraceStart) == 0x0002CC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_TraceEnd) == 0x0002D8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002E4, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002E5, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Time_1) == 0x0002E8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Distance_1) == 0x0002EC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Location_1) == 0x0002F0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002FC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_Normal_1) == 0x000308, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000314, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_PhysMat_1) == 0x000320, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitActor_1) == 0x000328, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitComponent_1) == 0x000330, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitBoneName_1) == 0x000338, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_HitItem_1) == 0x000340, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_ElementIndex_1) == 0x000344, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_FaceIndex_1) == 0x000348, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_TraceStart_1) == 0x00034C, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BreakHitResult_TraceEnd_1) == 0x000358, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000364, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000370, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, Temp_int_Variable_5) == 0x00037C, "Member 'CustomWall_C_ExecuteUbergraph_customWall::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_GetTransform_ReturnValue) == 0x000380, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0003B0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Add_IntInt_ReturnValue_3) == 0x0003B4, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0003B8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_TransformLocation_ReturnValue) == 0x0003C4, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_MakeTransform_ReturnValue) == 0x0003D0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000400, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000408, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_FinishSpawningActor_ReturnValue) == 0x000410, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_DynamicCast_AsInt_Player) == 0x000418, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_DynamicCast_bSuccess) == 0x000428, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000430, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_asProp_return) == 0x000438, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000440, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000448, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_Select_Default) == 0x000450, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Conv_NameToString_ReturnValue) == 0x000458, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_DynamicCast_AsProp) == 0x000468, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, K2Node_DynamicCast_bSuccess_1) == 0x000470, "Member 'CustomWall_C_ExecuteUbergraph_customWall::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000474, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000480, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_GetActorScale3D_ReturnValue) == 0x00048C, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000498, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_RandomUnitVector_ReturnValue) == 0x0004A4, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0004B0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_RandomFloatInRange_ReturnValue) == 0x0004BC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Divide_VectorVector_ReturnValue) == 0x0004C0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0004CC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_GetActorScale3D_ReturnValue_1) == 0x0004D8, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_GetActorScale3D_ReturnValue_2) == 0x0004E4, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_GetActorScale3D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x0004F0, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_customWall_getBricks_ToCeil) == 0x0004FC, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_customWall_getBricks_ToCeil' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000500, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Loge_ReturnValue) == 0x000504, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Loge_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000508, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_FCeil_ReturnValue) == 0x00050C, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_Max_ReturnValue) == 0x000510, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ExecuteUbergraph_customWall, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000514, "Member 'CustomWall_C_ExecuteUbergraph_customWall::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");

// Function customWall.customWall_C.impactDamageCPP
// 0x00A8 (0x00A8 - 0x0000)
struct CustomWall_C_ImpactDamageCPP final
{
public:
	float                                         Damage_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_C_ImpactDamageCPP) == 0x000008, "Wrong alignment on CustomWall_C_ImpactDamageCPP");
static_assert(sizeof(CustomWall_C_ImpactDamageCPP) == 0x0000A8, "Wrong size on CustomWall_C_ImpactDamageCPP");
static_assert(offsetof(CustomWall_C_ImpactDamageCPP, Damage_0) == 0x000000, "Member 'CustomWall_C_ImpactDamageCPP::Damage_0' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ImpactDamageCPP, Hit) == 0x000004, "Member 'CustomWall_C_ImpactDamageCPP::Hit' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ImpactDamageCPP, Actor) == 0x000090, "Member 'CustomWall_C_ImpactDamageCPP::Actor' has a wrong offset!");
static_assert(offsetof(CustomWall_C_ImpactDamageCPP, Impact) == 0x000098, "Member 'CustomWall_C_ImpactDamageCPP::Impact' has a wrong offset!");

// Function customWall.customWall_C.impactSquishCPP
// 0x0008 (0x0008 - 0x0000)
struct CustomWall_C_ImpactSquishCPP final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_C_ImpactSquishCPP) == 0x000008, "Wrong alignment on CustomWall_C_ImpactSquishCPP");
static_assert(sizeof(CustomWall_C_ImpactSquishCPP) == 0x000008, "Wrong size on CustomWall_C_ImpactSquishCPP");
static_assert(offsetof(CustomWall_C_ImpactSquishCPP, Component) == 0x000000, "Member 'CustomWall_C_ImpactSquishCPP::Component' has a wrong offset!");

// Function customWall.customWall_C.Damage
// 0x0050 (0x0050 - 0x0000)
struct CustomWall_C_Damage final
{
public:
	float                                         Damage_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWall_C_Damage) == 0x000008, "Wrong alignment on CustomWall_C_Damage");
static_assert(sizeof(CustomWall_C_Damage) == 0x000050, "Wrong size on CustomWall_C_Damage");
static_assert(offsetof(CustomWall_C_Damage, Damage_0) == 0x000000, "Member 'CustomWall_C_Damage::Damage_0' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, Location) == 0x000004, "Member 'CustomWall_C_Damage::Location' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, Rotation) == 0x000010, "Member 'CustomWall_C_Damage::Rotation' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000020, "Member 'CustomWall_C_Damage::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'CustomWall_C_Damage::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'CustomWall_C_Damage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'CustomWall_C_Damage::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000044, "Member 'CustomWall_C_Damage::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Damage, CallFunc_Less_FloatFloat_ReturnValue) == 0x000048, "Member 'CustomWall_C_Damage::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function customWall.customWall_C.eff
// 0x00C0 (0x00C0 - 0x0000)
struct CustomWall_C_Eff final
{
public:
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0030(0x0080)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_C_Eff) == 0x000010, "Wrong alignment on CustomWall_C_Eff");
static_assert(sizeof(CustomWall_C_Eff) == 0x0000C0, "Wrong size on CustomWall_C_Eff");
static_assert(offsetof(CustomWall_C_Eff, CallFunc_GetActorScale3D_ReturnValue) == 0x000000, "Member 'CustomWall_C_Eff::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Eff, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00000C, "Member 'CustomWall_C_Eff::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Eff, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000018, "Member 'CustomWall_C_Eff::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Eff, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'CustomWall_C_Eff::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Eff, K2Node_MakeStruct_ParticleSysParam) == 0x000030, "Member 'CustomWall_C_Eff::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Eff, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000B0, "Member 'CustomWall_C_Eff::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function customWall.customWall_C.fix
// 0x000C (0x000C - 0x0000)
struct CustomWall_C_Fix final
{
public:
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWall_C_Fix) == 0x000004, "Wrong alignment on CustomWall_C_Fix");
static_assert(sizeof(CustomWall_C_Fix) == 0x00000C, "Wrong size on CustomWall_C_Fix");
static_assert(offsetof(CustomWall_C_Fix, CallFunc_FMin_ReturnValue) == 0x000000, "Member 'CustomWall_C_Fix::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Fix, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000004, "Member 'CustomWall_C_Fix::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(CustomWall_C_Fix, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'CustomWall_C_Fix::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function customWall.customWall_C.Init
// 0x00A0 (0x00A0 - 0x0000)
struct CustomWall_C_Init final
{
public:
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_customWall_material_material;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_drop;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_customWall_material_valid;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_customWall_material_Out_Row_Health_Mult;  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_customWall_material_Out_Row_Wall_Class;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_customWall_shape_shape;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_GetPhysicalMaterial_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_physSound_return;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_physSound                      CallFunc_physSound_data;                           // 0x0040(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
