#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drone

#include "Basic.hpp"

#include "Struct_mFloat_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "Struct_store_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_storeOrder1_structs.hpp"
#include "Enum_emailChars_structs.hpp"
#include "Enum_signalResponse_structs.hpp"


namespace SDK::Params
{

// Function drone.drone_C.ExecuteUbergraph_drone
// 0x0B70 (0x0B70 - 0x0000)
struct Drone_C_ExecuteUbergraph_drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0114(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_grab;                           // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDrone_sk_Skeleton_AnimBlueprint_C*     K2Node_DynamicCast_AsDrone_Sk_Skeleton_Anim_Blueprint; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_sentFrom;                             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_active;                               // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACord_C*                                K2Node_Event_cord_1;                               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket_1;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord;                                 // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket;                               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_owner;                                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewParam;                             // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x02C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue_3;                      // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_canSell_can;                              // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_canSell_isItembox;                        // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_4;                      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_5;                      // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0400(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0490(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x051C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0534(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x05F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0608(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_615[0x3];                                      // 0x0615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0618(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_6;                      // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue_1;            // 0x062C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0648(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_mString                        CallFunc_Array_Get_Item_1;                         // 0x0660(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0674(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0680(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0690(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x069C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x06DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x06FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x070C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_storeOrder1                    K2Node_CustomEvent_order;                          // 0x0718(0x0018)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x0730(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x073C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0748(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isDreaming_dreaming;                      // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_759[0x3];                                      // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x075C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0768(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0774(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_2;     // 0x0780(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x0808(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0814(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_6;      // 0x082C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_2;            // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_4;       // 0x083C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D[0x3];                                      // 0x083D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0840(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0870(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_881[0xF];                                      // 0x0881(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x0890(0x00C0)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0950(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0968(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0980(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0990(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Select_Default;                             // 0x09A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x09A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USceneComponent*                        K2Node_Select_Default_1;                           // 0x0A30(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0A39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3A[0x2];                                      // 0x0A3A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_sell_points;                              // 0x0A3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_signalResponse                           CallFunc_sell_responseEmail;                       // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_sell_checked;                             // 0x0A41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A42[0x6];                                      // 0x0A42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_getResponse_topic;                        // 0x0A48(0x0018)()
	class FText                                   CallFunc_getResponse_desc;                         // 0x0A60(0x0018)()
	Enum_emailChars                               CallFunc_getResponse_character;                    // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A79[0x7];                                      // 0x0A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_getResponse_avatar;                       // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0A88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8C[0x4];                                      // 0x0A8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0A90(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0AA0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0AB0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC1[0x7];                                      // 0x0AC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0AC8(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0AE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0AE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0AE2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE3[0x5];                                      // 0x0AE3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF1[0x3];                                      // 0x0AF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0AF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF9[0x3];                                      // 0x0AF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x0B00(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0B0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B0D[0x3];                                      // 0x0B0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0B10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_1;      // 0x0B14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_8;       // 0x0B18(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0B28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_2;      // 0x0B2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0B30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0B34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_3;      // 0x0B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0B3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_9;       // 0x0B40(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4C[0x4];                                      // 0x0B4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B59[0x3];                                      // 0x0B59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue_3;            // 0x0B5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_5;       // 0x0B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Drone_C_ExecuteUbergraph_drone) == 0x000010, "Wrong alignment on Drone_C_ExecuteUbergraph_drone");
static_assert(sizeof(Drone_C_ExecuteUbergraph_drone) == 0x000B70, "Wrong size on Drone_C_ExecuteUbergraph_drone");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, EntryPoint) == 0x000000, "Member 'Drone_C_ExecuteUbergraph_drone::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000010, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00001C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000028, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000034, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000044, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000050, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetForwardVector_ReturnValue) == 0x0000D8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_X) == 0x0000E4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Y) == 0x0000E8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Z) == 0x0000EC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetSocketLocation_ReturnValue) == 0x0000F0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000FC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VLerp_ReturnValue) == 0x000108, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000114, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_CustomEvent_grab) == 0x00019C, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_CustomEvent_grab' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetAnimInstance_ReturnValue) == 0x0001A0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_DynamicCast_AsDrone_Sk_Skeleton_Anim_Blueprint) == 0x0001A8, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_DynamicCast_AsDrone_Sk_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue) == 0x0001B4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0001B8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001C4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001C8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_SetVectorLength_ReturnValue) == 0x000250, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_1) == 0x00025C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000260, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_2) == 0x000264, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000268, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_sentFrom) == 0x000270, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_sentFrom' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_active) == 0x000278, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Array_LastIndex_ReturnValue) == 0x00027C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_SelectInt_ReturnValue) == 0x000280, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_cord_1) == 0x000288, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_cord_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_socket_1) == 0x000290, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_socket_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_cord) == 0x000298, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_cord' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_socket) == 0x0002A0, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_socket' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_owner) == 0x0002A8, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_index) == 0x0002B0, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_NewParam) == 0x0002B4, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_IsValid_ReturnValue) == 0x0002B5, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Array_Get_Item) == 0x0002B8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002C4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0002C8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_3) == 0x000350, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000354, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetForwardVector_ReturnValue_1) == 0x000358, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_X_1) == 0x000364, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Y_1) == 0x000368, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Z_1) == 0x00036C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000370, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_canSell_can) == 0x000374, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_canSell_can' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_canSell_isItembox) == 0x000375, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_canSell_isItembox' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000378, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_ClampVectorSize_ReturnValue) == 0x00037C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetComponentVelocity_ReturnValue) == 0x000388, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000394, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_4) == 0x0003A0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_5) == 0x0003A4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0003A8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0003AC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0003B0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003B4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0003B8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0003BC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_FInterpTo_ReturnValue) == 0x0003C8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0003CC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_FClamp_ReturnValue) == 0x0003D8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0003DC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0003E8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0003F4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000400, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Vector_Distance_ReturnValue) == 0x000488, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x00048C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x000490, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000518, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_RInterpTo_ReturnValue) == 0x00051C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000528, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000534, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0005BC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x0005C8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Vector_Distance_ReturnValue_1) == 0x0005D4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0005D8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_RandomFloatInRange_ReturnValue) == 0x0005DC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_FClamp_ReturnValue_1) == 0x0005E0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0005E4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0005E8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0005EC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_MakeVector_ReturnValue) == 0x0005F0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x0005FC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000608, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, Temp_bool_Variable) == 0x000614, "Member 'Drone_C_ExecuteUbergraph_drone::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VLerp_ReturnValue_1) == 0x000618, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_6) == 0x000624, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000628, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_SetVectorLength_ReturnValue_1) == 0x00062C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_SetVectorLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_ClampVectorSize_ReturnValue_1) == 0x000638, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_ClampVectorSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, Temp_bool_Variable_1) == 0x000644, "Member 'Drone_C_ExecuteUbergraph_drone::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetRightVector_ReturnValue) == 0x000648, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000654, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Array_Get_Item_1) == 0x000660, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Dot_VectorVector_ReturnValue) == 0x000670, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000674, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
