#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_sleepy

#include "Basic.hpp"


namespace SDK::Params
{

// Function effect_sleepy.effect_sleepy_C.ExecuteUbergraph_effect_sleepy
// 0x0020 (0x0020 - 0x0000)
struct Effect_sleepy_C_ExecuteUbergraph_effect_sleepy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy) == 0x000008, "Wrong alignment on Effect_sleepy_C_ExecuteUbergraph_effect_sleepy");
static_assert(sizeof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy) == 0x000020, "Wrong size on Effect_sleepy_C_ExecuteUbergraph_effect_sleepy");
static_assert(offsetof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy, EntryPoint) == 0x000000, "Member 'Effect_sleepy_C_ExecuteUbergraph_effect_sleepy::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Effect_sleepy_C_ExecuteUbergraph_effect_sleepy::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy, CallFunc_getSaveSlot_saveSlot) == 0x000008, "Member 'Effect_sleepy_C_ExecuteUbergraph_effect_sleepy::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'Effect_sleepy_C_ExecuteUbergraph_effect_sleepy::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000014, "Member 'Effect_sleepy_C_ExecuteUbergraph_effect_sleepy::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Effect_sleepy_C_ExecuteUbergraph_effect_sleepy, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'Effect_sleepy_C_ExecuteUbergraph_effect_sleepy::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function effect_sleepy.effect_sleepy_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Effect_sleepy_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_sleepy_C_ReceiveTick) == 0x000004, "Wrong alignment on Effect_sleepy_C_ReceiveTick");
static_assert(sizeof(Effect_sleepy_C_ReceiveTick) == 0x000004, "Wrong size on Effect_sleepy_C_ReceiveTick");
static_assert(offsetof(Effect_sleepy_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Effect_sleepy_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

