#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_poo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function effect_poo.effect_poo_C.ExecuteUbergraph_effect_poo
// 0x0060 (0x0060 - 0x0000)
struct Effect_poo_C_ExecuteUbergraph_effect_poo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_poo_Child_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_poo_C_ExecuteUbergraph_effect_poo) == 0x000010, "Wrong alignment on Effect_poo_C_ExecuteUbergraph_effect_poo");
static_assert(sizeof(Effect_poo_C_ExecuteUbergraph_effect_poo) == 0x000060, "Wrong size on Effect_poo_C_ExecuteUbergraph_effect_poo");
static_assert(offsetof(Effect_poo_C_ExecuteUbergraph_effect_poo, EntryPoint) == 0x000000, "Member 'Effect_poo_C_ExecuteUbergraph_effect_poo::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_poo_C_ExecuteUbergraph_effect_poo, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'Effect_poo_C_ExecuteUbergraph_effect_poo::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Effect_poo_C_ExecuteUbergraph_effect_poo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Effect_poo_C_ExecuteUbergraph_effect_poo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_poo_C_ExecuteUbergraph_effect_poo, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Effect_poo_C_ExecuteUbergraph_effect_poo::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_poo_C_ExecuteUbergraph_effect_poo, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'Effect_poo_C_ExecuteUbergraph_effect_poo::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_poo_C_ExecuteUbergraph_effect_poo, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'Effect_poo_C_ExecuteUbergraph_effect_poo::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function effect_poo.effect_poo_C.removeRanout
// 0x0001 (0x0001 - 0x0000)
struct Effect_poo_C_RemoveRanout final
{
public:
	bool                                          Destroy;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Effect_poo_C_RemoveRanout) == 0x000001, "Wrong alignment on Effect_poo_C_RemoveRanout");
static_assert(sizeof(Effect_poo_C_RemoveRanout) == 0x000001, "Wrong size on Effect_poo_C_RemoveRanout");
static_assert(offsetof(Effect_poo_C_RemoveRanout, Destroy) == 0x000000, "Member 'Effect_poo_C_RemoveRanout::Destroy' has a wrong offset!");

}

