#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function explosion.explosion_C.ExecuteUbergraph_explosion
// 0x04A0 (0x04A0 - 0x0000)
struct Explosion_C_ExecuteUbergraph_explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0090(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0100(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AburningDebris_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x01B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_2;                // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_3;                // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x02A0(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x02B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0350(0x0010)(ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_Select_Default_1;                           // 0x0360(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0370(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FB[0x1];                                      // 0x03FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_Chip_Pile;         // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosion_C_ExecuteUbergraph_explosion) == 0x000010, "Wrong alignment on Explosion_C_ExecuteUbergraph_explosion");
static_assert(sizeof(Explosion_C_ExecuteUbergraph_explosion) == 0x0004A0, "Wrong size on Explosion_C_ExecuteUbergraph_explosion");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, EntryPoint) == 0x000000, "Member 'Explosion_C_ExecuteUbergraph_explosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_name_Variable) == 0x00000C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_name_Variable_1) == 0x000014, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_name_Variable_2) == 0x00001C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_name_Variable_3) == 0x000024, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_name_Variable_4) == 0x00002C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_byte_Variable) == 0x000040, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_Select_Default) == 0x000044, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Variable) == 0x00004C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_bool_Has_Been_Initd_Variable) == 0x000054, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Variable_1) == 0x000058, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Variable_2) == 0x00007C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000080, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00008C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_obj_statDyn_obj) == 0x000090, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000A0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0000AC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_bool_IsClosed_Variable) == 0x0000B8, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomUnitVector_ReturnValue) == 0x0000BC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0000C8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000D4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000E0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_VectorVector_ReturnValue) == 0x0000EC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000F8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_object_Variable) == 0x000100, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomRotator_ReturnValue) == 0x000110, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000150, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000158, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00015C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000160, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Vector_Distance_ReturnValue) == 0x000168, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x00016C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000178, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x00017C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Lerp_ReturnValue) == 0x000188, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetActorScale3D_ReturnValue) == 0x00018C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_X) == 0x000198, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_Y) == 0x00019C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_Z) == 0x0001A0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001A4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001A8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0001AC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0001B0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_SphereOverlapActors_OutActors) == 0x0001B8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_SphereOverlapActors_ReturnValue) == 0x0001C8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001CC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_FClamp_ReturnValue) == 0x0001D8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects) == 0x0001E0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x0001F4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001F8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000200, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsPrimitive_Component) == 0x000208, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_1) == 0x000210, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000214, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x000218, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x000224, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000228, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00022C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_1) == 0x000230, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_2) == 0x000240, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_2) == 0x000248, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_3) == 0x000258, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_3) == 0x000260, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_4) == 0x000270, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000278, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetComponentBounds_Origin) == 0x000280, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetComponentBounds_BoxExtent) == 0x00028C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetComponentBounds_SphereRadius) == 0x000298, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_MakeArray_Array) == 0x0002A0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MakeHitResult_ReturnValue) == 0x0002B0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_8) == 0x000338, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Length_ReturnValue) == 0x000344, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Less_IntInt_ReturnValue_1) == 0x000348, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x00034C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_obj_static_obj) == 0x000350, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_Select_Default_1) == 0x000360, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000370, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0003F8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_bBlockingHit) == 0x0003F9, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003FA, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Time) == 0x0003FC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Distance) == 0x000400, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Location) == 0x000404, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_ImpactPoint) == 0x000410, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Normal) == 0x00041C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_ImpactNormal) == 0x000428, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_PhysMat) == 0x000438, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitActor) == 0x000440, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitComponent) == 0x000448, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitBoneName) == 0x000450, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitItem) == 0x000458, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_ElementIndex) == 0x00045C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_FaceIndex) == 0x000460, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_TraceStart) == 0x000464, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_TraceEnd) == 0x000470, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Add_ReturnValue) == 0x00047C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetObjectClass_ReturnValue) == 0x000480, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_ClassDynamicCast_AsActor_Chip_Pile) == 0x000488, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_ClassDynamicCast_AsActor_Chip_Pile' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_ClassDynamicCast_bSuccess) == 0x000490, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function explosion.explosion_C.runeCheck
// 0x00F0 (0x00F0 - 0x0000)
struct Explosion_C_RuneCheck final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_phys_obj;                             // 0x0028(0x0010)(ReferenceParm)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_rune_2_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosion_C_RuneCheck) == 0x000010, "Wrong alignment on Explosion_C_RuneCheck");
static_assert(sizeof(Explosion_C_RuneCheck) == 0x0000F0, "Wrong size on Explosion_C_RuneCheck");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Explosion_C_RuneCheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Explosion_C_RuneCheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Explosion_C_RuneCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_object_Variable) == 0x000010, "Member 'Explosion_C_RuneCheck::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_VSize_ReturnValue) == 0x000020, "Member 'Explosion_C_RuneCheck::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_obj_phys_obj) == 0x000028, "Member 'Explosion_C_RuneCheck::CallFunc_obj_phys_obj' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'Explosion_C_RuneCheck::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'Explosion_C_RuneCheck::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'Explosion_C_RuneCheck::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_FMin_ReturnValue) == 0x000044, "Member 'Explosion_C_RuneCheck::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Explosion_C_RuneCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Conv_FloatToString_ReturnValue) == 0x000058, "Member 'Explosion_C_RuneCheck::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_SphereOverlapActors_OutActors) == 0x000068, "Member 'Explosion_C_RuneCheck::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_SphereOverlapActors_ReturnValue) == 0x000078, "Member 'Explosion_C_RuneCheck::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Array_Get_Item) == 0x000080, "Member 'Explosion_C_RuneCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'Explosion_C_RuneCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, K2Node_DynamicCast_AsProp) == 0x000090, "Member 'Explosion_C_RuneCheck::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'Explosion_C_RuneCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'Explosion_C_RuneCheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'Explosion_C_RuneCheck::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'Explosion_C_RuneCheck::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000D8, "Member 'Explosion_C_RuneCheck::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E0, "Member 'Explosion_C_RuneCheck::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0000E8, "Member 'Explosion_C_RuneCheck::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function explosion.explosion_C.scorchmark
// 0x01B8 (0x01B8 - 0x0000)
struct Explosion_C_Scorchmark final
{
public:
	TArray<struct FVector>                        Vecs;                                              // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
