#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Figura

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function figura.figura_C.ExecuteUbergraph_figura
// 0x0B98 (0x0B98 - 0x0000)
struct Figura_C_ExecuteUbergraph_figura final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0048(0x0100)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0148(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x0164(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_8;                                // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0264(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0318(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x03AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0440(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0528(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x3];                                      // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0558(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x05E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0600(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0620(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x06D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_759[0x3];                                      // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x075C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0778(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0824(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0834(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_841[0x3];                                      // 0x0841(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0844(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0855(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_856[0x2];                                      // 0x0856(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0858(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0864(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0878(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0884(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0894(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A1[0x3];                                      // 0x08A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x08A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x08B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x08C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x08D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x08E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x08F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0904(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0910(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0920(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x092C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92D[0x3];                                      // 0x092D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxElement_ReturnValue;                // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKerfurOmegaV1_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsKerfur_Omega_V1_Skeleton_Anim_Blueprint; // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_951[0x3];                                      // 0x0951(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0958(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0964(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0970(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x097C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0A04(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0A10(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1C[0x4];                                      // 0x0A1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0A28(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0A34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0A3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_step_OutHit;                              // 0x0A40(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0AC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0ACC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0B54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B55[0x3];                                      // 0x0B55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0B58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0B60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0B68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B69[0x7];                                      // 0x0B69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0B78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0B7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0B80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0B84(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B85[0x3];                                      // 0x0B85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0B8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0B90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Figura_C_ExecuteUbergraph_figura) == 0x000008, "Wrong alignment on Figura_C_ExecuteUbergraph_figura");
static_assert(sizeof(Figura_C_ExecuteUbergraph_figura) == 0x000B98, "Wrong size on Figura_C_ExecuteUbergraph_figura");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, EntryPoint) == 0x000000, "Member 'Figura_C_ExecuteUbergraph_figura::EntryPoint' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_CustomEvent_MovementResult) == 0x000004, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, Temp_byte_Variable) == 0x000018, "Member 'Figura_C_ExecuteUbergraph_figura::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, Temp_bool_Has_Been_Initd_Variable) == 0x000038, "Member 'Figura_C_ExecuteUbergraph_figura::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_gamemode) == 0x000040, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_settings) == 0x000048, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_key_2) == 0x000148, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_pressed_1) == 0x000160, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_color) == 0x000164, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_picker) == 0x000178, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_texture) == 0x000180, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_index) == 0x000188, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_damage_6) == 0x00018C, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_8) == 0x000190, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_8' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_actor_1) == 0x000218, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_impact_1) == 0x000220, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_water_3) == 0x000230, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_water_2) == 0x000238, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_water_1) == 0x000240, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_water) == 0x000248, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_activate) == 0x000250, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_static) == 0x000251, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_frozen) == 0x000252, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_active) == 0x000253, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_actor) == 0x000258, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_damage_5) == 0x000260, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_7) == 0x000264, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_impact) == 0x0002EC, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_skipSetting) == 0x0002F8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_key_1) == 0x000300, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_18) == 0x000310, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_6) == 0x000318, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_damage_4) == 0x0003A0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_fuel) == 0x0003A4, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_damage_3) == 0x0003A8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hot) == 0x0003AC, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_17) == 0x000438, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_5) == 0x000440, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_action) == 0x0004C8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_16) == 0x0004D0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_15) == 0x0004D8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_damage_2) == 0x0004E0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_location_1) == 0x0004E4, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_14) == 0x0004F0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_13) == 0x0004F8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_12) == 0x000500, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_wheelDelta) == 0x000508, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_11) == 0x000510, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_mouse) == 0x000518, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_10) == 0x000520, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_key) == 0x000528, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_pressed) == 0x000540, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_temperature_1) == 0x000544, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_temperature) == 0x000548, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_speed) == 0x00054C, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_9) == 0x000550, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_4) == 0x000558, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_name_1) == 0x0005E0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_volume) == 0x0005F0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_8) == 0x0005F8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_location) == 0x000600, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_damage_1) == 0x00060C, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_clean_1) == 0x000610, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_7) == 0x000618, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_3) == 0x000620, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hook_1) == 0x0006A8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_clean) == 0x0006B0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_6) == 0x0006B8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hook) == 0x0006C0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_5) == 0x0006C8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_2) == 0x0006D0, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_kick) == 0x000758, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_name) == 0x00075C, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_4) == 0x000768, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_3) == 0x000770, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit_1) == 0x000778, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_damage) == 0x000800, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_2) == 0x000808, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player_1) == 0x000810, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_player) == 0x000818, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_DeltaSeconds) == 0x000820, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000824, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000830, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000834, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_CustomEvent_MovementResult_1) == 0x000840, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000844, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_VSize_ReturnValue) == 0x000850, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000854, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_BooleanAND_ReturnValue) == 0x000855, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000858, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000864, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetPlayerPawn_ReturnValue) == 0x000870, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000878, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000884, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_VSize_ReturnValue_1) == 0x000890, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000894, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0008A0, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Normal_ReturnValue) == 0x0008A4, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0008B0, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_CreateDelegate_OutputDelegate_2) == 0x0008B8, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0008C8, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_FindLookAtRotation_ReturnValue) == 0x0008D4, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetForwardVector_ReturnValue) == 0x0008E0, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_BreakRotator_Roll) == 0x0008EC, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_BreakRotator_Pitch) == 0x0008F0, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_BreakRotator_Yaw) == 0x0008F4, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0008F8, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_MakeRotator_ReturnValue) == 0x000904, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Normal_ReturnValue_1) == 0x000910, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Dot_VectorVector_ReturnValue) == 0x00091C, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetActorScale3D_ReturnValue) == 0x000920, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Less_FloatFloat_ReturnValue) == 0x00092C, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetMaxElement_ReturnValue) == 0x000930, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetMaxElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetAnimInstance_ReturnValue) == 0x000938, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_IsValid_ReturnValue) == 0x000940, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_DynamicCast_AsKerfur_Omega_V1_Skeleton_Anim_Blueprint) == 0x000948, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_DynamicCast_AsKerfur_Omega_V1_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_DynamicCast_bSuccess) == 0x000950, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000954, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetRightVector_ReturnValue) == 0x000958, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_RInterpTo_ReturnValue) == 0x000964, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_ComposeRotators_ReturnValue) == 0x000970, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00097C, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetForwardVector_ReturnValue_1) == 0x000A04, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000A10, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000A20, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000A28, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Vector_Distance_ReturnValue) == 0x000A34, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_FClamp_ReturnValue) == 0x000A38, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000A3C, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_step_OutHit) == 0x000A40, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_step_OutHit' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000AC8, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, K2Node_Event_hit) == 0x000ACC, "Member 'Figura_C_ExecuteUbergraph_figura::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, Temp_bool_IsClosed_Variable) == 0x000B54, "Member 'Figura_C_ExecuteUbergraph_figura::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000B58, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000B60, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_IsValid_ReturnValue_1) == 0x000B68, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000B70, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_GetDistanceTo_ReturnValue) == 0x000B78, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_BreakVector2D_X) == 0x000B7C, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Figura_C_ExecuteUbergraph_figura, CallFunc_BreakVector2D_Y) == 0x000B80, "Member 'Figura_C_ExecuteUbergraph_figura::CallFunc_BreakVector2D_Y' has a wrong offset!");
