#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroundHose

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_mVector_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function groundHose.groundHose_C.ExecuteUbergraph_groundHose
// 0x0BA0 (0x0BA0 - 0x0000)
struct GroundHose_C_ExecuteUbergraph_groundHose final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0010(0x0100)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0110(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0160(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x02C0(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue;      // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0330(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_hose_grab_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_hose_C*                           K2Node_DynamicCast_AsProp_Hose;                    // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_collectObject_collected;                  // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0xE];                                      // 0x0412(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0420(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0458(0x0010)(ConstParm, ReferenceParm)
	class AProp_hose_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0470(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_putObjectInventory2_return;               // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x04FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x04FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0510(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x051C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0564(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0580(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0594(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x05B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x05E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x05EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0630(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit; // 0x0644(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions; // 0x06D0(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination; // 0x06E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue; // 0x06EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x06ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x06EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EF[0x1];                                      // 0x06EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x06F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0704(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0710(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x071C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0738(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0754(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0760(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_bucket_C*                         K2Node_DynamicCast_AsProp_Bucket;                  // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x077A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B[0x1];                                      // 0x077B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0784(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0790(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x079C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x07A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4[0x4];                                      // 0x07B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x07C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x07E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x07F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0800(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0818(0x0010)(ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0828(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_arm_start;                                // 0x083C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x0848(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_arm_rotation;                             // 0x0854(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_862[0x2];                                      // 0x0862(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0864(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0870(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPhys_obj;                      // 0x0880(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0890(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A1[0x3];                                      // 0x08A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x08A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x092C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x092D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x092E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92F[0x1];                                      // 0x092F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0938(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0944(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x0950(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x095C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x0978(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x098C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x0994(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x09A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x09B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4[0x4];                                      // 0x09C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrowingPlant_C*                        K2Node_DynamicCast_AsGrowing_Plant;                // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D1[0x3];                                      // 0x09D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x09D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x09E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x09EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9ED[0x3];                                      // 0x09ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x09F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_2;        // 0x0A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0A7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A81[0x3];                                      // 0x0A81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0A84(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_1; // 0x0B0C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GroundHose_C_ExecuteUbergraph_groundHose) == 0x000010, "Wrong alignment on GroundHose_C_ExecuteUbergraph_groundHose");
static_assert(sizeof(GroundHose_C_ExecuteUbergraph_groundHose) == 0x000BA0, "Wrong size on GroundHose_C_ExecuteUbergraph_groundHose");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, EntryPoint) == 0x000000, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::EntryPoint' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_gamemode) == 0x000008, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_settings) == 0x000010, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_key) == 0x000110, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_pressed) == 0x000128, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_color) == 0x00012C, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_picker) == 0x000140, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_texture) == 0x000148, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_index) == 0x000150, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_player_6) == 0x000158, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_hit_2) == 0x000160, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_kick) == 0x0001E8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_name) == 0x0001EC, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_player_5) == 0x0001F8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_player_4) == 0x000200, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_hit_1) == 0x000208, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_damage) == 0x000290, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_player_3) == 0x000298, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_player_2) == 0x0002A0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_player_1) == 0x0002A8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_getMainPlayer_AsMain_Player) == 0x0002B0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_DeltaSeconds) == 0x0002B8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002BC, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_obj_static_obj) == 0x0002C0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002D0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002DC, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Vector_Distance_ReturnValue) == 0x0002E8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0002EC, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0002F0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002F4, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Array_LastIndex_ReturnValue) == 0x000300, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Add_IntInt_ReturnValue) == 0x000304, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetTangentAtSplinePoint_ReturnValue) == 0x000308, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_IsValid_ReturnValue) == 0x000314, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000318, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_player) == 0x000328, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_hit) == 0x000330, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_Event_action) == 0x0003B8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetTransform_ReturnValue) == 0x0003C0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_IsValid_ReturnValue_1) == 0x0003F0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003F8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_FinishSpawningActor_ReturnValue) == 0x000400, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_DynamicCast_AsProp_Hose) == 0x000408, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_DynamicCast_AsProp_Hose' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_DynamicCast_bSuccess) == 0x000410, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_collectObject_collected) == 0x000411, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_collectObject_collected' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetTransform_ReturnValue_1) == 0x000420, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000450, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, Temp_object_Variable) == 0x000458, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000468, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000470, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0004F8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_putObjectInventory2_return) == 0x0004F9, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_putObjectInventory2_return' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_bBlockingHit) == 0x0004FA, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_bInitialOverlap) == 0x0004FB, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Time) == 0x0004FC, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Distance) == 0x000500, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Location) == 0x000504, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_ImpactPoint) == 0x000510, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Normal) == 0x00051C, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_ImpactNormal) == 0x000528, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_PhysMat) == 0x000538, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitActor) == 0x000540, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitComponent) == 0x000548, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitBoneName) == 0x000550, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitItem) == 0x000558, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_ElementIndex) == 0x00055C, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_FaceIndex) == 0x000560, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_TraceStart) == 0x000564, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_TraceEnd) == 0x000570, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Conv_FloatToString_ReturnValue) == 0x000580, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000590, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000594, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Array_Add_ReturnValue) == 0x0005A0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0005A8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetTransform_ReturnValue_2) == 0x0005B0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakTransform_Location) == 0x0005E0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakTransform_Rotation) == 0x0005EC, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakTransform_Scale) == 0x0005F8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetForwardVector_ReturnValue) == 0x000604, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000610, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00061C, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000628, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, K2Node_MakeArray_Array) == 0x000630, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000640, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit) == 0x000644, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutHit' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions) == 0x0006D0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutPathPositions' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination) == 0x0006E0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_OutLastTraceDestination' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue) == 0x0006EC, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_Blueprint_PredictProjectilePath_ByTraceChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0006ED, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0006EE, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Time_1) == 0x0006F0, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Distance_1) == 0x0006F4, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Location_1) == 0x0006F8, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000704, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_Normal_1) == 0x000710, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_ImpactNormal_1) == 0x00071C, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_PhysMat_1) == 0x000728, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitActor_1) == 0x000730, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitComponent_1) == 0x000738, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitBoneName_1) == 0x000740, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_HitItem_1) == 0x000748, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_ElementIndex_1) == 0x00074C, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(GroundHose_C_ExecuteUbergraph_groundHose, CallFunc_BreakHitResult_FaceIndex_1) == 0x000750, "Member 'GroundHose_C_ExecuteUbergraph_groundHose::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
