#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrowingPlant

#include "Basic.hpp"

#include "Struct_mFloat_structs.hpp"
#include "Struct_farmPlant_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_food_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_prop3_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function growingPlant.growingPlant_C.ExecuteUbergraph_growingPlant
// 0x0810 (0x0810 - 0x0000)
struct GrowingPlant_C_ExecuteUbergraph_growingPlant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_6;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0118(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x01D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0260(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A3[0x1];                                      // 0x02A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x02A4(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object;                      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x02D0(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue_1;               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData_1;                  // 0x0354(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object_1;                    // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood_1;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard_1;             // 0x0380(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0420(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut_1;       // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x046B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_farmPot_C*                        K2Node_DynamicCast_AsProp_Farm_Pot;                // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_getKey_key;                               // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x04C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C6[0x2];                                      // 0x04C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CE[0x2];                                      // 0x04CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x04DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x04F8(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0508(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A[0x2];                                      // 0x059A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_2;        // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x05BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x05BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x05CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0664(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_impactDamage_self_CastInput;              // 0x0678(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_damage;                               // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x068C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0720(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_fireDamage_self_CastInput;                // 0x0730(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0740(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74C[0x4];                                      // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_impactDamage_self_CastInput_1;            // 0x0750(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_3;        // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0765(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_766[0xA];                                      // 0x0766(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0770(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_1;                 // 0x07B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return_1;                          // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x07F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_putObjectInventory2_return;               // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x080A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrowingPlant_C_ExecuteUbergraph_growingPlant) == 0x000010, "Wrong alignment on GrowingPlant_C_ExecuteUbergraph_growingPlant");
static_assert(sizeof(GrowingPlant_C_ExecuteUbergraph_growingPlant) == 0x000810, "Wrong size on GrowingPlant_C_ExecuteUbergraph_growingPlant");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, EntryPoint) == 0x000000, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::EntryPoint' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable) == 0x000004, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_1) == 0x000014, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000018, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_2) == 0x000020, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000024, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_3) == 0x00002C, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_4) == 0x000030, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_IntInt_ReturnValue_3) == 0x000034, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_5) == 0x000038, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_IntInt_ReturnValue_4) == 0x00003C, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_object_Variable) == 0x000040, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_6) == 0x000060, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_7) == 0x000064, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_player_6) == 0x000068, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_hit_4) == 0x000070, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_kick) == 0x0000F8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_name) == 0x0000FC, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_player_5) == 0x000108, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_player_4) == 0x000110, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_hit_3) == 0x000118, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_damage_3) == 0x0001A0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_player_3) == 0x0001A8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_player_2) == 0x0001B0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_player_1) == 0x0001B8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_DeltaSeconds) == 0x0001C0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_player) == 0x0001C8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_hit_2) == 0x0001D0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_action) == 0x000258, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_SwitchEnum_CmpSuccess) == 0x000259, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_GetTransform_ReturnValue) == 0x000260, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000290, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_FinishSpawningActor_ReturnValue) == 0x000298, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0002A0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x0002A1, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_ReturnValue) == 0x0002A2, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_foodData) == 0x0002A4, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_object) == 0x0002C0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_isFood) == 0x0002C8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_fuckYouRetard) == 0x0002D0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_ReturnValue_1) == 0x000350, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_foodData_1) == 0x000354, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_foodData_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_object_1) == 0x000370, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_object_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_isFood_1) == 0x000378, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_isFood_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_propToObject_fuckYouRetard_1) == 0x000380, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_propToObject_fuckYouRetard_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_IsValidClass_ReturnValue) == 0x000400, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000408, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_IsValidClass_ReturnValue_1) == 0x000410, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000418, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_AsInt_Player) == 0x000420, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_bSuccess) == 0x000430, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000438, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_asProp_return) == 0x000440, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Conv_NameToString_ReturnValue) == 0x000448, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000458, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000460, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_VictoryFloatMinusEquals_FloatOut_1) == 0x000464, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_VictoryFloatMinusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000468, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000469, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00046A, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x00046B, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_SelectFloat_ReturnValue_1) == 0x00046C, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_GetOwner_ReturnValue) == 0x000470, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_AsInt_Objects) == 0x000478, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_bSuccess_1) == 0x000488, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_AsProp_Farm_Pot) == 0x000490, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_AsProp_Farm_Pot' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_bSuccess_2) == 0x000498, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_getKey_key) == 0x0004A0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_GetOwner_ReturnValue_1) == 0x0004B0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_CustomEvent_DestroyedActor) == 0x0004B8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, Temp_int_Variable_8) == 0x0004C0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x0004C4, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x0004C5, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_IntInt_ReturnValue_5) == 0x0004C8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BooleanOR_ReturnValue) == 0x0004CC, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BooleanAND_ReturnValue) == 0x0004CD, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004D0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_VectorVector_ReturnValue) == 0x0004DC, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0004E8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0004EC, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_obj_static_obj) == 0x0004F8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000508, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000590, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000594, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Less_FloatFloat_ReturnValue) == 0x000598, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Greater_FloatFloat_ReturnValue_5) == 0x000599, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Greater_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_SelectFloat_ReturnValue_2) == 0x00059C, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0005A0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0005A4, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0005A8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0005AC, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x0005B0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_VictoryFloatPlusEquals_FloatOut_2) == 0x0005B4, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_VictoryFloatPlusEquals_FloatOut_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0005B8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0005B9, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Greater_FloatFloat_ReturnValue_6) == 0x0005BA, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Greater_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_SetStaticMesh_ReturnValue) == 0x0005BB, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0005BC, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_actor_1) == 0x0005C0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_damage_2) == 0x0005C8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_hit_1) == 0x0005CC, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_impact_1) == 0x000654, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_skipSetting) == 0x000660, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000664, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_damage_1) == 0x000670, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_impactDamage_self_CastInput) == 0x000678, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_impactDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_damage) == 0x000688, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_hit) == 0x00068C, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_actor) == 0x000718, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_Event_impact) == 0x000720, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_fireDamage_self_CastInput) == 0x000730, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_fireDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x000740, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_impactDamage_self_CastInput_1) == 0x000750, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_impactDamage_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_VictoryFloatPlusEquals_FloatOut_3) == 0x000760, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_VictoryFloatPlusEquals_FloatOut_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x000764, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000765, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_GetTransform_ReturnValue_1) == 0x000770, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0007A0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x0007A8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0007B0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_AsInt_Player_1) == 0x0007B8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_AsInt_Player_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, K2Node_DynamicCast_bSuccess_3) == 0x0007C8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x0007D0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_asProp_return_1) == 0x0007D8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_asProp_return_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5) == 0x0007E0, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GrowingPlant_C_ExecuteUbergraph_growingPlant, CallFunc_FinishSpawningActor_ReturnValue_5) == 0x0007E8, "Member 'GrowingPlant_C_ExecuteUbergraph_growingPlant::CallFunc_FinishSpawningActor_ReturnValue_5' has a wrong offset!");
