#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrowingPlant_pine

#include "Basic.hpp"

#include "Struct_food_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_prop3_structs.hpp"


namespace SDK::Params
{

// Function growingPlant_pine.growingPlant_pine_C.ExecuteUbergraph_growingPlant_pine
// 0x0230 (0x0230 - 0x0000)
struct GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x0114(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x0140(0x0080)(HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x01C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0210(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine) == 0x000010, "Wrong alignment on GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine");
static_assert(sizeof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine) == 0x000230, "Wrong size on GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, EntryPoint) == 0x000000, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::EntryPoint' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, Temp_int_Variable) == 0x000040, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, Temp_int_Variable_1) == 0x00004C, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, Temp_int_Variable_2) == 0x000058, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00005C, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000064, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B0, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_ComposeTransforms_ReturnValue) == 0x0000C0, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000F8, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_FinishSpawningActor_ReturnValue) == 0x000100, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000108, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_propToObject_ReturnValue) == 0x000110, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_propToObject_foodData) == 0x000114, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_propToObject_object) == 0x000130, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_propToObject_isFood) == 0x000138, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_propToObject_fuckYouRetard) == 0x000140, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, Temp_name_Variable) == 0x0001C0, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0001C8, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_IsValidClass_ReturnValue) == 0x0001D0, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0001D8, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, K2Node_DynamicCast_AsInt_Player) == 0x0001E0, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_asProp_return) == 0x0001F8, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_Conv_NameToString_ReturnValue) == 0x000200, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, Temp_name_Variable_1) == 0x000210, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, Temp_int_Variable_3) == 0x000218, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, Temp_int_Variable_4) == 0x00021C, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_Add_IntInt_ReturnValue_3) == 0x000220, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000224, "Member 'GrowingPlant_pine_C_ExecuteUbergraph_growingPlant_pine::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");

}

