#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Insomniac

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function insomniac.insomniac_C.ExecuteUbergraph_insomniac
// 0x0480 (0x0480 - 0x0000)
struct Insomniac_C_ExecuteUbergraph_insomniac final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0090(0x0010)(ConstParm, ReferenceParm)
	class UblackScreen_C*                         CallFunc_Create_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInsomniac_Skeleton_AnimBlueprint_C*    K2Node_DynamicCast_AsInsomniac_Skeleton_Anim_Blueprint; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_1;          // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_2;          // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_3;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_3;          // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_2;         // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_GetCurrentPath_ReturnValue;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0250(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x026C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E[0x2];                                      // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_GetCurrentPath_ReturnValue_1;             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_4;     // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_5;     // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_6;     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_3;         // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_10;       // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_11;       // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0454(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466[0x2];                                      // 0x0466(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Insomniac_C_ExecuteUbergraph_insomniac) == 0x000008, "Wrong alignment on Insomniac_C_ExecuteUbergraph_insomniac");
static_assert(sizeof(Insomniac_C_ExecuteUbergraph_insomniac) == 0x000480, "Wrong size on Insomniac_C_ExecuteUbergraph_insomniac");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, EntryPoint) == 0x000000, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::EntryPoint' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, Temp_byte_Variable) == 0x000004, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CustomEvent_NotifyName_4) == 0x000018, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CustomEvent_NotifyName_3) == 0x000020, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CustomEvent_NotifyName_2) == 0x000038, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CustomEvent_NotifyName_1) == 0x000050, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CustomEvent_NotifyName) == 0x000068, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, Temp_name_Variable) == 0x000080, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000088, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x00008C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, Temp_object_Variable) == 0x000090, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Create_ReturnValue) == 0x0000A0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetAnimInstance_ReturnValue) == 0x0000B0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000B8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_DynamicCast_AsInsomniac_Skeleton_Anim_Blueprint) == 0x0000C0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_DynamicCast_AsInsomniac_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetCameraLocation_ReturnValue) == 0x0000CC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000D8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetVelocity_ReturnValue) == 0x0000E0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_VSize_ReturnValue) == 0x0000EC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000F8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000101, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000104, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000108, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetCameraLocation_ReturnValue_1) == 0x000110, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetCameraLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00011C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_getMainPlayer_AsMain_Player) == 0x000128, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_FindLookAtRotation_ReturnValue) == 0x000130, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BreakRotator_Roll) == 0x00013C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BreakRotator_Pitch) == 0x000140, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BreakRotator_Yaw) == 0x000144, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerController_ReturnValue) == 0x000148, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_MakeRotator_ReturnValue) == 0x000150, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetControlRotation_ReturnValue) == 0x00015C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000168, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000170, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetCameraLocation_ReturnValue_2) == 0x000178, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetCameraLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000184, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CustomEvent_MovementResult) == 0x000190, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000194, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_RLerp_ReturnValue) == 0x0001A0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerCameraManager_ReturnValue_3) == 0x0001B0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetCameraLocation_ReturnValue_3) == 0x0001B8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetCameraLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001C4, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0001D0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_FindLookAtRotation_ReturnValue_2) == 0x0001D4, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_FindLookAtRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BreakRotator_Roll_1) == 0x0001E0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BreakRotator_Pitch_1) == 0x0001E4, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BreakRotator_Yaw_1) == 0x0001E8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_MakeRotator_ReturnValue_1) == 0x0001EC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_FInterpTo_ReturnValue) == 0x0001F8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x0001FC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0001FD, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CreateDelegate_OutputDelegate_5) == 0x000200, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000210, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetController_ReturnValue) == 0x000218, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetCurrentPath_ReturnValue) == 0x000220, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetCurrentPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_IsValid_ReturnValue_1) == 0x000228, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Array_LastIndex_ReturnValue) == 0x00022C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000230, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Array_Get_Item) == 0x000238, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000244, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_obj_static_obj) == 0x000250, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000260, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_LineTraceSingleForObjects_OutHit) == 0x00026C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0002F4, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x0002F8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000300, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x00030C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Vector_Distance_ReturnValue) == 0x000318, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00031C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CustomEvent_MovementResult_1) == 0x00031D, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetController_ReturnValue_1) == 0x000320, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetCurrentPath_ReturnValue_1) == 0x000328, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetCurrentPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerController_ReturnValue_1) == 0x000330, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_IsValid_ReturnValue_2) == 0x000338, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetControlRotation_ReturnValue_1) == 0x00033C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetControlRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000348, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000354, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerCameraManager_ReturnValue_4) == 0x000358, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerCameraManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000360, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x00036C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_RandomUnitVector_ReturnValue) == 0x000370, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_8) == 0x00037C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerCameraManager_ReturnValue_5) == 0x000388, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerCameraManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetPlayerCameraManager_ReturnValue_6) == 0x000390, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetPlayerCameraManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_9) == 0x000398, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_GetActorForwardVector_ReturnValue) == 0x0003A4, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003B0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Normal_ReturnValue) == 0x0003BC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0003C8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Dot_VectorVector_ReturnValue) == 0x0003CC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0003D0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_FClamp_ReturnValue) == 0x0003D4, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0003D8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Lerp_ReturnValue) == 0x0003DC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003E0, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Add_VectorVector_ReturnValue) == 0x0003EC, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_FindLookAtRotation_ReturnValue_3) == 0x0003F8, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_FindLookAtRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000408, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_RInterpTo_ReturnValue) == 0x000410, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_10) == 0x00041C, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_K2_GetActorLocation_ReturnValue_11) == 0x000428, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_K2_GetActorLocation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000434, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_getMainPlayer_AsMain_Player_2) == 0x000440, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_SetVectorLength_ReturnValue) == 0x000448, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, K2Node_CreateDelegate_OutputDelegate_6) == 0x000454, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BooleanOR_ReturnValue) == 0x000464, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BooleanOR_ReturnValue_1) == 0x000465, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000468, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000470, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_IsValid_ReturnValue_3) == 0x000478, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BooleanOR_ReturnValue_2) == 0x000479, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00047A, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Insomniac_C_ExecuteUbergraph_insomniac, CallFunc_BooleanOR_ReturnValue_3) == 0x00047B, "Member 'Insomniac_C_ExecuteUbergraph_insomniac::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function insomniac.insomniac_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Insomniac_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Insomniac_C_ReceiveTick) == 0x000004, "Wrong alignment on Insomniac_C_ReceiveTick");
static_assert(sizeof(Insomniac_C_ReceiveTick) == 0x000004, "Wrong size on Insomniac_C_ReceiveTick");
static_assert(offsetof(Insomniac_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Insomniac_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function insomniac.insomniac_C.OnCompleted_1A9050824C2776F602A04D9627382DA6
// 0x0008 (0x0008 - 0x0000)
struct Insomniac_C_OnCompleted_1A9050824C2776F602A04D9627382DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Insomniac_C_OnCompleted_1A9050824C2776F602A04D9627382DA6) == 0x000004, "Wrong alignment on Insomniac_C_OnCompleted_1A9050824C2776F602A04D9627382DA6");
static_assert(sizeof(Insomniac_C_OnCompleted_1A9050824C2776F602A04D9627382DA6) == 0x000008, "Wrong size on Insomniac_C_OnCompleted_1A9050824C2776F602A04D9627382DA6");
static_assert(offsetof(Insomniac_C_OnCompleted_1A9050824C2776F602A04D9627382DA6, NotifyName) == 0x000000, "Member 'Insomniac_C_OnCompleted_1A9050824C2776F602A04D9627382DA6::NotifyName' has a wrong offset!");

// Function insomniac.insomniac_C.OnBlendOut_1A9050824C2776F602A04D9627382DA6
// 0x0008 (0x0008 - 0x0000)
struct Insomniac_C_OnBlendOut_1A9050824C2776F602A04D9627382DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Insomniac_C_OnBlendOut_1A9050824C2776F602A04D9627382DA6) == 0x000004, "Wrong alignment on Insomniac_C_OnBlendOut_1A9050824C2776F602A04D9627382DA6");
static_assert(sizeof(Insomniac_C_OnBlendOut_1A9050824C2776F602A04D9627382DA6) == 0x000008, "Wrong size on Insomniac_C_OnBlendOut_1A9050824C2776F602A04D9627382DA6");
static_assert(offsetof(Insomniac_C_OnBlendOut_1A9050824C2776F602A04D9627382DA6, NotifyName) == 0x000000, "Member 'Insomniac_C_OnBlendOut_1A9050824C2776F602A04D9627382DA6::NotifyName' has a wrong offset!");

// Function insomniac.insomniac_C.OnInterrupted_1A9050824C2776F602A04D9627382DA6
// 0x0008 (0x0008 - 0x0000)
struct Insomniac_C_OnInterrupted_1A9050824C2776F602A04D9627382DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Insomniac_C_OnInterrupted_1A9050824C2776F602A04D9627382DA6) == 0x000004, "Wrong alignment on Insomniac_C_OnInterrupted_1A9050824C2776F602A04D9627382DA6");
static_assert(sizeof(Insomniac_C_OnInterrupted_1A9050824C2776F602A04D9627382DA6) == 0x000008, "Wrong size on Insomniac_C_OnInterrupted_1A9050824C2776F602A04D9627382DA6");
static_assert(offsetof(Insomniac_C_OnInterrupted_1A9050824C2776F602A04D9627382DA6, NotifyName) == 0x000000, "Member 'Insomniac_C_OnInterrupted_1A9050824C2776F602A04D9627382DA6::NotifyName' has a wrong offset!");

// Function insomniac.insomniac_C.OnNotifyBegin_1A9050824C2776F602A04D9627382DA6
// 0x0008 (0x0008 - 0x0000)
struct Insomniac_C_OnNotifyBegin_1A9050824C2776F602A04D9627382DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Insomniac_C_OnNotifyBegin_1A9050824C2776F602A04D9627382DA6) == 0x000004, "Wrong alignment on Insomniac_C_OnNotifyBegin_1A9050824C2776F602A04D9627382DA6");
static_assert(sizeof(Insomniac_C_OnNotifyBegin_1A9050824C2776F602A04D9627382DA6) == 0x000008, "Wrong size on Insomniac_C_OnNotifyBegin_1A9050824C2776F602A04D9627382DA6");
static_assert(offsetof(Insomniac_C_OnNotifyBegin_1A9050824C2776F602A04D9627382DA6, NotifyName) == 0x000000, "Member 'Insomniac_C_OnNotifyBegin_1A9050824C2776F602A04D9627382DA6::NotifyName' has a wrong offset!");

// Function insomniac.insomniac_C.OnNotifyEnd_1A9050824C2776F602A04D9627382DA6
// 0x0008 (0x0008 - 0x0000)
struct Insomniac_C_OnNotifyEnd_1A9050824C2776F602A04D9627382DA6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Insomniac_C_OnNotifyEnd_1A9050824C2776F602A04D9627382DA6) == 0x000004, "Wrong alignment on Insomniac_C_OnNotifyEnd_1A9050824C2776F602A04D9627382DA6");
static_assert(sizeof(Insomniac_C_OnNotifyEnd_1A9050824C2776F602A04D9627382DA6) == 0x000008, "Wrong size on Insomniac_C_OnNotifyEnd_1A9050824C2776F602A04D9627382DA6");
static_assert(offsetof(Insomniac_C_OnNotifyEnd_1A9050824C2776F602A04D9627382DA6, NotifyName) == 0x000000, "Member 'Insomniac_C_OnNotifyEnd_1A9050824C2776F602A04D9627382DA6::NotifyName' has a wrong offset!");

// Function insomniac.insomniac_C.OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D
// 0x0001 (0x0001 - 0x0000)
struct Insomniac_C_OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Insomniac_C_OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D) == 0x000001, "Wrong alignment on Insomniac_C_OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D");
static_assert(sizeof(Insomniac_C_OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D) == 0x000001, "Wrong size on Insomniac_C_OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D");
static_assert(offsetof(Insomniac_C_OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D, MovementResult) == 0x000000, "Member 'Insomniac_C_OnSuccess_B694B567498643F56EBCC5B4D7CD8C9D::MovementResult' has a wrong offset!");

// Function insomniac.insomniac_C.OnFail_B694B567498643F56EBCC5B4D7CD8C9D
// 0x0001 (0x0001 - 0x0000)
struct Insomniac_C_OnFail_B694B567498643F56EBCC5B4D7CD8C9D final
{
public:
