#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmegaV1_Skeleton_AnimBlueprint1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass kerfurOmegaV1_Skeleton_AnimBlueprint1.kerfurOmegaV1_Skeleton_AnimBlueprint1_C
// 0x0BA0 (0x0E60 - 0x02C0)
class UKerfurOmegaV1_Skeleton_AnimBlueprint1_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02C8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x02E8(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03F0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0410(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0518(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0598(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x05C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x06D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x07D8(0x0108)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x08E0(0x01B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0A90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0B98(0x0108)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0CA0(0x01B0)()
	bool                                          LookSide;                                          // 0x0E50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_E51[0x3];                                      // 0x0E51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookAt;                                            // 0x0E54(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_84E1E7B54409A06908966BA5165E6874();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_B876763F4596AA82E0301380C67BF9A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_81CB01484A80492D9890758AB7F90E21();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_AFCBED434818B2643729DD9F658D39F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_AFEBD51D428584A243335AB175BB8FB6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_6A5C71CD416E8B4543E151979DC21A15();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_24D4041746D03EC783C1538CC09714FF();
	struct FRotator Randrot(float Max);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"kerfurOmegaV1_Skeleton_AnimBlueprint1_C">();
	}
	static class UKerfurOmegaV1_Skeleton_AnimBlueprint1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKerfurOmegaV1_Skeleton_AnimBlueprint1_C>();
	}
};
static_assert(alignof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C) == 0x000010, "Wrong alignment on UKerfurOmegaV1_Skeleton_AnimBlueprint1_C");
static_assert(sizeof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C) == 0x000E60, "Wrong size on UKerfurOmegaV1_Skeleton_AnimBlueprint1_C");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, UberGraphFrame) == 0x0002C0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_LocalToComponentSpace) == 0x0002C8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_6) == 0x0002E8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003F0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_5) == 0x000410, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_SequencePlayer) == 0x000518, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_Root) == 0x000598, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_4) == 0x0005C8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_3) == 0x0006D0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_2) == 0x0007D8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_LookAt_1) == 0x0008E0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_1) == 0x000A90, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone) == 0x000B98, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_LookAt) == 0x000CA0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, LookSide) == 0x000E50, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::LookSide' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, LookAt) == 0x000E54, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::LookAt' has a wrong offset!");

}

