#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Killerwisp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function killerwisp.killerwisp_C.ExecuteUbergraph_killerwisp
// 0x08E0 (0x08E0 - 0x0000)
struct Killerwisp_C_ExecuteUbergraph_killerwisp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_5;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_4;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_2;                              // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_2;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x01EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_pawn_obj;                             // 0x0208(0x0010)(ReferenceParm)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0220(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0274(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0290(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x02FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x039C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x03A4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x03B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x03F8(0x0010)(ZeroConstructor, NoDestructor)
	class AProp_bloodGib_arm_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_leg_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_leg_C*                   CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_arm_C*                   CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_3;         // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x049C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKillerWispAnim1_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsKiller_Wisp_Anim_1_Skeleton_Anim_Blueprint; // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_forward;                        // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A[0x2];                                      // 0x055A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Actor;                  // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_ComponentBoundEvent_Stimulus;               // 0x0580(0x003C)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_canReach_ReturnValue;                     // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_canReach_ReturnValue_1;                   // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CB[0x1];                                      // 0x05CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x05DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x05F0(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0600(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63A[0x6];                                      // 0x063A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_ComponentBoundEvent_UpdatedActors;          // 0x0640(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0650(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x065C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x0668(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x068E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x068F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0692(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0693(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x3];                                      // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x06A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_2;    // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x06E8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_4;         // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_5;         // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_715[0x3];                                      // 0x0715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue_1;              // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x071C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x071D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71E[0x2];                                      // 0x071E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_6;         // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_3;            // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActorPerceptionUpdateInfo             K2Node_ComponentBoundEvent_UpdateInfo;             // 0x0750(0x0048)(ConstParm, NoDestructor)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_2;          // 0x0798(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_2;        // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_4;            // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x07BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x07C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x07D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKerfurOmega_C*                         K2Node_DynamicCast_AsKerfur_Omega;                 // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9[0x3];                                      // 0x07E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x07EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_801[0x3];                                      // 0x0801(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0804(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0810(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IInt_objects_C>        CallFunc_addDamage_self_CastInput;                 // 0x0898(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A9[0x3];                                      // 0x08A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x08AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x08C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C5[0x3];                                      // 0x08C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D1[0x3];                                      // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x08D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x08DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x08DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x08DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x08DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Killerwisp_C_ExecuteUbergraph_killerwisp) == 0x000010, "Wrong alignment on Killerwisp_C_ExecuteUbergraph_killerwisp");
static_assert(sizeof(Killerwisp_C_ExecuteUbergraph_killerwisp) == 0x0008E0, "Wrong size on Killerwisp_C_ExecuteUbergraph_killerwisp");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, EntryPoint) == 0x000000, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_10) == 0x000008, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_name_Variable) == 0x000020, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_VLerp_ReturnValue) == 0x000028, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_5) == 0x000034, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_5' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_4) == 0x000048, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_4' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_byte_Variable) == 0x00005C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000060, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_VLerp_ReturnValue_1) == 0x000064, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_3) == 0x000070, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_3' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_2) == 0x000084, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_4) == 0x000088, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_byte_Variable_1) == 0x000098, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_object_Variable) == 0x0000A0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_object_Variable_1) == 0x0000B0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_9) == 0x0000C0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000C8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_8) == 0x0000D8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000E0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_7) == 0x0000F0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000F8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_6) == 0x000108, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_8) == 0x000110, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_5) == 0x000120, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_9) == 0x000128, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_name_Variable_1) == 0x000138, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_SwitchName_CmpSuccess) == 0x000140, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_4) == 0x000144, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_10) == 0x00014C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_3) == 0x00015C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_11) == 0x000164, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_2) == 0x000174, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_12) == 0x00017C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_1) == 0x00018C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_13) == 0x000194, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName) == 0x0001A4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_14) == 0x0001AC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_name_Variable_2) == 0x0001BC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_15) == 0x0001C4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_1) == 0x0001D4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult) == 0x0001D5, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_16) == 0x0001D8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_byte_Variable_2) == 0x0001E8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_17) == 0x0001EC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000200, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_obj_pawn_obj) == 0x000208, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_obj_pawn_obj' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000218, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_GetTransform_ReturnValue) == 0x000220, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Location) == 0x000250, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Rotation) == 0x00025C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Scale) == 0x000268, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_11) == 0x000274, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00027C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_getMainPlayer_AsMain_Player) == 0x000280, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000290, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Location_1) == 0x0002C0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Rotation_1) == 0x0002CC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Scale_1) == 0x0002D8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_getMainPlayer_AsMain_Player_1) == 0x0002E8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_VInterpTo_ReturnValue) == 0x0002F0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0002FC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000384, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_18) == 0x000388, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_int_Array_Index_Variable) == 0x000398, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_12) == 0x00039C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_19) == 0x0003A4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_13) == 0x0003B4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_MakeTransform_ReturnValue) == 0x0003C0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003F0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_20) == 0x0003F8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_FinishSpawningActor_ReturnValue) == 0x000408, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000410, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000418, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000420, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000428, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
