#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LampPost

#include "Basic.hpp"


namespace SDK::Params
{

// Function lampPost.lampPost_C.ExecuteUbergraph_lampPost
// 0x0038 (0x0038 - 0x0000)
struct LampPost_C_ExecuteUbergraph_lampPost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Weight;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_2;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LampPost_C_ExecuteUbergraph_lampPost) == 0x000008, "Wrong alignment on LampPost_C_ExecuteUbergraph_lampPost");
static_assert(sizeof(LampPost_C_ExecuteUbergraph_lampPost) == 0x000038, "Wrong size on LampPost_C_ExecuteUbergraph_lampPost");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, EntryPoint) == 0x000000, "Member 'LampPost_C_ExecuteUbergraph_lampPost::EntryPoint' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'LampPost_C_ExecuteUbergraph_lampPost::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_Less_IntInt_ReturnValue) == 0x00000A, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_BooleanOR_ReturnValue_1) == 0x00000E, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00000F, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_RandomBoolWithWeight_ReturnValue_1) == 0x000010, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_RandomBoolWithWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, K2Node_CustomEvent_Weight) == 0x000014, "Member 'LampPost_C_ExecuteUbergraph_lampPost::K2Node_CustomEvent_Weight' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_RandomBoolWithWeight_ReturnValue_2) == 0x00001C, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_RandomBoolWithWeight_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001E, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000020, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LampPost_C_ExecuteUbergraph_lampPost, CallFunc_Array_RemoveItem_ReturnValue) == 0x000030, "Member 'LampPost_C_ExecuteUbergraph_lampPost::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function lampPost.lampPost_C.blink
// 0x0004 (0x0004 - 0x0000)
struct LampPost_C_blink final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LampPost_C_blink) == 0x000004, "Wrong alignment on LampPost_C_blink");
static_assert(sizeof(LampPost_C_blink) == 0x000004, "Wrong size on LampPost_C_blink");
static_assert(offsetof(LampPost_C_blink, Weight) == 0x000000, "Member 'LampPost_C_blink::Weight' has a wrong offset!");

// Function lampPost.lampPost_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LampPost_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LampPost_C_ReceiveTick) == 0x000004, "Wrong alignment on LampPost_C_ReceiveTick");
static_assert(sizeof(LampPost_C_ReceiveTick) == 0x000004, "Wrong size on LampPost_C_ReceiveTick");
static_assert(offsetof(LampPost_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LampPost_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function lampPost.lampPost_C.upd
// 0x0020 (0x0020 - 0x0000)
struct LampPost_C_Upd final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LampPost_C_Upd) == 0x000008, "Wrong alignment on LampPost_C_Upd");
static_assert(sizeof(LampPost_C_Upd) == 0x000020, "Wrong size on LampPost_C_Upd");
static_assert(offsetof(LampPost_C_Upd, Temp_bool_Variable) == 0x000000, "Member 'LampPost_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LampPost_C_Upd, Temp_object_Variable) == 0x000008, "Member 'LampPost_C_Upd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LampPost_C_Upd, Temp_object_Variable_1) == 0x000010, "Member 'LampPost_C_Upd::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(LampPost_C_Upd, K2Node_Select_Default) == 0x000018, "Member 'LampPost_C_Upd::K2Node_Select_Default' has a wrong offset!");

}

