#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModActor

#include "Basic.hpp"

#include "VoidMod_CustomEvent_structs.hpp"
#include "VoidMod_CustomActor_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ModActor.ModActor_C.InitializeMod
// 0x0020 (0x0020 - 0x0000)
struct ModActor_C_InitializeMod final
{
public:
	TArray<struct FVoidMod_CustomEvent>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<struct FVoidMod_CustomActor>           K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(ModActor_C_InitializeMod) == 0x000008, "Wrong alignment on ModActor_C_InitializeMod");
static_assert(sizeof(ModActor_C_InitializeMod) == 0x000020, "Wrong size on ModActor_C_InitializeMod");
static_assert(offsetof(ModActor_C_InitializeMod, K2Node_MakeArray_Array) == 0x000000, "Member 'ModActor_C_InitializeMod::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ModActor_C_InitializeMod, K2Node_MakeArray_Array_1) == 0x000010, "Member 'ModActor_C_InitializeMod::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function ModActor.ModActor_C.TerminalHandler
// 0x0020 (0x0020 - 0x0000)
struct ModActor_C_TerminalHandler final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Params_0;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ModActor_C_TerminalHandler) == 0x000008, "Wrong alignment on ModActor_C_TerminalHandler");
static_assert(sizeof(ModActor_C_TerminalHandler) == 0x000020, "Wrong size on ModActor_C_TerminalHandler");
static_assert(offsetof(ModActor_C_TerminalHandler, Command) == 0x000000, "Member 'ModActor_C_TerminalHandler::Command' has a wrong offset!");
static_assert(offsetof(ModActor_C_TerminalHandler, Params_0) == 0x000010, "Member 'ModActor_C_TerminalHandler::Params_0' has a wrong offset!");

// Function ModActor.ModActor_C.ExecuteUbergraph_ModActor
// 0x0140 (0x0140 - 0x0000)
struct ModActor_C_ExecuteUbergraph_ModActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AProp_gatowell_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Command, const class FString& Params)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Command;                        // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Params;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetHelpCommandOutput_HelpCommandOutput;   // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_VoidModVersion_NewParam;                  // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendMultiple_ReturnValue;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AVoidModInstance_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendMultiple_ReturnValue_1;             // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Array_Random_OutItem;                     // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_gatowell_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModActor_C_ExecuteUbergraph_ModActor) == 0x000010, "Wrong alignment on ModActor_C_ExecuteUbergraph_ModActor");
static_assert(sizeof(ModActor_C_ExecuteUbergraph_ModActor) == 0x000140, "Wrong size on ModActor_C_ExecuteUbergraph_ModActor");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, EntryPoint) == 0x000000, "Member 'ModActor_C_ExecuteUbergraph_ModActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'ModActor_C_ExecuteUbergraph_ModActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_GetVoidmodInstance_Instance) == 0x000030, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, K2Node_CustomEvent_Command) == 0x000038, "Member 'ModActor_C_ExecuteUbergraph_ModActor::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, K2Node_CustomEvent_Params) == 0x000048, "Member 'ModActor_C_ExecuteUbergraph_ModActor::K2Node_CustomEvent_Params' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000059, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00005A, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_GetHelpCommandOutput_HelpCommandOutput) == 0x000060, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_GetHelpCommandOutput_HelpCommandOutput' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_VoidModVersion_NewParam) == 0x0000A0, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_VoidModVersion_NewParam' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_AppendMultiple_ReturnValue) == 0x0000B8, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_AppendMultiple_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C8, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_AppendMultiple_ReturnValue_1) == 0x0000D0, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_AppendMultiple_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, K2Node_MakeArray_Array) == 0x0000E0, "Member 'ModActor_C_ExecuteUbergraph_ModActor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_Array_Random_OutItem) == 0x0000F0, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_Array_Random_OutIndex) == 0x0000FC, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_MakeTransform_ReturnValue_1) == 0x000100, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000130, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModActor_C_ExecuteUbergraph_ModActor, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000138, "Member 'ModActor_C_ExecuteUbergraph_ModActor::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

}

