#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modlist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass modlist.modlist_C
// 0x0038 (0x0298 - 0x0260)
class UModlist_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundBlock;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseMenu;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__modlist_CloseMenu_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_modlist(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"modlist_C">();
	}
	static class UModlist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModlist_C>();
	}
};
static_assert(alignof(UModlist_C) == 0x000008, "Wrong alignment on UModlist_C");
static_assert(sizeof(UModlist_C) == 0x000298, "Wrong size on UModlist_C");
static_assert(offsetof(UModlist_C, UberGraphFrame) == 0x000260, "Member 'UModlist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UModlist_C, BackgroundBlock) == 0x000268, "Member 'UModlist_C::BackgroundBlock' has a wrong offset!");
static_assert(offsetof(UModlist_C, CloseMenu) == 0x000270, "Member 'UModlist_C::CloseMenu' has a wrong offset!");
static_assert(offsetof(UModlist_C, Image) == 0x000278, "Member 'UModlist_C::Image' has a wrong offset!");
static_assert(offsetof(UModlist_C, Image_1) == 0x000280, "Member 'UModlist_C::Image_1' has a wrong offset!");
static_assert(offsetof(UModlist_C, Image_2) == 0x000288, "Member 'UModlist_C::Image_2' has a wrong offset!");
static_assert(offsetof(UModlist_C, ScrollBox) == 0x000290, "Member 'UModlist_C::ScrollBox' has a wrong offset!");

}

