#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modlist_item

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass modlist_item.modlist_item_C
// 0x0038 (0x0298 - 0x0260)
class UModlist_item_C final : public UUserWidget
{
public:
	class UCanvasPanel*                           CanvasPanel_314;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_293;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModDescription;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ModIcon;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModID;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Modthi;                                            // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ToolTipReference;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"modlist_item_C">();
	}
	static class UModlist_item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModlist_item_C>();
	}
};
static_assert(alignof(UModlist_item_C) == 0x000008, "Wrong alignment on UModlist_item_C");
static_assert(sizeof(UModlist_item_C) == 0x000298, "Wrong size on UModlist_item_C");
static_assert(offsetof(UModlist_item_C, CanvasPanel_314) == 0x000260, "Member 'UModlist_item_C::CanvasPanel_314' has a wrong offset!");
static_assert(offsetof(UModlist_item_C, Image_293) == 0x000268, "Member 'UModlist_item_C::Image_293' has a wrong offset!");
static_assert(offsetof(UModlist_item_C, ModDescription) == 0x000270, "Member 'UModlist_item_C::ModDescription' has a wrong offset!");
static_assert(offsetof(UModlist_item_C, ModIcon) == 0x000278, "Member 'UModlist_item_C::ModIcon' has a wrong offset!");
static_assert(offsetof(UModlist_item_C, ModID) == 0x000280, "Member 'UModlist_item_C::ModID' has a wrong offset!");
static_assert(offsetof(UModlist_item_C, Modthi) == 0x000288, "Member 'UModlist_item_C::Modthi' has a wrong offset!");
static_assert(offsetof(UModlist_item_C, ToolTipReference) == 0x000290, "Member 'UModlist_item_C::ToolTipReference' has a wrong offset!");

}

