#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint14

#include "Basic.hpp"

#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint14.NewBlueprint14_C.ExecuteUbergraph_NewBlueprint14
// 0x04C0 (0x04C0 - 0x0000)
struct NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x006C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_10;       // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_Constant_ReturnValue;           // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_Constant_ReturnValue_1;         // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0300(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_3;     // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_11;       // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class NewBlueprint5_0::ANewBlueprint5_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_Base64ToBytes_ReturnValue;                // 0x0408(0x0010)(ReferenceParm)
	TArray<uint8>                                 CallFunc_Base64ToBytes_ReturnValue_1;              // 0x0418(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetCurrentUsername_ReturnValue;           // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_DecryptAes_ReturnValue;                   // 0x0438(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BytesToStringUtf8_ReturnValue;            // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveStringToFile_ReturnValue;             // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14) == 0x000010, "Wrong alignment on NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14");
static_assert(sizeof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14) == 0x0004C0, "Wrong size on NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, EntryPoint) == 0x000000, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Vector_Distance_ReturnValue) == 0x00002C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Less_FloatFloat_ReturnValue) == 0x000030, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000034, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000040, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x00004C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000050, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000068, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00006C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000F4, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0000F5, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000F8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x0000FC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000184, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000188, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000190, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x00019C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0001A8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_FindLookAtRotation_ReturnValue) == 0x0001AC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BreakRotator_Roll) == 0x0001B8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BreakRotator_Pitch) == 0x0001BC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BreakRotator_Yaw) == 0x0001C0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_IsGamePaused_ReturnValue) == 0x0001C4, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_IsGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001C8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_MakeRotator_ReturnValue) == 0x0001CC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0001D8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0001DC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x0001E8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0001F0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x0001FC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetPlayerPawn_ReturnValue) == 0x000208, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000210, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x00021C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_8) == 0x000228, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000234, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000240, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BreakRotator_Roll_1) == 0x000244, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BreakRotator_Pitch_1) == 0x000248, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BreakRotator_Yaw_1) == 0x00024C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000250, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000254, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_MakeRotator_ReturnValue_1) == 0x000258, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, K2Node_SwitchEnum_CmpSuccess) == 0x000264, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000268, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_9) == 0x000270, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000280, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000288, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_10) == 0x00028C, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x000298, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_SelectVector_ReturnValue) == 0x0002A4, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_VSize_ReturnValue) == 0x0002B0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002B4, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0002B8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0002BC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0002C0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_VInterpTo_Constant_ReturnValue) == 0x0002C4, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_VInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_VInterpTo_Constant_ReturnValue_1) == 0x0002D0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_VInterpTo_Constant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002DC, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0002E8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Add_VectorVector_ReturnValue) == 0x0002F4, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000300, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000388, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_getSaveSlot_saveSlot) == 0x000390, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_RandomBoolWithWeight_ReturnValue_1) == 0x000398, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_RandomBoolWithWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000399, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetPlayerCameraManager_ReturnValue_3) == 0x0003A0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetPlayerCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_K2_GetActorLocation_ReturnValue_11) == 0x0003A8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_K2_GetActorLocation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Subtract_VectorVector_ReturnValue_3) == 0x0003B4, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Subtract_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_MakeTransform_ReturnValue) == 0x0003C0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003F0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_getMainSave_save_main) == 0x0003F8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_FinishSpawningActor_ReturnValue) == 0x000400, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Base64ToBytes_ReturnValue) == 0x000408, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Base64ToBytes_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Base64ToBytes_ReturnValue_1) == 0x000418, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Base64ToBytes_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_GetCurrentUsername_ReturnValue) == 0x000428, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_GetCurrentUsername_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_DecryptAes_ReturnValue) == 0x000438, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_DecryptAes_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Concat_StrStr_ReturnValue) == 0x000448, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_BytesToStringUtf8_ReturnValue) == 0x000458, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_BytesToStringUtf8_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000468, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, K2Node_Event_DeltaSeconds) == 0x000478, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000480, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000490, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_SaveStringToFile_ReturnValue) == 0x0004A0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_SaveStringToFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_IsValid_ReturnValue_1) == 0x0004A1, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0004A8, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14, CallFunc_IsValid_ReturnValue_2) == 0x0004B0, "Member 'NewBlueprint14_C_ExecuteUbergraph_NewBlueprint14::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function NewBlueprint14.NewBlueprint14_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NewBlueprint14_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint14_C_ReceiveTick) == 0x000004, "Wrong alignment on NewBlueprint14_C_ReceiveTick");
static_assert(sizeof(NewBlueprint14_C_ReceiveTick) == 0x000004, "Wrong size on NewBlueprint14_C_ReceiveTick");
static_assert(offsetof(NewBlueprint14_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'NewBlueprint14_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function NewBlueprint14.NewBlueprint14_C.UserConstructionScript
// 0x0200 (0x0200 - 0x0000)
struct NewBlueprint14_C_UserConstructionScript final
{
public:
	TArray<class FString>                         Oneu;                                              // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Onen;                                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Onet;                                              // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Onev;                                              // 0x0030(0x0010)(Edit, BlueprintVisible)
	class FString                                 Suv;                                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Sns;                                               // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Sts;                                               // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Svs;                                               // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_Base64UrlToBytes_ReturnValue;             // 0x00A0(0x0010)(ReferenceParm)
	TArray<uint8>                                 CallFunc_Base64UrlToBytes_ReturnValue_1;           // 0x00B0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_Base64UrlToBytes_ReturnValue_2;           // 0x00C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_StringToVector2D_OutConvertedVector2D; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_StringToVector2D_OutIsValid;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_Base64UrlToBytes_ReturnValue_3;           // 0x00F8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_StringToVector_OutConvertedVector;   // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_StringToVector_OutIsValid;           // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_StringToVector_OutConvertedVector_1; // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_StringToVector_OutIsValid_1;         // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULowEntryByteDataReader*                CallFunc_ByteDataReader_Create_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULowEntryByteDataReader*                CallFunc_ByteDataReader_Create_ReturnValue_1;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetStringUtf8Array_ReturnValue;           // 0x01B0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetStringUtf8Array_ReturnValue_1;         // 0x01C0(0x0010)(ReferenceParm)
	class ULowEntryByteDataReader*                CallFunc_ByteDataReader_Create_ReturnValue_2;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULowEntryByteDataReader*                CallFunc_ByteDataReader_Create_ReturnValue_3;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetStringUtf8Array_ReturnValue_2;         // 0x01E0(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetStringUtf8Array_ReturnValue_3;         // 0x01F0(0x0010)(ReferenceParm)
};
static_assert(alignof(NewBlueprint14_C_UserConstructionScript) == 0x000008, "Wrong alignment on NewBlueprint14_C_UserConstructionScript");
static_assert(sizeof(NewBlueprint14_C_UserConstructionScript) == 0x000200, "Wrong size on NewBlueprint14_C_UserConstructionScript");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Oneu) == 0x000000, "Member 'NewBlueprint14_C_UserConstructionScript::Oneu' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Onen) == 0x000010, "Member 'NewBlueprint14_C_UserConstructionScript::Onen' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Onet) == 0x000020, "Member 'NewBlueprint14_C_UserConstructionScript::Onet' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Onev) == 0x000030, "Member 'NewBlueprint14_C_UserConstructionScript::Onev' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Suv) == 0x000040, "Member 'NewBlueprint14_C_UserConstructionScript::Suv' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Sns) == 0x000050, "Member 'NewBlueprint14_C_UserConstructionScript::Sns' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Sts) == 0x000060, "Member 'NewBlueprint14_C_UserConstructionScript::Sts' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Svs) == 0x000070, "Member 'NewBlueprint14_C_UserConstructionScript::Svs' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x000084, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'NewBlueprint14_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_2) == 0x00008C, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_3) == 0x000098, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Base64UrlToBytes_ReturnValue) == 0x0000A0, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Base64UrlToBytes_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Base64UrlToBytes_ReturnValue_1) == 0x0000B0, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Base64UrlToBytes_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'NewBlueprint14_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Base64UrlToBytes_ReturnValue_2) == 0x0000C8, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Base64UrlToBytes_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Conv_StringToVector2D_OutConvertedVector2D) == 0x0000E8, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Conv_StringToVector2D_OutConvertedVector2D' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Conv_StringToVector2D_OutIsValid) == 0x0000F0, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Conv_StringToVector2D_OutIsValid' has a wrong offset!");
static_assert(offsetof(NewBlueprint14_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x0000F4, "Member 'NewBlueprint14_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
