#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Obelisk

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function obelisk.obelisk_C.ExecuteUbergraph_obelisk
// 0x08B0 (0x08B0 - 0x0000)
struct Obelisk_C_ExecuteUbergraph_obelisk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0110(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0xC];                                      // 0x0204(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_obelisk_C*                        CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0250(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x02D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0360(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x03D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x045C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x04E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x04E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E6[0x2];                                      // 0x04E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0558(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0564(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0590(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x05C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0648(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0660(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_2;           // 0x066C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x0678(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0684(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0690(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_dynPhys_obj;                          // 0x06A0(0x0010)(ReferenceParm)
	class FName                                   Temp_name_Variable;                                // 0x06B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_2;                // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x06DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isFunny_isFunny;                          // 0x06F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F5[0x3];                                      // 0x06F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x06F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0782(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_783[0x1];                                      // 0x0783(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x078C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0798(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x07A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x07B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x07D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x07E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x07EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x07F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsProp_Trampoline;         // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_819[0x3];                                      // 0x0819(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x081C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0828(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x0834(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0840(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x084C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_858[0x8];                                      // 0x0858(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0860(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_obelisk_C*                        CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        CallFunc_setPropProps_self_CastInput;              // 0x08A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Obelisk_C_ExecuteUbergraph_obelisk) == 0x000010, "Wrong alignment on Obelisk_C_ExecuteUbergraph_obelisk");
static_assert(sizeof(Obelisk_C_ExecuteUbergraph_obelisk) == 0x0008B0, "Wrong size on Obelisk_C_ExecuteUbergraph_obelisk");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, EntryPoint) == 0x000000, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::EntryPoint' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_object_Variable) == 0x000008, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_object_Variable_1) == 0x000018, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomUnitVector_ReturnValue) == 0x000028, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000034, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000040, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomUnitVector_ReturnValue_1) == 0x00004C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue) == 0x000064, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000068, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeVector_ReturnValue) == 0x00006C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000078, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000084, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000090, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000094, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000098, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeVector_ReturnValue_1) == 0x00009C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000F0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OtherActor) == 0x0000F8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OtherComp) == 0x000100, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000108, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_bFromSweep) == 0x00010C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_SweepResult) == 0x000110, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_VLerp_ReturnValue) == 0x000198, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001A4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001B0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_getMainPlayer_AsMain_Player) == 0x0001C0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001C8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001D4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001E0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_SetVectorLength_ReturnValue) == 0x0001EC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_int_Variable) == 0x0001F8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001FC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_IntInt_ReturnValue) == 0x000200, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000210, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000240, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000248, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000250, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0002D8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_obj_static_obj) == 0x000360, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_GetUpVector_ReturnValue) == 0x000370, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00037C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000388, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000394, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0003A0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakRotator_Roll) == 0x0003AC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakRotator_Pitch) == 0x0003B0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakRotator_Yaw) == 0x0003B4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0003B8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeRotator_ReturnValue) == 0x0003C4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0003D0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000458, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00045C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_bBlockingHit) == 0x0004E4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_bInitialOverlap) == 0x0004E5, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Time) == 0x0004E8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Distance) == 0x0004EC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Location) == 0x0004F0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_ImpactPoint) == 0x0004FC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Normal) == 0x000508, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_ImpactNormal) == 0x000514, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_PhysMat) == 0x000520, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitActor) == 0x000528, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitComponent) == 0x000530, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitBoneName) == 0x000538, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitItem) == 0x000540, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_ElementIndex) == 0x000544, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_FaceIndex) == 0x000548, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_TraceStart) == 0x00054C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_TraceEnd) == 0x000558, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Cross_VectorVector_ReturnValue) == 0x000564, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000570, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x00057C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000590, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x0005C0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakTransform_Location) == 0x000648, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakTransform_Rotation) == 0x000654, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakTransform_Scale) == 0x000660, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomUnitVector_ReturnValue_2) == 0x00066C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomUnitVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_GetUpVector_ReturnValue_1) == 0x000678, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000684, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000690, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_obj_dynPhys_obj) == 0x0006A0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_obj_dynPhys_obj' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_name_Variable) == 0x0006B0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_GetUpVector_ReturnValue_2) == 0x0006B8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_GetUpVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x0006C4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0006D0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0006DC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0006E8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_isFunny_isFunny) == 0x0006F4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_isFunny_isFunny' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x0006F8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x000780, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000781, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000782, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Time_1) == 0x000784, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Distance_1) == 0x000788, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Location_1) == 0x00078C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000798, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_Normal_1) == 0x0007A4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0007B0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_PhysMat_1) == 0x0007C0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitActor_1) == 0x0007C8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitComponent_1) == 0x0007D0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitBoneName_1) == 0x0007D8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_HitItem_1) == 0x0007E0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_ElementIndex_1) == 0x0007E4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_FaceIndex_1) == 0x0007E8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_TraceStart_1) == 0x0007EC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakHitResult_TraceEnd_1) == 0x0007F8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_GetObjectClass_ReturnValue) == 0x000808, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ClassDynamicCast_AsProp_Trampoline) == 0x000810, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ClassDynamicCast_AsProp_Trampoline' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ClassDynamicCast_bSuccess) == 0x000818, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_GetActorUpVector_ReturnValue) == 0x00081C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000828, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x000834, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000840, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue_6) == 0x00084C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeTransform_ReturnValue_1) == 0x000860, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000890, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000898, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_setPropProps_self_CastInput) == 0x0008A0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_setPropProps_self_CastInput' has a wrong offset!");

// Function obelisk.obelisk_C.BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function obelisk.obelisk_C.UserConstructionScript
// 0x00AC (0x00AC - 0x0000)
struct Obelisk_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Obelisk_C_UserConstructionScript) == 0x000004, "Wrong alignment on Obelisk_C_UserConstructionScript");
static_assert(sizeof(Obelisk_C_UserConstructionScript) == 0x0000AC, "Wrong size on Obelisk_C_UserConstructionScript");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'Obelisk_C_UserConstructionScript::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x00000C, "Member 'Obelisk_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x000010, "Member 'Obelisk_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000014, "Member 'Obelisk_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'Obelisk_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000024, "Member 'Obelisk_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function obelisk.obelisk_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Obelisk_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
