#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Optionsmenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function optionsmenu.optionsmenu_C.ExecuteUbergraph_optionsmenu
// 0x00C8 (0x00C8 - 0x0000)
struct Optionsmenu_C_ExecuteUbergraph_optionsmenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsmenu_mod_C*                     K2Node_DynamicCast_AsOptionsmenu_Mod;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionsmenu_option_bool_C*             K2Node_DynamicCast_AsOptionsmenu_Option_Bool;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UOptionsmenu_option_C*                  K2Node_DynamicCast_AsOptionsmenu_Option;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Optionsmenu_C_ExecuteUbergraph_optionsmenu) == 0x000008, "Wrong alignment on Optionsmenu_C_ExecuteUbergraph_optionsmenu");
static_assert(sizeof(Optionsmenu_C_ExecuteUbergraph_optionsmenu) == 0x0000C8, "Wrong size on Optionsmenu_C_ExecuteUbergraph_optionsmenu");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, EntryPoint) == 0x000000, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Array_Get_Item) == 0x000030, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, K2Node_DynamicCast_AsOptionsmenu_Mod) == 0x000038, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::K2Node_DynamicCast_AsOptionsmenu_Mod' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_GetAllChildren_ReturnValue_1) == 0x000050, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, K2Node_DynamicCast_AsOptionsmenu_Option_Bool) == 0x000070, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::K2Node_DynamicCast_AsOptionsmenu_Option_Bool' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x000079, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_IsChecked_ReturnValue) == 0x00007A, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00007C, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Conv_IntToString_ReturnValue) == 0x000080, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, K2Node_DynamicCast_AsOptionsmenu_Option) == 0x000090, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::K2Node_DynamicCast_AsOptionsmenu_Option' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_GetText_ReturnValue) == 0x0000A0, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Optionsmenu_C_ExecuteUbergraph_optionsmenu, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'Optionsmenu_C_ExecuteUbergraph_optionsmenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

