#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Optionsmenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass optionsmenu.optionsmenu_C
// 0x0028 (0x0288 - 0x0260)
class UOptionsmenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ApplySettings;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundBlock;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseMenu;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             OptionsModList;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__optionsmenu_CloseMenu_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__optionsmenu_ApplySettings_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_optionsmenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"optionsmenu_C">();
	}
	static class UOptionsmenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsmenu_C>();
	}
};
static_assert(alignof(UOptionsmenu_C) == 0x000008, "Wrong alignment on UOptionsmenu_C");
static_assert(sizeof(UOptionsmenu_C) == 0x000288, "Wrong size on UOptionsmenu_C");
static_assert(offsetof(UOptionsmenu_C, UberGraphFrame) == 0x000260, "Member 'UOptionsmenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsmenu_C, ApplySettings) == 0x000268, "Member 'UOptionsmenu_C::ApplySettings' has a wrong offset!");
static_assert(offsetof(UOptionsmenu_C, BackgroundBlock) == 0x000270, "Member 'UOptionsmenu_C::BackgroundBlock' has a wrong offset!");
static_assert(offsetof(UOptionsmenu_C, CloseMenu) == 0x000278, "Member 'UOptionsmenu_C::CloseMenu' has a wrong offset!");
static_assert(offsetof(UOptionsmenu_C, OptionsModList) == 0x000280, "Member 'UOptionsmenu_C::OptionsModList' has a wrong offset!");

}

