#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerRagdoll

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function playerRagdoll.playerRagdoll_C.ExecuteUbergraph_playerRagdoll
// 0x0720 (0x0720 - 0x0000)
struct PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_component;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_2;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_2;                             // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0178(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x020C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x02A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0388(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x03B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0440(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0480(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICppInterface>         K2Node_DynamicCast_AsCpp_Interface;                // 0x0550(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICppInterface>         K2Node_DynamicCast_AsCpp_Interface_1;              // 0x0568(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_leaveWaterOrigin_self_CastInput;          // 0x0580(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_objects_C>        CallFunc_leaveWater_self_CastInput;                // 0x0590(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_objects_C>        CallFunc_enterWaterOrigin_self_CastInput;          // 0x05A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_objects_C>        CallFunc_enterWater_self_CastInput;                // 0x05B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_damage;                               // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x05C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0658(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0665(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666[0x2];                                      // 0x0666(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0670(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x067C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0694(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x06D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x06E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E5[0x3];                                      // 0x06E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x06F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0700(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll) == 0x000008, "Wrong alignment on PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll");
static_assert(sizeof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll) == 0x000720, "Wrong size on PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, EntryPoint) == 0x000000, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_component) == 0x000008, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_damage_6) == 0x000010, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hit_6) == 0x000014, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_actor_2) == 0x0000A0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_actor_2' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_impact_2) == 0x0000A8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_impact_2' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_activate) == 0x0000B4, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_static) == 0x0000B5, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_frozen) == 0x0000B6, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_active) == 0x0000B7, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_actor_1) == 0x0000B8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_damage_5) == 0x0000C0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hit_5) == 0x0000C4, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_impact_1) == 0x00014C, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_skipSetting) == 0x000158, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_key_1) == 0x000160, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_12) == 0x000170, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hit_4) == 0x000178, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_damage_4) == 0x000200, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_fuel) == 0x000204, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_damage_3) == 0x000208, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hot) == 0x00020C, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_11) == 0x000298, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hit_3) == 0x0002A0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_action) == 0x000328, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_10) == 0x000330, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_9) == 0x000338, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_damage_2) == 0x000340, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_location_1) == 0x000344, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_8) == 0x000350, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_7) == 0x000358, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_6) == 0x000360, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_wheelDelta) == 0x000368, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_5) == 0x000370, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_mouse) == 0x000378, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_4) == 0x000380, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_key) == 0x000388, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_pressed) == 0x0003A0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_temperature_1) == 0x0003A4, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_temperature) == 0x0003A8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_speed) == 0x0003AC, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_3) == 0x0003B0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hit_2) == 0x0003B8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_name) == 0x000440, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_volume) == 0x000450, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_2) == 0x000458, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_location) == 0x000460, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_damage_1) == 0x00046C, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_clean_1) == 0x000470, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player_1) == 0x000478, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hit_1) == 0x000480, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hook_1) == 0x000508, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_clean) == 0x000510, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_player) == 0x000518, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hook) == 0x000520, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_water_3) == 0x000528, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_water_2) == 0x000530, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_water_1) == 0x000538, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_water) == 0x000540, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_getMainPlayer_AsMain_Player) == 0x000548, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_DynamicCast_AsCpp_Interface) == 0x000550, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_DynamicCast_AsCpp_Interface' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_DynamicCast_bSuccess) == 0x000560, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_DynamicCast_AsCpp_Interface_1) == 0x000568, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_DynamicCast_AsCpp_Interface_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_DynamicCast_bSuccess_1) == 0x000578, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_leaveWaterOrigin_self_CastInput) == 0x000580, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_leaveWaterOrigin_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_leaveWater_self_CastInput) == 0x000590, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_leaveWater_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_enterWaterOrigin_self_CastInput) == 0x0005A0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_enterWaterOrigin_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_enterWater_self_CastInput) == 0x0005B0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_enterWater_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_damage) == 0x0005C0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_hit) == 0x0005C4, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_actor) == 0x000650, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, K2Node_Event_impact) == 0x000658, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_bBlockingHit) == 0x000664, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_bInitialOverlap) == 0x000665, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_Time) == 0x000668, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_Distance) == 0x00066C, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_Location) == 0x000670, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_ImpactPoint) == 0x00067C, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_Normal) == 0x000688, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_ImpactNormal) == 0x000694, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_PhysMat) == 0x0006A0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_HitActor) == 0x0006A8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_HitComponent) == 0x0006B0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_HitBoneName) == 0x0006B8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_HitItem) == 0x0006C0, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_ElementIndex) == 0x0006C4, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_FaceIndex) == 0x0006C8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_TraceStart) == 0x0006CC, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_BreakHitResult_TraceEnd) == 0x0006D8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0006E4, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_FindClosestBone_K2_BoneLocation) == 0x0006E8, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_FindClosestBone_K2_ReturnValue) == 0x0006F4, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_Conv_NameToString_ReturnValue) == 0x000700, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000710, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000718, "Member 'PlayerRagdoll_C_ExecuteUbergraph_playerRagdoll::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.impactDamageCPP
// 0x00A8 (0x00A8 - 0x0000)
struct PlayerRagdoll_C_ImpactDamageCPP final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_ImpactDamageCPP) == 0x000008, "Wrong alignment on PlayerRagdoll_C_ImpactDamageCPP");
static_assert(sizeof(PlayerRagdoll_C_ImpactDamageCPP) == 0x0000A8, "Wrong size on PlayerRagdoll_C_ImpactDamageCPP");
static_assert(offsetof(PlayerRagdoll_C_ImpactDamageCPP, Damage) == 0x000000, "Member 'PlayerRagdoll_C_ImpactDamageCPP::Damage' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ImpactDamageCPP, Hit) == 0x000004, "Member 'PlayerRagdoll_C_ImpactDamageCPP::Hit' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ImpactDamageCPP, Actor) == 0x000090, "Member 'PlayerRagdoll_C_ImpactDamageCPP::Actor' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ImpactDamageCPP, Impact) == 0x000098, "Member 'PlayerRagdoll_C_ImpactDamageCPP::Impact' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on PlayerRagdoll_C_LeaveWaterOrigin");
static_assert(sizeof(PlayerRagdoll_C_LeaveWaterOrigin) == 0x000008, "Wrong size on PlayerRagdoll_C_LeaveWaterOrigin");
static_assert(offsetof(PlayerRagdoll_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'PlayerRagdoll_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_LeaveWater) == 0x000008, "Wrong alignment on PlayerRagdoll_C_LeaveWater");
static_assert(sizeof(PlayerRagdoll_C_LeaveWater) == 0x000008, "Wrong size on PlayerRagdoll_C_LeaveWater");
static_assert(offsetof(PlayerRagdoll_C_LeaveWater, Water) == 0x000000, "Member 'PlayerRagdoll_C_LeaveWater::Water' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on PlayerRagdoll_C_EnterWaterOrigin");
static_assert(sizeof(PlayerRagdoll_C_EnterWaterOrigin) == 0x000008, "Wrong size on PlayerRagdoll_C_EnterWaterOrigin");
static_assert(offsetof(PlayerRagdoll_C_EnterWaterOrigin, Water) == 0x000000, "Member 'PlayerRagdoll_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_EnterWater) == 0x000008, "Wrong alignment on PlayerRagdoll_C_EnterWater");
static_assert(sizeof(PlayerRagdoll_C_EnterWater) == 0x000008, "Wrong size on PlayerRagdoll_C_EnterWater");
static_assert(offsetof(PlayerRagdoll_C_EnterWater, Water) == 0x000000, "Member 'PlayerRagdoll_C_EnterWater::Water' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_HookTension) == 0x000008, "Wrong alignment on PlayerRagdoll_C_HookTension");
static_assert(sizeof(PlayerRagdoll_C_HookTension) == 0x000008, "Wrong size on PlayerRagdoll_C_HookTension");
static_assert(offsetof(PlayerRagdoll_C_HookTension, Hook) == 0x000000, "Member 'PlayerRagdoll_C_HookTension::Hook' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct PlayerRagdoll_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player_0;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_CleanSponge) == 0x000008, "Wrong alignment on PlayerRagdoll_C_CleanSponge");
static_assert(sizeof(PlayerRagdoll_C_CleanSponge) == 0x000010, "Wrong size on PlayerRagdoll_C_CleanSponge");
static_assert(offsetof(PlayerRagdoll_C_CleanSponge, Clean) == 0x000000, "Member 'PlayerRagdoll_C_CleanSponge::Clean' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_CleanSponge, Player_0) == 0x000008, "Member 'PlayerRagdoll_C_CleanSponge::Player_0' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_Hooked) == 0x000008, "Wrong alignment on PlayerRagdoll_C_Hooked");
static_assert(sizeof(PlayerRagdoll_C_Hooked) == 0x000008, "Wrong size on PlayerRagdoll_C_Hooked");
static_assert(offsetof(PlayerRagdoll_C_Hooked, Hook) == 0x000000, "Member 'PlayerRagdoll_C_Hooked::Hook' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct PlayerRagdoll_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PlayerRagdoll_C_PlayerUsedOn) == 0x000008, "Wrong alignment on PlayerRagdoll_C_PlayerUsedOn");
static_assert(sizeof(PlayerRagdoll_C_PlayerUsedOn) == 0x000090, "Wrong size on PlayerRagdoll_C_PlayerUsedOn");
static_assert(offsetof(PlayerRagdoll_C_PlayerUsedOn, Player_0) == 0x000000, "Member 'PlayerRagdoll_C_PlayerUsedOn::Player_0' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_PlayerUsedOn, Hit) == 0x000008, "Member 'PlayerRagdoll_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.slice
// 0x0001 (0x0001 - 0x0000)
struct PlayerRagdoll_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerRagdoll_C_Slice) == 0x000001, "Wrong alignment on PlayerRagdoll_C_Slice");
static_assert(sizeof(PlayerRagdoll_C_Slice) == 0x000001, "Wrong size on PlayerRagdoll_C_Slice");
static_assert(offsetof(PlayerRagdoll_C_Slice, Clean) == 0x000000, "Member 'PlayerRagdoll_C_Slice::Clean' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct PlayerRagdoll_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_ReachedByExplosion) == 0x000004, "Wrong alignment on PlayerRagdoll_C_ReachedByExplosion");
static_assert(sizeof(PlayerRagdoll_C_ReachedByExplosion) == 0x000010, "Wrong size on PlayerRagdoll_C_ReachedByExplosion");
static_assert(offsetof(PlayerRagdoll_C_ReachedByExplosion, Location) == 0x000000, "Member 'PlayerRagdoll_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'PlayerRagdoll_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_PlayerLookAway) == 0x000008, "Wrong alignment on PlayerRagdoll_C_PlayerLookAway");
static_assert(sizeof(PlayerRagdoll_C_PlayerLookAway) == 0x000008, "Wrong size on PlayerRagdoll_C_PlayerLookAway");
static_assert(offsetof(PlayerRagdoll_C_PlayerLookAway, Player_0) == 0x000000, "Member 'PlayerRagdoll_C_PlayerLookAway::Player_0' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct PlayerRagdoll_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_Stepped) == 0x000004, "Wrong alignment on PlayerRagdoll_C_Stepped");
static_assert(sizeof(PlayerRagdoll_C_Stepped) == 0x000004, "Wrong size on PlayerRagdoll_C_Stepped");
static_assert(offsetof(PlayerRagdoll_C_Stepped, Volume) == 0x000000, "Member 'PlayerRagdoll_C_Stepped::Volume' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct PlayerRagdoll_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Name_0;                                            // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_ActionName) == 0x000008, "Wrong alignment on PlayerRagdoll_C_ActionName");
static_assert(sizeof(PlayerRagdoll_C_ActionName) == 0x0000A0, "Wrong size on PlayerRagdoll_C_ActionName");
static_assert(offsetof(PlayerRagdoll_C_ActionName, Player_0) == 0x000000, "Member 'PlayerRagdoll_C_ActionName::Player_0' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ActionName, Hit) == 0x000008, "Member 'PlayerRagdoll_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_ActionName, Name_0) == 0x000090, "Member 'PlayerRagdoll_C_ActionName::Name_0' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct PlayerRagdoll_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_AccumulateTemperature) == 0x000004, "Wrong alignment on PlayerRagdoll_C_AccumulateTemperature");
static_assert(sizeof(PlayerRagdoll_C_AccumulateTemperature) == 0x000008, "Wrong size on PlayerRagdoll_C_AccumulateTemperature");
static_assert(offsetof(PlayerRagdoll_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'PlayerRagdoll_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_AccumulateTemperature, Speed) == 0x000004, "Member 'PlayerRagdoll_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct PlayerRagdoll_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_AddTemperature) == 0x000004, "Wrong alignment on PlayerRagdoll_C_AddTemperature");
static_assert(sizeof(PlayerRagdoll_C_AddTemperature) == 0x000004, "Wrong size on PlayerRagdoll_C_AddTemperature");
static_assert(offsetof(PlayerRagdoll_C_AddTemperature, Temperature) == 0x000000, "Member 'PlayerRagdoll_C_AddTemperature::Temperature' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct PlayerRagdoll_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerRagdoll_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on PlayerRagdoll_C_PlayerHandAnyKey");
static_assert(sizeof(PlayerRagdoll_C_PlayerHandAnyKey) == 0x000028, "Wrong size on PlayerRagdoll_C_PlayerHandAnyKey");
static_assert(offsetof(PlayerRagdoll_C_PlayerHandAnyKey, Player_0) == 0x000000, "Member 'PlayerRagdoll_C_PlayerHandAnyKey::Player_0' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'PlayerRagdoll_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'PlayerRagdoll_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct PlayerRagdoll_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_PlayerHandMouse) == 0x000008, "Wrong alignment on PlayerRagdoll_C_PlayerHandMouse");
static_assert(sizeof(PlayerRagdoll_C_PlayerHandMouse) == 0x000010, "Wrong size on PlayerRagdoll_C_PlayerHandMouse");
static_assert(offsetof(PlayerRagdoll_C_PlayerHandMouse, Player_0) == 0x000000, "Member 'PlayerRagdoll_C_PlayerHandMouse::Player_0' has a wrong offset!");
static_assert(offsetof(PlayerRagdoll_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'PlayerRagdoll_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function playerRagdoll.playerRagdoll_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct PlayerRagdoll_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRagdoll_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on PlayerRagdoll_C_PlayerHandMouseWheel");
