#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrintedObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_customMesh_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "Struct_dangerProp_structs.hpp"
#include "Struct_multisectionCustomMesh_structs.hpp"
#include "Struct_mVector_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function printedObject.printedObject_C.ExecuteUbergraph_printedObject
// 0x0868 (0x0868 - 0x0000)
struct PrintedObject_C_ExecuteUbergraph_printedObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name_1;                               // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_6;                             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0170(0x0100)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0270(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x028C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x02B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x037B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0398(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x042C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0510(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0540(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x05E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0608(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_getKey_key;                               // 0x06B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor;                                // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x06D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x075C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_769[0x3];                                      // 0x0769(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x076C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        CallFunc_impactDamage_self_CastInput;              // 0x0778(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791[0x3];                                      // 0x0791(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x079C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x07A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4[0x4];                                      // 0x07B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C9[0x3];                                      // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x07D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0862(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_863[0x1];                                      // 0x0863(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0864(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ExecuteUbergraph_printedObject) == 0x000008, "Wrong alignment on PrintedObject_C_ExecuteUbergraph_printedObject");
static_assert(sizeof(PrintedObject_C_ExecuteUbergraph_printedObject) == 0x000868, "Wrong size on PrintedObject_C_ExecuteUbergraph_printedObject");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, EntryPoint) == 0x000000, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, Temp_int_Variable) == 0x000004, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, Temp_int_Variable_1) == 0x000008, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_18) == 0x000010, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_7) == 0x000018, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_kick) == 0x0000A0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_name_1) == 0x0000A4, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_17) == 0x0000B0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_16) == 0x0000B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_6) == 0x0000C0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_6) == 0x000148, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_15) == 0x000150, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_14) == 0x000158, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_13) == 0x000160, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_gamemode) == 0x000168, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_settings) == 0x000170, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_key_2) == 0x000270, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_pressed_1) == 0x000288, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_color) == 0x00028C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_picker) == 0x0002A0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_texture) == 0x0002A8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_index) == 0x0002B0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_5) == 0x0002B4, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_5) == 0x0002B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_actor_1) == 0x000340, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_impact_1) == 0x000348, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water_3) == 0x000358, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water_2) == 0x000360, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water_1) == 0x000368, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water) == 0x000370, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_activate) == 0x000378, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_static) == 0x000379, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_frozen) == 0x00037A, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_active) == 0x00037B, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_key_1) == 0x000380, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_12) == 0x000390, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_4) == 0x000398, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_4) == 0x000420, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_fuel) == 0x000424, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_3) == 0x000428, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hot) == 0x00042C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_11) == 0x0004B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_10) == 0x0004C0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_2) == 0x0004C8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_location_1) == 0x0004CC, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_9) == 0x0004D8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_8) == 0x0004E0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_7) == 0x0004E8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_wheelDelta) == 0x0004F0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_6) == 0x0004F8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_mouse) == 0x000500, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_5) == 0x000508, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_key) == 0x000510, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_pressed) == 0x000528, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_temperature_1) == 0x00052C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_temperature) == 0x000530, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_speed) == 0x000534, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_4) == 0x000538, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_3) == 0x000540, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_name) == 0x0005C8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_volume) == 0x0005D8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_3) == 0x0005E0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_location) == 0x0005E8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_1) == 0x0005F4, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_clean_1) == 0x0005F8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_2) == 0x000600, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_2) == 0x000608, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hook_1) == 0x000690, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_clean) == 0x000698, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_1) == 0x0006A0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hook) == 0x0006A8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_ignore) == 0x0006B0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_getKey_key) == 0x0006B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_actor) == 0x0006C8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage) == 0x0006D0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_1) == 0x0006D4, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_impact) == 0x00075C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_skipSetting) == 0x000768, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Divide_VectorFloat_ReturnValue) == 0x00076C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_impactDamage_self_CastInput) == 0x000778, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_impactDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000788, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_IsValid_ReturnValue) == 0x000790, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Array_Add_ReturnValue) == 0x000794, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Array_RemoveItem_ReturnValue) == 0x000798, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_RandomUnitVector_ReturnValue) == 0x00079C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0007A8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_getMainSave_save_main) == 0x0007B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_getMainPlayer_AsMain_Player) == 0x0007C0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_addFood_full) == 0x0007C8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Add_IntInt_ReturnValue) == 0x0007CC, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player) == 0x0007D0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit) == 0x0007D8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_action) == 0x000860, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000861, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_SwitchEnum_CmpSuccess) == 0x000862, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Subtract_IntInt_ReturnValue) == 0x000864, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function printedObject.printedObject_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct PrintedObject_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ActionOptionIndex) == 0x000008, "Wrong alignment on PrintedObject_C_ActionOptionIndex");
static_assert(sizeof(PrintedObject_C_ActionOptionIndex) == 0x000098, "Wrong size on PrintedObject_C_ActionOptionIndex");
static_assert(offsetof(PrintedObject_C_ActionOptionIndex, Player) == 0x000000, "Member 'PrintedObject_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionOptionIndex, Hit) == 0x000008, "Member 'PrintedObject_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionOptionIndex, Action) == 0x000090, "Member 'PrintedObject_C_ActionOptionIndex::Action' has a wrong offset!");

// Function printedObject.printedObject_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct PrintedObject_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_AddDamage) == 0x000008, "Wrong alignment on PrintedObject_C_AddDamage");
static_assert(sizeof(PrintedObject_C_AddDamage) == 0x0000A8, "Wrong size on PrintedObject_C_AddDamage");
static_assert(offsetof(PrintedObject_C_AddDamage, Actor) == 0x000000, "Member 'PrintedObject_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, Damage) == 0x000008, "Member 'PrintedObject_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, Hit) == 0x00000C, "Member 'PrintedObject_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, Impact) == 0x000094, "Member 'PrintedObject_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'PrintedObject_C_AddDamage::SkipSetting' has a wrong offset!");

// Function printedObject.printedObject_C.setIgnoreSave
// 0x0001 (0x0001 - 0x0000)
struct PrintedObject_C_SetIgnoreSave final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_SetIgnoreSave) == 0x000001, "Wrong alignment on PrintedObject_C_SetIgnoreSave");
static_assert(sizeof(PrintedObject_C_SetIgnoreSave) == 0x000001, "Wrong size on PrintedObject_C_SetIgnoreSave");
static_assert(offsetof(PrintedObject_C_SetIgnoreSave, Ignore) == 0x000000, "Member 'PrintedObject_C_SetIgnoreSave::Ignore' has a wrong offset!");

// Function printedObject.printedObject_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_HookTension) == 0x000008, "Wrong alignment on PrintedObject_C_HookTension");
static_assert(sizeof(PrintedObject_C_HookTension) == 0x000008, "Wrong size on PrintedObject_C_HookTension");
static_assert(offsetof(PrintedObject_C_HookTension, Hook) == 0x000000, "Member 'PrintedObject_C_HookTension::Hook' has a wrong offset!");

// Function printedObject.printedObject_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_CleanSponge) == 0x000008, "Wrong alignment on PrintedObject_C_CleanSponge");
static_assert(sizeof(PrintedObject_C_CleanSponge) == 0x000010, "Wrong size on PrintedObject_C_CleanSponge");
static_assert(offsetof(PrintedObject_C_CleanSponge, Clean) == 0x000000, "Member 'PrintedObject_C_CleanSponge::Clean' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_CleanSponge, Player) == 0x000008, "Member 'PrintedObject_C_CleanSponge::Player' has a wrong offset!");

// Function printedObject.printedObject_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_Hooked) == 0x000008, "Wrong alignment on PrintedObject_C_Hooked");
static_assert(sizeof(PrintedObject_C_Hooked) == 0x000008, "Wrong size on PrintedObject_C_Hooked");
static_assert(offsetof(PrintedObject_C_Hooked, Hook) == 0x000000, "Member 'PrintedObject_C_Hooked::Hook' has a wrong offset!");

// Function printedObject.printedObject_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct PrintedObject_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PrintedObject_C_PlayerUsedOn) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerUsedOn");
static_assert(sizeof(PrintedObject_C_PlayerUsedOn) == 0x000090, "Wrong size on PrintedObject_C_PlayerUsedOn");
static_assert(offsetof(PrintedObject_C_PlayerUsedOn, Player) == 0x000000, "Member 'PrintedObject_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerUsedOn, Hit) == 0x000008, "Member 'PrintedObject_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function printedObject.printedObject_C.slice
// 0x0001 (0x0001 - 0x0000)
struct PrintedObject_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_Slice) == 0x000001, "Wrong alignment on PrintedObject_C_Slice");
static_assert(sizeof(PrintedObject_C_Slice) == 0x000001, "Wrong size on PrintedObject_C_Slice");
static_assert(offsetof(PrintedObject_C_Slice, Clean) == 0x000000, "Member 'PrintedObject_C_Slice::Clean' has a wrong offset!");

// Function printedObject.printedObject_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ReachedByExplosion) == 0x000004, "Wrong alignment on PrintedObject_C_ReachedByExplosion");
static_assert(sizeof(PrintedObject_C_ReachedByExplosion) == 0x000010, "Wrong size on PrintedObject_C_ReachedByExplosion");
static_assert(offsetof(PrintedObject_C_ReachedByExplosion, Location) == 0x000000, "Member 'PrintedObject_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'PrintedObject_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function printedObject.printedObject_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerLookAway) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerLookAway");
static_assert(sizeof(PrintedObject_C_PlayerLookAway) == 0x000008, "Wrong size on PrintedObject_C_PlayerLookAway");
static_assert(offsetof(PrintedObject_C_PlayerLookAway, Player) == 0x000000, "Member 'PrintedObject_C_PlayerLookAway::Player' has a wrong offset!");

// Function printedObject.printedObject_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct PrintedObject_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_Stepped) == 0x000004, "Wrong alignment on PrintedObject_C_Stepped");
static_assert(sizeof(PrintedObject_C_Stepped) == 0x000004, "Wrong size on PrintedObject_C_Stepped");
static_assert(offsetof(PrintedObject_C_Stepped, Volume) == 0x000000, "Member 'PrintedObject_C_Stepped::Volume' has a wrong offset!");

// Function printedObject.printedObject_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct PrintedObject_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Name_0;                                            // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ActionName) == 0x000008, "Wrong alignment on PrintedObject_C_ActionName");
static_assert(sizeof(PrintedObject_C_ActionName) == 0x0000A0, "Wrong size on PrintedObject_C_ActionName");
static_assert(offsetof(PrintedObject_C_ActionName, Player) == 0x000000, "Member 'PrintedObject_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionName, Hit) == 0x000008, "Member 'PrintedObject_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionName, Name_0) == 0x000090, "Member 'PrintedObject_C_ActionName::Name_0' has a wrong offset!");

// Function printedObject.printedObject_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_AccumulateTemperature) == 0x000004, "Wrong alignment on PrintedObject_C_AccumulateTemperature");
static_assert(sizeof(PrintedObject_C_AccumulateTemperature) == 0x000008, "Wrong size on PrintedObject_C_AccumulateTemperature");
static_assert(offsetof(PrintedObject_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'PrintedObject_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AccumulateTemperature, Speed) == 0x000004, "Member 'PrintedObject_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function printedObject.printedObject_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct PrintedObject_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_AddTemperature) == 0x000004, "Wrong alignment on PrintedObject_C_AddTemperature");
static_assert(sizeof(PrintedObject_C_AddTemperature) == 0x000004, "Wrong size on PrintedObject_C_AddTemperature");
static_assert(offsetof(PrintedObject_C_AddTemperature, Temperature) == 0x000000, "Member 'PrintedObject_C_AddTemperature::Temperature' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct PrintedObject_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key_0;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandAnyKey");
static_assert(sizeof(PrintedObject_C_PlayerHandAnyKey) == 0x000028, "Wrong size on PrintedObject_C_PlayerHandAnyKey");
static_assert(offsetof(PrintedObject_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerHandAnyKey, Key_0) == 0x000008, "Member 'PrintedObject_C_PlayerHandAnyKey::Key_0' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'PrintedObject_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerHandMouse) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandMouse");
static_assert(sizeof(PrintedObject_C_PlayerHandMouse) == 0x000010, "Wrong size on PrintedObject_C_PlayerHandMouse");
static_assert(offsetof(PrintedObject_C_PlayerHandMouse, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'PrintedObject_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
