#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrintedObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Struct_multisectionCustomMesh_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass printedObject.printedObject_C
// 0x0188 (0x03A8 - 0x0220)
class APrintedObject_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_physicsImpact_C*                  PhysicsImpact;                                     // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProceduralMeshComponent*               ProceduralMesh;                                    // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Key;                                               // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsValidModel;                                      // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_multisectionCustomMesh         MultisectionData;                                  // 0x0270(0x0118)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Loaded;                                            // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   LightComponent;                                    // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        GameMode;                                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         bites;                                             // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Edible;                                            // 0x03A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_printedObject(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, Enum_interactionActions Action);
	void AddDamage(class AActor* Actor, float Damage, const struct FHitResult& Hit, const struct FVector& Impact, bool SkipSetting);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void SetIgnoreSave(bool Ignore);
	void HookTension(class AHook_C* Hook);
	void CleanSponge(float Clean, class AMainPlayer_C* Player);
	void Crafted();
	void Hooked(class AHook_C* Hook);
	void AttemptIgnite();
	void PlayerUsedOn(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void Slice(bool Clean);
	void bitten();
	void ReachedByExplosion(const struct FVector& Location, float Damage);
	void PlayerLookAway(class AMainPlayer_C* Player);
	void Stepped(float Volume);
	void ActionName(class AMainPlayer_C* Player, const struct FHitResult& Hit, const class FString& Name_0);
	void AccumulateTemperature(float Temperature, float Speed);
	void AddTemperature(float Temperature);
	void MicrowaveElec();
	void PlayerHandAnyKey(class AMainPlayer_C* Player, const struct FKey& Key_0, bool Pressed);
	void PlayerHandMouse(class AMainPlayer_C* Player, const struct FVector2D& Mouse);
	void PlayerHandMouseWheel(class AMainPlayer_C* Player, float WheelDelta);
	void PlayerHandRelease_LMB(class AMainPlayer_C* Player);
	void PlayerHandRelease_RMB(class AMainPlayer_C* Player);
	void ExtinguishFire();
	void Exploded(float Damage, const struct FVector& Location);
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void ReceivedPhyiscsDamage(float Damage, const struct FHitResult& Hot);
	void Microwave();
	void Ignite(float Fuel);
	void FireDamage(float Damage);
	void SteppedOn(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void Unhook();
	void DigUp();
	void PhysPreDestroyed();
	void PhysDestroyed();
	void SetKey(const class FString& Key_0);
	void SetPropProps(bool Static, bool Frozen, bool Active);
	void Virus(bool Activate);
	void Eaten();
	void LeaveWaterOrigin(class AWaterVolume_C* Water);
	void EnterWaterOrigin(class AWaterVolume_C* Water);
	void LeaveWater(class AWaterVolume_C* Water);
	void EnterWater(class AWaterVolume_C* Water);
	void ImpactDamage(float Damage, const struct FHitResult& Hit, class AActor* Actor, const struct FVector& Impact);
	void GamemodePostKeys();
	void NewFunction_3();
	void NewFunction_2();
	void TexturePickerApply(class UUmg_texturePicker_C* Picker, class UTexture2D* Texture, int32 Index_0);
	void ApplyColor(const struct FLinearColor& Color);
	void PropRenderer_finishProps();
	void GamemodeMakeKeys();
	void AnyKey(const struct FKey& Key_0, bool Pressed);
	void GamemodePreLoad();
	void Unfocused();
	void SettingsApplied(const struct FStruct_settings& Settings);
	void Unfoc();
	void StuffUpgraded(class AMainGamemode_C* GameMode_0);
	void GamemodeBeginPlay();
	void SignalSaved();
	void SignalDeleted();
	void PlayerR(class AMainPlayer_C* Player);
	void PlayerHold(class AMainPlayer_C* Player);
	void PlayerUnequip(class AMainPlayer_C* Player);
	void UpdateStrAgl();
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Hit, float Damage);
	void Thrown(class AMainPlayer_C* Player);
	void broken_fire();
	void broken();
	void SendName(class FName Name_0);
	void Kicked(bool Kick);
	void Player_use(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void DriveDetached();
	void UserConstructionScript();
	void LoadFromPrinter(const struct FStruct_multisectionCustomMesh& MultisectionMesh);
	void Load(bool ConfigInfo);
	void SetProps();
	void IgnoreSave(bool* IgnoreSave_0);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void SkipPreDelete(bool* Skip);
	void GatherDataFromKey(bool* Gather);
	void SetPath(const TArray<struct FVector>& Path, bool* Return);
	void GetOnlyKey(class FString* Key_0);
	void ProcessKeys(bool* Return);
	void CanBeUsedHold(bool* Return);
	void GetKey(class FString* Key_0);
	void ToolboxFix(class AProp_toolbox_C* Toolbox, bool* Return);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);
	void GascanFuel(class AProp_gascan_C* Gascan, bool* Fueled);
	void SkipRadial(bool* Skip);
	void GetPriceMultiplier(float* PriceMult);
	void DreamInv(TArray<struct FStruct_save>& Invv, class ADreamBase_C** Base);
	void LandedOn(class AMainPlayer_C* Player, bool* IgnoreFallDamage);
	void CanBePutInContainer(bool* Return);
	void AsProp(class AProp_C** Return);
	void CanPickup(bool* Return);
	void NoRespawn(bool NoRespawn_0, bool* Return);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void IsButtonUsed(bool* Failed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"printedObject_C">();
	}
	static class APrintedObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrintedObject_C>();
	}
};
static_assert(alignof(APrintedObject_C) == 0x000008, "Wrong alignment on APrintedObject_C");
static_assert(sizeof(APrintedObject_C) == 0x0003A8, "Wrong size on APrintedObject_C");
static_assert(offsetof(APrintedObject_C, UberGraphFrame) == 0x000220, "Member 'APrintedObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, StaticMesh) == 0x000228, "Member 'APrintedObject_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, PhysicsImpact) == 0x000230, "Member 'APrintedObject_C::PhysicsImpact' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, ProceduralMesh) == 0x000238, "Member 'APrintedObject_C::ProceduralMesh' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, Name_0) == 0x000240, "Member 'APrintedObject_C::Name_0' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, Dynmat) == 0x000250, "Member 'APrintedObject_C::Dynmat' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, Key) == 0x000258, "Member 'APrintedObject_C::Key' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, IsValidModel) == 0x000268, "Member 'APrintedObject_C::IsValidModel' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, MultisectionData) == 0x000270, "Member 'APrintedObject_C::MultisectionData' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, Loaded) == 0x000388, "Member 'APrintedObject_C::Loaded' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, LightComponent) == 0x000390, "Member 'APrintedObject_C::LightComponent' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, GameMode) == 0x000398, "Member 'APrintedObject_C::GameMode' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, bites) == 0x0003A0, "Member 'APrintedObject_C::bites' has a wrong offset!");
static_assert(offsetof(APrintedObject_C, Edible) == 0x0003A4, "Member 'APrintedObject_C::Edible' has a wrong offset!");

}

