#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_safe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_safe.prop_safe_C
// 0x0048 (0x03A0 - 0x0358)
class AProp_safe_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_safe_C;                        // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          SpawnBox;                                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Door;                                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Objects;                                           // 0x0378(0x0010)(Edit, BlueprintVisible)
	class FString                                 Password;                                          // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Locked;                                            // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void GetData(struct FStruct_save* Data);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void Opened();
	void UpdLock();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_prop_safe(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_safe_C">();
	}
	static class AProp_safe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_safe_C>();
	}
};
static_assert(alignof(AProp_safe_C) == 0x000008, "Wrong alignment on AProp_safe_C");
static_assert(sizeof(AProp_safe_C) == 0x0003A0, "Wrong size on AProp_safe_C");
static_assert(offsetof(AProp_safe_C, UberGraphFrame_Prop_safe_C) == 0x000358, "Member 'AProp_safe_C::UberGraphFrame_Prop_safe_C' has a wrong offset!");
static_assert(offsetof(AProp_safe_C, SpawnBox) == 0x000360, "Member 'AProp_safe_C::SpawnBox' has a wrong offset!");
static_assert(offsetof(AProp_safe_C, Door) == 0x000368, "Member 'AProp_safe_C::Door' has a wrong offset!");
static_assert(offsetof(AProp_safe_C, PhysicsConstraint) == 0x000370, "Member 'AProp_safe_C::PhysicsConstraint' has a wrong offset!");
static_assert(offsetof(AProp_safe_C, Objects) == 0x000378, "Member 'AProp_safe_C::Objects' has a wrong offset!");
static_assert(offsetof(AProp_safe_C, Password) == 0x000388, "Member 'AProp_safe_C::Password' has a wrong offset!");
static_assert(offsetof(AProp_safe_C, Locked) == 0x000398, "Member 'AProp_safe_C::Locked' has a wrong offset!");

}

