#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_waterCan

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_waterCan.prop_waterCan_C.ExecuteUbergraph_prop_waterCan
// 0x0208 (0x0208 - 0x0000)
struct Prop_waterCan_C_ExecuteUbergraph_prop_waterCan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_start;                                // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_arm_rotation;                             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrowingPlant_C*                        K2Node_DynamicCast_AsGrowing_Plant;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_DynamicCast_AsWater_Volume;                 // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan) == 0x000008, "Wrong alignment on Prop_waterCan_C_ExecuteUbergraph_prop_waterCan");
static_assert(sizeof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan) == 0x000208, "Wrong size on Prop_waterCan_C_ExecuteUbergraph_prop_waterCan");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, EntryPoint) == 0x000000, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_MakeArray_Array) == 0x000008, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_Event_player_1) == 0x000018, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, Temp_int_Variable) == 0x000020, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, Temp_object_Variable) == 0x000068, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_MakeArray_Array_1) == 0x000078, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_Format_ReturnValue) == 0x000088, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A0, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_Event_player) == 0x0000A8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_arm_start) == 0x0000B0, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_arm_end) == 0x0000BC, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_arm_rotation) == 0x0000C8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_arm_rotation' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D4, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000D8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000160, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_bBlockingHit) == 0x000161, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_bInitialOverlap) == 0x000162, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_Location) == 0x00016C, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_Normal) == 0x000184, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_PhysMat) == 0x0001A0, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_HitActor) == 0x0001A8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_HitComponent) == 0x0001B0, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_HitBoneName) == 0x0001B8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_HitItem) == 0x0001C0, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_ElementIndex) == 0x0001C4, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_FaceIndex) == 0x0001C8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_TraceStart) == 0x0001CC, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_DynamicCast_AsGrowing_Plant) == 0x0001E8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_DynamicCast_AsGrowing_Plant' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_DynamicCast_AsWater_Volume) == 0x0001F8, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_DynamicCast_AsWater_Volume' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_ExecuteUbergraph_prop_waterCan, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'Prop_waterCan_C_ExecuteUbergraph_prop_waterCan::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function prop_waterCan.prop_waterCan_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_waterCan_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_waterCan_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_waterCan_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_waterCan_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_waterCan_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_waterCan_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_waterCan_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function prop_waterCan.prop_waterCan_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_waterCan_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_waterCan_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_waterCan_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_waterCan_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_waterCan_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_waterCan_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_waterCan_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_waterCan.prop_waterCan_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_waterCan_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_waterCan_C_LoadData) == 0x000010, "Wrong alignment on Prop_waterCan_C_LoadData");
static_assert(sizeof(Prop_waterCan_C_LoadData) == 0x0000E0, "Wrong size on Prop_waterCan_C_LoadData");
static_assert(offsetof(Prop_waterCan_C_LoadData, Data) == 0x000000, "Member 'Prop_waterCan_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_LoadData, Return) == 0x0000C0, "Member 'Prop_waterCan_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_waterCan_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_waterCan_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_waterCan_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_waterCan.prop_waterCan_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_waterCan_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_waterCan_C_GetData) == 0x000010, "Wrong alignment on Prop_waterCan_C_GetData");
static_assert(sizeof(Prop_waterCan_C_GetData) == 0x000270, "Wrong size on Prop_waterCan_C_GetData");
static_assert(offsetof(Prop_waterCan_C_GetData, Data) == 0x000000, "Member 'Prop_waterCan_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_waterCan_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_waterCan_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_waterCan_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_waterCan_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_waterCan_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_waterCan_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

