#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_gstMaker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_gstMaker.prop_gstMaker_C
// 0x0030 (0x0388 - 0x0358)
class AProp_gstMaker_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_gstMaker_C;                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Ghost;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          Player;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor_a;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0378(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fix_A;                                             // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_gstMaker(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void PlayerHandRelease_RMB(class AMainPlayer_C* Player_0);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_gstMaker_C">();
	}
	static class AProp_gstMaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_gstMaker_C>();
	}
};
static_assert(alignof(AProp_gstMaker_C) == 0x000008, "Wrong alignment on AProp_gstMaker_C");
static_assert(sizeof(AProp_gstMaker_C) == 0x000388, "Wrong size on AProp_gstMaker_C");
static_assert(offsetof(AProp_gstMaker_C, UberGraphFrame_Prop_gstMaker_C) == 0x000358, "Member 'AProp_gstMaker_C::UberGraphFrame_Prop_gstMaker_C' has a wrong offset!");
static_assert(offsetof(AProp_gstMaker_C, Ghost) == 0x000360, "Member 'AProp_gstMaker_C::Ghost' has a wrong offset!");
static_assert(offsetof(AProp_gstMaker_C, Player) == 0x000368, "Member 'AProp_gstMaker_C::Player' has a wrong offset!");
static_assert(offsetof(AProp_gstMaker_C, HitActor_a) == 0x000370, "Member 'AProp_gstMaker_C::HitActor_a' has a wrong offset!");
static_assert(offsetof(AProp_gstMaker_C, Loc) == 0x000378, "Member 'AProp_gstMaker_C::Loc' has a wrong offset!");
static_assert(offsetof(AProp_gstMaker_C, Fix_A) == 0x000384, "Member 'AProp_gstMaker_C::Fix_A' has a wrong offset!");

}

