#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_pumpkinpie

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_prop3_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_food_structs.hpp"


namespace SDK::Params
{

// Function prop_pumpkinpie.prop_pumpkinpie_C.ExecuteUbergraph_prop_pumpkinpie
// 0x03D0 (0x03D0 - 0x0000)
struct Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x0030(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x0060(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00EC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00FC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue_1;               // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData_1;                  // 0x0108(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object_1;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard_1;             // 0x0138(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x01BC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x01C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x01E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0280(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_collectObject_collected;                  // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x2];                                      // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_9;                               // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0330(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_6;           // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_1;                 // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return_1;                          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie) == 0x000010, "Wrong alignment on Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie");
static_assert(sizeof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie) == 0x0003D0, "Wrong size on Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, EntryPoint) == 0x000000, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable) == 0x000004, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_1) == 0x000008, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_2) == 0x000014, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000018, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_3) == 0x000020, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000024, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_ReturnValue) == 0x00002C, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_foodData) == 0x000030, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_object) == 0x000050, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_isFood) == 0x000058, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_fuckYouRetard) == 0x000060, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_IsValidClass_ReturnValue) == 0x0000E0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_4) == 0x0000E4, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_5) == 0x0000E8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_name_Variable) == 0x0000EC, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000F4, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_name_Variable_1) == 0x0000FC, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_ReturnValue_1) == 0x000104, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_foodData_1) == 0x000108, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_foodData_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_object_1) == 0x000128, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_object_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_isFood_1) == 0x000130, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_isFood_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_propToObject_fuckYouRetard_1) == 0x000138, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_propToObject_fuckYouRetard_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_IsValidClass_ReturnValue_1) == 0x0001B8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_name_Variable_2) == 0x0001BC, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_6) == 0x0001C4, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_name_Variable_3) == 0x0001C8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_7) == 0x0001D0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_8) == 0x0001D4, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x0001D8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001DC, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_Event_player) == 0x0001E0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_Event_hit) == 0x0001E8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_Event_action) == 0x000270, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_GetTransform_ReturnValue) == 0x000280, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002B0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0002B8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002C0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_DynamicCast_AsInt_Player) == 0x0002C8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_DynamicCast_bSuccess) == 0x0002D8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0002E0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_asProp_return) == 0x0002E8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0002F0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0002F8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_Select_Default) == 0x000300, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Conv_NameToString_ReturnValue) == 0x000308, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_collectObject_collected) == 0x000318, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_collectObject_collected' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_SwitchEnum_CmpSuccess) == 0x000319, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, Temp_int_Variable_9) == 0x00031C, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x000320, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Add_IntInt_ReturnValue_5) == 0x000324, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Subtract_IntInt_ReturnValue) == 0x000328, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_GetTransform_ReturnValue_1) == 0x000330, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_LessEqual_IntInt_ReturnValue_6) == 0x000360, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_LessEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000368, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000370, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x000378, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_DynamicCast_AsInt_Player_1) == 0x000380, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_DynamicCast_AsInt_Player_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, K2Node_DynamicCast_bSuccess_1) == 0x000390, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_asProp_return_1) == 0x000398, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_asProp_return_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x0003A0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0003A8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5) == 0x0003B8, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie, CallFunc_FinishSpawningActor_ReturnValue_5) == 0x0003C0, "Member 'Prop_pumpkinpie_C_ExecuteUbergraph_prop_pumpkinpie::CallFunc_FinishSpawningActor_ReturnValue_5' has a wrong offset!");

// Function prop_pumpkinpie.prop_pumpkinpie_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_pumpkinpie_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_pumpkinpie_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_pumpkinpie_C_ActionOptionIndex");
static_assert(sizeof(Prop_pumpkinpie_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_pumpkinpie_C_ActionOptionIndex");
static_assert(offsetof(Prop_pumpkinpie_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_pumpkinpie_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ActionOptionIndex, Hit_0) == 0x000008, "Member 'Prop_pumpkinpie_C_ActionOptionIndex::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_pumpkinpie_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_pumpkinpie.prop_pumpkinpie_C.upd
// 0x0040 (0x0040 - 0x0000)
struct Prop_pumpkinpie_C_Upd final
{
public:
	TArray<class UStaticMeshComponent*>           Ms;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Prop_pumpkinpie_C_Upd) == 0x000008, "Wrong alignment on Prop_pumpkinpie_C_Upd");
static_assert(sizeof(Prop_pumpkinpie_C_Upd) == 0x000040, "Wrong size on Prop_pumpkinpie_C_Upd");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, Ms) == 0x000000, "Member 'Prop_pumpkinpie_C_Upd::Ms' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, Temp_int_Variable) == 0x000010, "Member 'Prop_pumpkinpie_C_Upd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'Prop_pumpkinpie_C_Upd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Prop_pumpkinpie_C_Upd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, CallFunc_Array_LastIndex_ReturnValue) == 0x00001C, "Member 'Prop_pumpkinpie_C_Upd::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'Prop_pumpkinpie_C_Upd::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, CallFunc_Array_Get_Item) == 0x000028, "Member 'Prop_pumpkinpie_C_Upd::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_Upd, K2Node_MakeArray_Array) == 0x000030, "Member 'Prop_pumpkinpie_C_Upd::K2Node_MakeArray_Array' has a wrong offset!");

// Function prop_pumpkinpie.prop_pumpkinpie_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_pumpkinpie_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_pumpkinpie_C_LoadData) == 0x000010, "Wrong alignment on Prop_pumpkinpie_C_LoadData");
static_assert(sizeof(Prop_pumpkinpie_C_LoadData) == 0x0000E0, "Wrong size on Prop_pumpkinpie_C_LoadData");
static_assert(offsetof(Prop_pumpkinpie_C_LoadData, Data) == 0x000000, "Member 'Prop_pumpkinpie_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LoadData, Return) == 0x0000C0, "Member 'Prop_pumpkinpie_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_pumpkinpie_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_pumpkinpie_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_pumpkinpie_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_pumpkinpie.prop_pumpkinpie_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_pumpkinpie_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_pumpkinpie_C_GetData) == 0x000010, "Wrong alignment on Prop_pumpkinpie_C_GetData");
static_assert(sizeof(Prop_pumpkinpie_C_GetData) == 0x000270, "Wrong size on Prop_pumpkinpie_C_GetData");
static_assert(offsetof(Prop_pumpkinpie_C_GetData, Data) == 0x000000, "Member 'Prop_pumpkinpie_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_pumpkinpie_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_pumpkinpie_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_pumpkinpie_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_pumpkinpie_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_pumpkinpie_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_pumpkinpie.prop_pumpkinpie_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_pumpkinpie_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_pumpkinpie_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_pumpkinpie_C_GetActionOptions");
static_assert(sizeof(Prop_pumpkinpie_C_GetActionOptions) == 0x000060, "Wrong size on Prop_pumpkinpie_C_GetActionOptions");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_pumpkinpie_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_pumpkinpie_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_pumpkinpie_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_pumpkinpie_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_pumpkinpie_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_pumpkinpie_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_pumpkinpie_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_pumpkinpie_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function prop_pumpkinpie.prop_pumpkinpie_C.lookAt
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_pumpkinpie_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_pumpkinpie_C_LookAt) == 0x000008, "Wrong alignment on Prop_pumpkinpie_C_LookAt");
static_assert(sizeof(Prop_pumpkinpie_C_LookAt) == 0x0000E0, "Wrong size on Prop_pumpkinpie_C_LookAt");
static_assert(offsetof(Prop_pumpkinpie_C_LookAt, Player) == 0x000000, "Member 'Prop_pumpkinpie_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LookAt, Hit_0) == 0x000008, "Member 'Prop_pumpkinpie_C_LookAt::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LookAt, Return) == 0x000090, "Member 'Prop_pumpkinpie_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LookAt, Text) == 0x000098, "Member 'Prop_pumpkinpie_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_pumpkinpie_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_pumpkinpie_C_LookAt::boundObjectReplace' has a wrong offset!");
