#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_bloodGib

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_food_structs.hpp"
#include "Struct_prop3_structs.hpp"


namespace SDK::Params
{

// Function prop_bloodGib.prop_bloodGib_C.ExecuteUbergraph_prop_bloodGib
// 0x0330 (0x0330 - 0x0000)
struct Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_meshConvexVolume2_volume;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x0024(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x0050(0x0080)(HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0114(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable_3;                               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0254(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           K2Node_MakeStruct_struct_food;                     // 0x0270(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0290(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib) == 0x000010, "Wrong alignment on Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib");
static_assert(sizeof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib) == 0x000330, "Wrong size on Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, EntryPoint) == 0x000000, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_meshConvexVolume2_volume) == 0x000004, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_meshConvexVolume2_volume' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, Temp_int_Variable) == 0x000008, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_propToObject_ReturnValue) == 0x000020, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_propToObject_foodData) == 0x000024, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_propToObject_object) == 0x000040, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_propToObject_isFood) == 0x000048, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_propToObject_fuckYouRetard) == 0x000050, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, Temp_name_Variable) == 0x0000D0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_IsValidClass_ReturnValue) == 0x0000D8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, Temp_int_Variable_1) == 0x0000DC, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, Temp_int_Variable_2) == 0x0000E0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000E4, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_ComponentBoundEvent_HitComponent) == 0x0000F0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_ComponentBoundEvent_OtherActor) == 0x0000F8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_ComponentBoundEvent_OtherComp) == 0x000100, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000108, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_ComponentBoundEvent_Hit) == 0x000114, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, Temp_int_Variable_3) == 0x00019C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_bBlockingHit) == 0x0001A0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001A1, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_Time) == 0x0001A4, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_Distance) == 0x0001A8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_Location) == 0x0001AC, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_Normal) == 0x0001C4, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_ImpactNormal) == 0x0001D0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_PhysMat) == 0x0001E0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_HitActor) == 0x0001E8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_HitComponent) == 0x0001F0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_HitBoneName) == 0x0001F8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_HitItem) == 0x000200, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_ElementIndex) == 0x000204, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_FaceIndex) == 0x000208, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_TraceStart) == 0x00020C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BreakHitResult_TraceEnd) == 0x000218, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000224, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000230, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Add_VectorVector_ReturnValue) == 0x000234, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000240, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Add_IntInt_ReturnValue_2) == 0x000248, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_VSize_ReturnValue) == 0x00024C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000250, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, Temp_name_Variable_1) == 0x000254, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00025C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_RandomFloatInRange_ReturnValue) == 0x000260, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000264, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000268, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_Event_clean) == 0x00026C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_MakeStruct_struct_food) == 0x000270, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_MakeStruct_struct_food' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, Temp_int_Variable_4) == 0x00028C, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_GetTransform_ReturnValue) == 0x000290, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002C0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0002C8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002D0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_DynamicCast_AsInt_Player) == 0x0002D8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, K2Node_DynamicCast_bSuccess) == 0x0002E8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0002F0, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_asProp_return) == 0x0002F8, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000300, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000308, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Conv_NameToString_ReturnValue) == 0x000310, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000320, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib, CallFunc_Add_IntInt_ReturnValue_3) == 0x000324, "Member 'Prop_bloodGib_C_ExecuteUbergraph_prop_bloodGib::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function prop_bloodGib.prop_bloodGib_C.BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit_0) == 0x000024, "Member 'Prop_bloodGib_C_BndEvt__prop_bloodGib_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit_0' has a wrong offset!");

// Function prop_bloodGib.prop_bloodGib_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Prop_bloodGib_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_bloodGib_C_Slice) == 0x000001, "Wrong alignment on Prop_bloodGib_C_Slice");
static_assert(sizeof(Prop_bloodGib_C_Slice) == 0x000001, "Wrong size on Prop_bloodGib_C_Slice");
static_assert(offsetof(Prop_bloodGib_C_Slice, Clean) == 0x000000, "Member 'Prop_bloodGib_C_Slice::Clean' has a wrong offset!");

}

