#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_bucket

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"


namespace SDK::Params
{

// Function prop_bucket.prop_bucket_C.ExecuteUbergraph_prop_bucket
// 0x05F0 (0x05F0 - 0x0000)
struct Prop_bucket_C_ExecuteUbergraph_prop_bucket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue_1;        // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0190(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0xC];                                      // 0x0294(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_sponge_bucketPour_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FB[0x1];                                      // 0x03FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41A[0x2];                                      // 0x041A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrowingPlant_C*                        K2Node_DynamicCast_AsGrowing_Plant;                // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item;                           // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x04E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0572(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573[0x1];                                      // 0x0573(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_sleepy_ReturnValue;                       // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isFunny_isFunny;                          // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x05A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_poo_Child_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_ExecuteUbergraph_prop_bucket) == 0x000010, "Wrong alignment on Prop_bucket_C_ExecuteUbergraph_prop_bucket");
static_assert(sizeof(Prop_bucket_C_ExecuteUbergraph_prop_bucket) == 0x0005F0, "Wrong size on Prop_bucket_C_ExecuteUbergraph_prop_bucket");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, EntryPoint) == 0x000000, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000004, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeStruct_FormatArgumentData_1) == 0x000048, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeArray_Array) == 0x000088, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Format_ReturnValue) == 0x000098, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000C4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X) == 0x00014C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y) == 0x000150, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z) == 0x000154, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetActorUpVector_ReturnValue) == 0x000158, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Dot_VectorVector_ReturnValue) == 0x000164, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000168, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_IsSimulatingPhysics_ReturnValue_1) == 0x000169, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_IsSimulatingPhysics_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000170, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000178, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000180, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000188, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_bFromSweep) == 0x00018C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_SweepResult) == 0x000190, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_AsInt_Objects) == 0x000218, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RandomFloatInRange_ReturnValue) == 0x00022C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000230, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000234, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_MakeVector_ReturnValue) == 0x000238, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000248, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherActor) == 0x000250, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherComp) == 0x000258, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000260, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000268, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000270, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00027C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000288, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_MakeTransform_ReturnValue) == 0x0002A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002D8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_1) == 0x0002E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_1) == 0x0002E4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_1) == 0x0002E8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002EC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_2) == 0x0002F8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_2) == 0x0002FC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_2) == 0x000300, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_3) == 0x000304, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_3) == 0x000308, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_3) == 0x00030C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000310, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000314, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetVelocity_ReturnValue) == 0x000318, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000324, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000328, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RandomUnitVector_ReturnValue) == 0x000334, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000340, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_VectorVector_ReturnValue) == 0x00034C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000358, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetActorUpVector_ReturnValue_1) == 0x00035C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000368, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00036C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_4) == 0x000378, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_4) == 0x00037C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_4) == 0x000380, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000384, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000390, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000394, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_FloatFloat_ReturnValue) == 0x000398, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x00039C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetTransform_ReturnValue) == 0x0003A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Abs_ReturnValue) == 0x0003D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_TransformRotation_ReturnValue) == 0x0003D4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_TransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0003E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FTrunc_ReturnValue) == 0x0003E4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0003E8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0003F8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003F9, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BooleanAND_ReturnValue) == 0x0003FA, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMin_ReturnValue) == 0x0003FC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_player_2) == 0x000400, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_DeltaSeconds) == 0x000408, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_player_1) == 0x000410, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_bBlockingHit) == 0x000418, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_bInitialOverlap) == 0x000419, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_Time) == 0x00041C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_Distance) == 0x000420, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_Location) == 0x000424, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_ImpactPoint) == 0x000430, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_Normal) == 0x00043C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_ImpactNormal) == 0x000448, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_PhysMat) == 0x000458, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_HitActor) == 0x000460, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_HitComponent) == 0x000468, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_HitBoneName) == 0x000470, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_HitItem) == 0x000478, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_ElementIndex) == 0x00047C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_FaceIndex) == 0x000480, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_TraceStart) == 0x000484, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakHitResult_TraceEnd) == 0x000490, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_AsGrowing_Plant) == 0x0004A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_AsGrowing_Plant' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_bSuccess_1) == 0x0004A8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Array_Find_ReturnValue) == 0x0004AC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0004B0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Array_Get_Item) == 0x0004B4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_SelectFloat_ReturnValue) == 0x0004B8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x0004BC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMax_ReturnValue) == 0x0004C0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0004C4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMin_ReturnValue_1) == 0x0004C8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0004D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, Temp_int_Variable) == 0x0004D8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_player) == 0x0004E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_hit) == 0x0004E8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_action) == 0x000570, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_SwitchEnum_CmpSuccess) == 0x000571, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000572, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_IntInt_ReturnValue) == 0x000574, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_sleepy_ReturnValue) == 0x000578, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_sleepy_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_getSaveSlot_saveSlot) == 0x000580, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000588, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_isFunny_isFunny) == 0x00058C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_isFunny_isFunny' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000590, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_MakeTransform_ReturnValue_1) == 0x0005A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0005D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0005D8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0005E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0005E4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0005E8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_bucket_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_bucket_C_ActionOptionIndex");
static_assert(sizeof(Prop_bucket_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_bucket_C_ActionOptionIndex");
static_assert(offsetof(Prop_bucket_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_bucket_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ActionOptionIndex, Hit_0) == 0x000008, "Member 'Prop_bucket_C_ActionOptionIndex::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_bucket_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_bucket_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_bucket_C_ReceiveTick");
static_assert(sizeof(Prop_bucket_C_ReceiveTick) == 0x000004, "Wrong size on Prop_bucket_C_ReceiveTick");
static_assert(offsetof(Prop_bucket_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_bucket_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
