#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_sprinkler

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_sprinkler.prop_sprinkler_C.ExecuteUbergraph_prop_sprinkler
// 0x0208 (0x0208 - 0x0000)
struct Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0048(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrowingPlant_C*                        K2Node_DynamicCast_AsGrowing_Plant;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0170(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler) == 0x000008, "Wrong alignment on Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler");
static_assert(sizeof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler) == 0x000208, "Wrong size on Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, EntryPoint) == 0x000000, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, Temp_object_Variable) == 0x000020, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, Temp_int_Array_Index_Variable) == 0x000034, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_WasRecentlyRendered_ReturnValue) == 0x00003C, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000040, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000044, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_obj_statDyn_obj) == 0x000048, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000058, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_SphereOverlapActors_OutActors) == 0x000068, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_SphereOverlapActors_ReturnValue) == 0x000078, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Array_Get_Item) == 0x000080, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, K2Node_DynamicCast_AsGrowing_Plant) == 0x000090, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::K2Node_DynamicCast_AsGrowing_Plant' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Less_FloatFloat_ReturnValue) == 0x00009A, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_GetDistanceTo_ReturnValue) == 0x0000A0, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A4, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_FClamp_ReturnValue) == 0x0000A8, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000AC, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000B0, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0000B4, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0000C4, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0000C8, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_Conv_FloatToString_ReturnValue) == 0x000150, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000160, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_SelectFloat_ReturnValue) == 0x000164, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, K2Node_Event_player) == 0x000168, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, K2Node_Event_hit) == 0x000170, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, K2Node_Event_action) == 0x0001F8, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_SelectFloat_ReturnValue_1) == 0x0001FC, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler, CallFunc_FInterpTo_ReturnValue) == 0x000200, "Member 'Prop_sprinkler_C_ExecuteUbergraph_prop_sprinkler::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function prop_sprinkler.prop_sprinkler_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_sprinkler_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_sprinkler_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_sprinkler_C_ActionOptionIndex");
static_assert(sizeof(Prop_sprinkler_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_sprinkler_C_ActionOptionIndex");
static_assert(offsetof(Prop_sprinkler_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_sprinkler_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ActionOptionIndex, Hit_0) == 0x000008, "Member 'Prop_sprinkler_C_ActionOptionIndex::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_sprinkler_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_sprinkler.prop_sprinkler_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_sprinkler_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_sprinkler_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_sprinkler_C_ReceiveTick");
static_assert(sizeof(Prop_sprinkler_C_ReceiveTick) == 0x000004, "Wrong size on Prop_sprinkler_C_ReceiveTick");
static_assert(offsetof(Prop_sprinkler_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_sprinkler_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_sprinkler.prop_sprinkler_C.connectHose
// 0x0020 (0x0020 - 0x0000)
struct Prop_sprinkler_C_ConnectHose final
{
public:
	class AGroundHose_C*                          Hose_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyRigidBodyAwake_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_sprinkler_C_ConnectHose) == 0x000008, "Wrong alignment on Prop_sprinkler_C_ConnectHose");
static_assert(sizeof(Prop_sprinkler_C_ConnectHose) == 0x000020, "Wrong size on Prop_sprinkler_C_ConnectHose");
static_assert(offsetof(Prop_sprinkler_C_ConnectHose, Hose_0) == 0x000000, "Member 'Prop_sprinkler_C_ConnectHose::Hose_0' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ConnectHose, Return) == 0x000008, "Member 'Prop_sprinkler_C_ConnectHose::Return' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ConnectHose, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'Prop_sprinkler_C_ConnectHose::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ConnectHose, CallFunc_IsAnyRigidBodyAwake_ReturnValue) == 0x000018, "Member 'Prop_sprinkler_C_ConnectHose::CallFunc_IsAnyRigidBodyAwake_ReturnValue' has a wrong offset!");

// Function prop_sprinkler.prop_sprinkler_C.upd
// 0x0002 (0x0002 - 0x0000)
struct Prop_sprinkler_C_Upd final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_sprinkler_C_Upd) == 0x000001, "Wrong alignment on Prop_sprinkler_C_Upd");
static_assert(sizeof(Prop_sprinkler_C_Upd) == 0x000002, "Wrong size on Prop_sprinkler_C_Upd");
static_assert(offsetof(Prop_sprinkler_C_Upd, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Prop_sprinkler_C_Upd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_Upd, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'Prop_sprinkler_C_Upd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function prop_sprinkler.prop_sprinkler_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_sprinkler_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mString                        CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_sprinkler_C_LoadData) == 0x000010, "Wrong alignment on Prop_sprinkler_C_LoadData");
static_assert(sizeof(Prop_sprinkler_C_LoadData) == 0x0000F0, "Wrong size on Prop_sprinkler_C_LoadData");
static_assert(offsetof(Prop_sprinkler_C_LoadData, Data) == 0x000000, "Member 'Prop_sprinkler_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_LoadData, Return) == 0x0000C0, "Member 'Prop_sprinkler_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_sprinkler_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_sprinkler_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_sprinkler_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_sprinkler.prop_sprinkler_C.getData
// 0x02B0 (0x02B0 - 0x0000)
struct Prop_sprinkler_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	struct FStruct_mString                        K2Node_MakeStruct_struct_mString;                  // 0x00D0(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_getKey_self_CastInput;                    // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_getKey_key;                               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x0110(0x00C0)(HasGetValueTypeHash)
	struct FStruct_mString                        CallFunc_Array_Get_Item;                           // 0x01D0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mString>                K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01F0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_sprinkler_C_GetData) == 0x000010, "Wrong alignment on Prop_sprinkler_C_GetData");
static_assert(sizeof(Prop_sprinkler_C_GetData) == 0x0002B0, "Wrong size on Prop_sprinkler_C_GetData");
static_assert(offsetof(Prop_sprinkler_C_GetData, Data) == 0x000000, "Member 'Prop_sprinkler_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, K2Node_MakeArray_Array) == 0x0000C0, "Member 'Prop_sprinkler_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, K2Node_MakeStruct_struct_mString) == 0x0000D0, "Member 'Prop_sprinkler_C_GetData::K2Node_MakeStruct_struct_mString' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'Prop_sprinkler_C_GetData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, CallFunc_getKey_self_CastInput) == 0x0000E8, "Member 'Prop_sprinkler_C_GetData::CallFunc_getKey_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, CallFunc_getKey_key) == 0x0000F8, "Member 'Prop_sprinkler_C_GetData::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, CallFunc_getData_data) == 0x000110, "Member 'Prop_sprinkler_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'Prop_sprinkler_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, K2Node_MakeArray_Array_1) == 0x0001E0, "Member 'Prop_sprinkler_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001F0, "Member 'Prop_sprinkler_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_sprinkler.prop_sprinkler_C.processKeys
// 0x0028 (0x0028 - 0x0000)
struct Prop_sprinkler_C_ProcessKeys final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_processKeys_return;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGroundHose_C*                          K2Node_DynamicCast_AsGround_Hose;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_sprinkler_C_ProcessKeys) == 0x000008, "Wrong alignment on Prop_sprinkler_C_ProcessKeys");
static_assert(sizeof(Prop_sprinkler_C_ProcessKeys) == 0x000028, "Wrong size on Prop_sprinkler_C_ProcessKeys");
static_assert(offsetof(Prop_sprinkler_C_ProcessKeys, Return) == 0x000000, "Member 'Prop_sprinkler_C_ProcessKeys::Return' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ProcessKeys, CallFunc_getObjectFromKey_Output) == 0x000008, "Member 'Prop_sprinkler_C_ProcessKeys::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Prop_sprinkler_C_ProcessKeys, CallFunc_processKeys_return) == 0x000010, "Member 'Prop_sprinkler_C_ProcessKeys::CallFunc_processKeys_return' has a wrong offset!");
