#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_snack

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_prop3_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_food_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_snack.prop_snack_C.ExecuteUbergraph_prop_snack
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_snack_C_ExecuteUbergraph_prop_snack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_ExecuteUbergraph_prop_snack) == 0x000008, "Wrong alignment on Prop_snack_C_ExecuteUbergraph_prop_snack");
static_assert(sizeof(Prop_snack_C_ExecuteUbergraph_prop_snack) == 0x0000A8, "Wrong size on Prop_snack_C_ExecuteUbergraph_prop_snack");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, EntryPoint) == 0x000000, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_player) == 0x000008, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_hit) == 0x000010, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_action) == 0x000098, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_SwitchEnum_CmpSuccess) == 0x000099, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_player_1) == 0x0000A0, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_player_1' has a wrong offset!");

// Function prop_snack.prop_snack_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_snack_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_snack_C_ActionOptionIndex");
static_assert(sizeof(Prop_snack_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_snack_C_ActionOptionIndex");
static_assert(offsetof(Prop_snack_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_snack_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ActionOptionIndex, Hit_0) == 0x000008, "Member 'Prop_snack_C_ActionOptionIndex::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_snack_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_snack.prop_snack_C.eat
// 0x01F0 (0x01F0 - 0x0000)
struct Prop_snack_C_Eat final
{
public:
	class AMainPlayer_C*                          P;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bypassNoHunger;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          B;                                                 // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 A;                                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_collectObject_collected;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x009C(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object;                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x00C8(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0150(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_Eat) == 0x000010, "Wrong alignment on Prop_snack_C_Eat");
static_assert(sizeof(Prop_snack_C_Eat) == 0x0001F0, "Wrong size on Prop_snack_C_Eat");
static_assert(offsetof(Prop_snack_C_Eat, P) == 0x000000, "Member 'Prop_snack_C_Eat::P' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, bypassNoHunger) == 0x000008, "Member 'Prop_snack_C_Eat::bypassNoHunger' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, B) == 0x000009, "Member 'Prop_snack_C_Eat::B' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, A) == 0x000010, "Member 'Prop_snack_C_Eat::A' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, Temp_int_Variable) == 0x000018, "Member 'Prop_snack_C_Eat::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'Prop_snack_C_Eat::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Prop_snack_C_Eat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, Temp_int_Variable_1) == 0x000024, "Member 'Prop_snack_C_Eat::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, Temp_int_Variable_2) == 0x000028, "Member 'Prop_snack_C_Eat::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00002C, "Member 'Prop_snack_C_Eat::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Prop_snack_C_Eat::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, Temp_int_Variable_3) == 0x000034, "Member 'Prop_snack_C_Eat::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, Temp_int_Variable_4) == 0x000038, "Member 'Prop_snack_C_Eat::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'Prop_snack_C_Eat::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Prop_snack_C_Eat::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Prop_snack_C_Eat::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_getMainPlayer_AsMain_Player) == 0x000080, "Member 'Prop_snack_C_Eat::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'Prop_snack_C_Eat::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, Temp_int_Variable_5) == 0x00008C, "Member 'Prop_snack_C_Eat::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_collectObject_collected) == 0x000090, "Member 'Prop_snack_C_Eat::CallFunc_collectObject_collected' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000091, "Member 'Prop_snack_C_Eat::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_Add_IntInt_ReturnValue_2) == 0x000094, "Member 'Prop_snack_C_Eat::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_addFood_full) == 0x000098, "Member 'Prop_snack_C_Eat::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_propToObject_ReturnValue) == 0x000099, "Member 'Prop_snack_C_Eat::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_propToObject_foodData) == 0x00009C, "Member 'Prop_snack_C_Eat::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_propToObject_object) == 0x0000B8, "Member 'Prop_snack_C_Eat::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_propToObject_isFood) == 0x0000C0, "Member 'Prop_snack_C_Eat::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_propToObject_fuckYouRetard) == 0x0000C8, "Member 'Prop_snack_C_Eat::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_IsValidClass_ReturnValue) == 0x000148, "Member 'Prop_snack_C_Eat::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_GetTransform_ReturnValue_1) == 0x000150, "Member 'Prop_snack_C_Eat::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000180, "Member 'Prop_snack_C_Eat::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000188, "Member 'Prop_snack_C_Eat::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000190, "Member 'Prop_snack_C_Eat::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, K2Node_DynamicCast_AsInt_Player) == 0x000198, "Member 'Prop_snack_C_Eat::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'Prop_snack_C_Eat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0001B0, "Member 'Prop_snack_C_Eat::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_asProp_return) == 0x0001B8, "Member 'Prop_snack_C_Eat::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0001C0, "Member 'Prop_snack_C_Eat::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0001C8, "Member 'Prop_snack_C_Eat::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, K2Node_Select_Default) == 0x0001D0, "Member 'Prop_snack_C_Eat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_Conv_NameToString_ReturnValue) == 0x0001D8, "Member 'Prop_snack_C_Eat::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0001E8, "Member 'Prop_snack_C_Eat::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001EC, "Member 'Prop_snack_C_Eat::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function prop_snack.prop_snack_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_snack_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_snack_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_snack_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_snack_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_snack_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_snack_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_snack.prop_snack_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_snack_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_LoadData) == 0x000010, "Wrong alignment on Prop_snack_C_LoadData");
static_assert(sizeof(Prop_snack_C_LoadData) == 0x0000E0, "Wrong size on Prop_snack_C_LoadData");
static_assert(offsetof(Prop_snack_C_LoadData, Data) == 0x000000, "Member 'Prop_snack_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, Return) == 0x0000C0, "Member 'Prop_snack_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_snack_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_snack_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_snack_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_snack.prop_snack_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_snack_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_GetData) == 0x000010, "Wrong alignment on Prop_snack_C_GetData");
static_assert(sizeof(Prop_snack_C_GetData) == 0x000270, "Wrong size on Prop_snack_C_GetData");
static_assert(offsetof(Prop_snack_C_GetData, Data) == 0x000000, "Member 'Prop_snack_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_snack_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_snack_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_snack_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_snack_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_snack_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_snack.prop_snack_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_snack_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_snack_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_snack_C_GetActionOptions");
static_assert(sizeof(Prop_snack_C_GetActionOptions) == 0x000060, "Wrong size on Prop_snack_C_GetActionOptions");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_snack_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_snack_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_snack_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_snack_C_GetActionOptions::Options' has a wrong offset!");
