#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_container_brickstack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_container_brickstack.prop_container_brickstack_C
// 0x0018 (0x0370 - 0x0358)
class AProp_container_brickstack_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_container_brickstack_C;        // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    A;                                                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         bricks;                                            // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_container_brickstack(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit_0, Enum_interactionActions Action);
	void GetData(struct FStruct_save* Data);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit_0, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_container_brickstack_C">();
	}
	static class AProp_container_brickstack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_container_brickstack_C>();
	}
};
static_assert(alignof(AProp_container_brickstack_C) == 0x000008, "Wrong alignment on AProp_container_brickstack_C");
static_assert(sizeof(AProp_container_brickstack_C) == 0x000370, "Wrong size on AProp_container_brickstack_C");
static_assert(offsetof(AProp_container_brickstack_C, UberGraphFrame_Prop_container_brickstack_C) == 0x000358, "Member 'AProp_container_brickstack_C::UberGraphFrame_Prop_container_brickstack_C' has a wrong offset!");
static_assert(offsetof(AProp_container_brickstack_C, A) == 0x000360, "Member 'AProp_container_brickstack_C::A' has a wrong offset!");
static_assert(offsetof(AProp_container_brickstack_C, bricks) == 0x000368, "Member 'AProp_container_brickstack_C::bricks' has a wrong offset!");

}

