#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_openContainer

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_openContainer.prop_openContainer_C.ExecuteUbergraph_prop_openContainer
// 0x01E0 (0x01E0 - 0x0000)
struct Prop_openContainer_C_ExecuteUbergraph_prop_openContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0018(0x0010)(ReferenceParm)
	TArray<class AActor*>                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyRigidBodyAwake_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_setPropProps_self_CastInput;              // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                K2Node_DynamicCast_AsProp_1;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitLocation;        // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitNormal;          // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_LineTraceComponent_BoneName;           // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_LineTraceComponent_OutHit;             // 0x0154(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_LineTraceComponent_ReturnValue;        // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer) == 0x000008, "Wrong alignment on Prop_openContainer_C_ExecuteUbergraph_prop_openContainer");
static_assert(sizeof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer) == 0x0001E0, "Wrong size on Prop_openContainer_C_ExecuteUbergraph_prop_openContainer");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, EntryPoint) == 0x000000, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000018, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000028, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Array_Get_Item) == 0x000038, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000048, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetAttachParentActor_ReturnValue) == 0x000050, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetComponentBounds_Origin) == 0x000058, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetComponentBounds_BoxExtent) == 0x000064, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetComponentBounds_SphereRadius) == 0x000070, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_DynamicCast_AsPrimitive_Component) == 0x000078, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_IsAnyRigidBodyAwake_ReturnValue) == 0x000081, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_IsAnyRigidBodyAwake_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000082, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_DynamicCast_AsProp) == 0x000088, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Array_RemoveItem_ReturnValue) == 0x000091, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_setPropProps_self_CastInput) == 0x000098, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_setPropProps_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, Temp_int_Loop_Counter_Variable_1) == 0x0000A8, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_DynamicCast_AsProp_1) == 0x0000B8, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_DynamicCast_AsProp_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Less_IntInt_ReturnValue) == 0x0000C1, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CC, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetActorUpVector_ReturnValue) == 0x0000E0, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000EC, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000F0, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000F1, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000F2, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetVelocity_ReturnValue) == 0x0000F4, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000100, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_BreakVector_X) == 0x00010C, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_BreakVector_Y) == 0x000110, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_BreakVector_Z) == 0x000114, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000118, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_MakeVector_ReturnValue) == 0x00011C, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000128, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_K2_LineTraceComponent_HitLocation) == 0x000134, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_K2_LineTraceComponent_HitLocation' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_K2_LineTraceComponent_HitNormal) == 0x000140, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_K2_LineTraceComponent_HitNormal' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_K2_LineTraceComponent_BoneName) == 0x00014C, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_K2_LineTraceComponent_BoneName' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_K2_LineTraceComponent_OutHit) == 0x000154, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_K2_LineTraceComponent_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_ExecuteUbergraph_prop_openContainer, CallFunc_K2_LineTraceComponent_ReturnValue) == 0x0001DC, "Member 'Prop_openContainer_C_ExecuteUbergraph_prop_openContainer::CallFunc_K2_LineTraceComponent_ReturnValue' has a wrong offset!");

// Function prop_openContainer.prop_openContainer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_openContainer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_openContainer_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_openContainer_C_ReceiveTick");
static_assert(sizeof(Prop_openContainer_C_ReceiveTick) == 0x000004, "Wrong size on Prop_openContainer_C_ReceiveTick");
static_assert(offsetof(Prop_openContainer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_openContainer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_openContainer.prop_openContainer_C.loadData
// 0x00D0 (0x00D0 - 0x0000)
struct Prop_openContainer_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_openContainer_C_LoadData) == 0x000010, "Wrong alignment on Prop_openContainer_C_LoadData");
static_assert(sizeof(Prop_openContainer_C_LoadData) == 0x0000D0, "Wrong size on Prop_openContainer_C_LoadData");
static_assert(offsetof(Prop_openContainer_C_LoadData, Data) == 0x000000, "Member 'Prop_openContainer_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_LoadData, Return) == 0x0000C0, "Member 'Prop_openContainer_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_openContainer_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_openContainer_C_LoadData::CallFunc_loadData_return' has a wrong offset!");

}

