#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_boof

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_boof.prop_boof_C
// 0x0010 (0x0368 - 0x0358)
class AProp_boof_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_boof_C;                        // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Amount;                                            // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Life;                                              // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_boof(int32 EntryPoint);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_boof_C">();
	}
	static class AProp_boof_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_boof_C>();
	}
};
static_assert(alignof(AProp_boof_C) == 0x000008, "Wrong alignment on AProp_boof_C");
static_assert(sizeof(AProp_boof_C) == 0x000368, "Wrong size on AProp_boof_C");
static_assert(offsetof(AProp_boof_C, UberGraphFrame_Prop_boof_C) == 0x000358, "Member 'AProp_boof_C::UberGraphFrame_Prop_boof_C' has a wrong offset!");
static_assert(offsetof(AProp_boof_C, Amount) == 0x000360, "Member 'AProp_boof_C::Amount' has a wrong offset!");
static_assert(offsetof(AProp_boof_C, Life) == 0x000364, "Member 'AProp_boof_C::Life' has a wrong offset!");

}

