#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_garbageBin

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_mObject_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_garbageBin.prop_garbageBin_C.ExecuteUbergraph_prop_garbageBin
// 0x0520 (0x0520 - 0x0000)
struct Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0110(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_noRespawn_return;                         // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x01D0(0x00C0)(HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_1;                 // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_canBePutInContainer_return;               // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_mObject                        CallFunc_Array_Get_Item;                           // 0x02C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mObject                        CallFunc_Array_Get_Item_1;                         // 0x02E0(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0xC];                                      // 0x02F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_Array_Get_Item_2;                         // 0x0300(0x00C0)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1_1;                 // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0410(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0510(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin) == 0x000010, "Wrong alignment on Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin");
static_assert(sizeof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin) == 0x000520, "Wrong size on Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, EntryPoint) == 0x000000, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakTransform_Location) == 0x000040, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_GetForwardVector_ReturnValue) == 0x000064, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_RandomUnitVector_ReturnValue) == 0x0000AC, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000B8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C4, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000D0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000D8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000E0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000E8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000F0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OtherActor) == 0x0000F8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OtherComp) == 0x000100, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000108, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_bFromSweep) == 0x00010C, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_ComponentBoundEvent_SweepResult) == 0x000110, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000198, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_AsInt_Player) == 0x0001A0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_noRespawn_return) == 0x0001B1, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_noRespawn_return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_AsInt_Save_1) == 0x0001B8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_AsInt_Save_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_getData_data) == 0x0001D0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_AsInt_Player_1) == 0x000290, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_AsInt_Player_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_bSuccess_2) == 0x0002A0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_canBePutInContainer_return) == 0x0002A1, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_canBePutInContainer_return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_IsValidClass_ReturnValue) == 0x0002A2, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_DoesImplementInterface_ReturnValue) == 0x0002A3, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_IsValid_ReturnValue) == 0x0002A4, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Less_IntInt_ReturnValue) == 0x0002A5, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002A8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002B4, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002C0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0002C1, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BooleanAND_ReturnValue) == 0x0002C2, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Array_Add_ReturnValue) == 0x0002C4, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Array_Get_Item) == 0x0002C8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0002D8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Array_Get_Item_1) == 0x0002E0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Array_LastIndex_ReturnValue) == 0x0002F0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Array_Get_Item_2) == 0x000300, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003C0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0003C8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003D0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0003D8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_AsInt_Save_1_1) == 0x0003E0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_AsInt_Save_1_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_bSuccess_3) == 0x0003F0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_AsPrimitive_Component) == 0x0003F8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_DynamicCast_bSuccess_4) == 0x000400, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_loadData_return) == 0x000401, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_Event_player) == 0x000408, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_Event_hit) == 0x000410, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_Event_action) == 0x000498, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, K2Node_SwitchEnum_CmpSuccess) == 0x000499, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_bBlockingHit) == 0x00049A, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_bInitialOverlap) == 0x00049B, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_Time) == 0x00049C, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_Distance) == 0x0004A0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_Location) == 0x0004A4, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_ImpactPoint) == 0x0004B0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_Normal) == 0x0004BC, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_ImpactNormal) == 0x0004C8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_PhysMat) == 0x0004D8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_HitActor) == 0x0004E0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_HitComponent) == 0x0004E8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_HitBoneName) == 0x0004F0, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_HitItem) == 0x0004F8, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_ElementIndex) == 0x0004FC, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_FaceIndex) == 0x000500, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_TraceStart) == 0x000504, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_BreakHitResult_TraceEnd) == 0x000510, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00051C, "Member 'Prop_garbageBin_C_ExecuteUbergraph_prop_garbageBin::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_garbageBin_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBin_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_garbageBin_C_ActionOptionIndex");
static_assert(sizeof(Prop_garbageBin_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_garbageBin_C_ActionOptionIndex");
static_assert(offsetof(Prop_garbageBin_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_garbageBin_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ActionOptionIndex, Hit_0) == 0x000008, "Member 'Prop_garbageBin_C_ActionOptionIndex::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_garbageBin_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_garbageBin_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.findSlot
// 0x0018 (0x0018 - 0x0000)
struct Prop_garbageBin_C_FindSlot final
{
public:
	struct FStruct_mObject                        Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBin_C_FindSlot) == 0x000008, "Wrong alignment on Prop_garbageBin_C_FindSlot");
static_assert(sizeof(Prop_garbageBin_C_FindSlot) == 0x000018, "Wrong size on Prop_garbageBin_C_FindSlot");
static_assert(offsetof(Prop_garbageBin_C_FindSlot, Temp_struct_Variable) == 0x000000, "Member 'Prop_garbageBin_C_FindSlot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_FindSlot, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'Prop_garbageBin_C_FindSlot::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_garbageBin_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBin_C_LoadData) == 0x000010, "Wrong alignment on Prop_garbageBin_C_LoadData");
static_assert(sizeof(Prop_garbageBin_C_LoadData) == 0x0000E0, "Wrong size on Prop_garbageBin_C_LoadData");
static_assert(offsetof(Prop_garbageBin_C_LoadData, Data) == 0x000000, "Member 'Prop_garbageBin_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LoadData, Return) == 0x0000C0, "Member 'Prop_garbageBin_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_garbageBin_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_garbageBin_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LoadData, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'Prop_garbageBin_C_LoadData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000DC, "Member 'Prop_garbageBin_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_garbageBin_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBin_C_GetData) == 0x000010, "Wrong alignment on Prop_garbageBin_C_GetData");
static_assert(sizeof(Prop_garbageBin_C_GetData) == 0x000270, "Wrong size on Prop_garbageBin_C_GetData");
static_assert(offsetof(Prop_garbageBin_C_GetData, Data) == 0x000000, "Member 'Prop_garbageBin_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_garbageBin_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_garbageBin_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_garbageBin_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_garbageBin_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_garbageBin_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.lookAt
// 0x00B8 (0x00B8 - 0x0000)
struct Prop_garbageBin_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBin_C_LookAt) == 0x000008, "Wrong alignment on Prop_garbageBin_C_LookAt");
static_assert(sizeof(Prop_garbageBin_C_LookAt) == 0x0000B8, "Wrong size on Prop_garbageBin_C_LookAt");
static_assert(offsetof(Prop_garbageBin_C_LookAt, Player) == 0x000000, "Member 'Prop_garbageBin_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LookAt, Hit_0) == 0x000008, "Member 'Prop_garbageBin_C_LookAt::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LookAt, Return) == 0x000090, "Member 'Prop_garbageBin_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LookAt, Text) == 0x000098, "Member 'Prop_garbageBin_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_garbageBin_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_LookAt, Number) == 0x0000B0, "Member 'Prop_garbageBin_C_LookAt::Number' has a wrong offset!");

// Function prop_garbageBin.prop_garbageBin_C.getActionOptions
// 0x0088 (0x0088 - 0x0000)
struct Prop_garbageBin_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_Select_Default;                             // 0x0078(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_garbageBin_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_garbageBin_C_GetActionOptions");
static_assert(sizeof(Prop_garbageBin_C_GetActionOptions) == 0x000088, "Wrong size on Prop_garbageBin_C_GetActionOptions");
static_assert(offsetof(Prop_garbageBin_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_garbageBin_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_garbageBin_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_garbageBin_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_garbageBin_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_garbageBin_C_GetActionOptions::Options' has a wrong offset!");
