#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_swinger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK::Params
{

// Function prop_swinger.prop_swinger_C.ExecuteUbergraph_prop_swinger
// 0x0178 (0x0178 - 0x0000)
struct Prop_swinger_C_ExecuteUbergraph_prop_swinger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector2D& MouseXY)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	ERigControlAxis                               Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_mouseXY;                        // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                K2Node_Select_Default;                             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_swinger_C_ExecuteUbergraph_prop_swinger) == 0x000008, "Wrong alignment on Prop_swinger_C_ExecuteUbergraph_prop_swinger");
static_assert(sizeof(Prop_swinger_C_ExecuteUbergraph_prop_swinger) == 0x000178, "Wrong size on Prop_swinger_C_ExecuteUbergraph_prop_swinger");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, EntryPoint) == 0x000000, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, Temp_byte_Variable) == 0x000014, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, K2Node_Event_player) == 0x000018, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, K2Node_Event_hit) == 0x000020, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, K2Node_Event_action) == 0x0000A8, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, K2Node_CustomEvent_mouseXY) == 0x0000AC, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::K2Node_CustomEvent_mouseXY' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_BreakVector2D_X) == 0x0000B4, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_BreakVector2D_Y) == 0x0000B8, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_GetForwardVector_ReturnValue) == 0x0000BC, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_GetRightVector_ReturnValue) == 0x0000C8, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_GetUpVector_ReturnValue) == 0x0000D4, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, K2Node_Select_Default) == 0x0000F0, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_SelectFloat_ReturnValue) == 0x0000FC, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000100, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000104, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000110, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00011C, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_GetForwardVector_ReturnValue_1) == 0x000128, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_Normal_ReturnValue) == 0x000134, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_Dot_VectorVector_ReturnValue) == 0x000140, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_GetParentActor_ReturnValue) == 0x000148, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_SignOfFloat_ReturnValue) == 0x000150, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000158, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000160, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_IsValid_ReturnValue) == 0x000164, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000168, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ExecuteUbergraph_prop_swinger, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000174, "Member 'Prop_swinger_C_ExecuteUbergraph_prop_swinger::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function prop_swinger.prop_swinger_C.mouseAssign
// 0x0008 (0x0008 - 0x0000)
struct Prop_swinger_C_MouseAssign final
{
public:
	struct FVector2D                              MouseXY;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_swinger_C_MouseAssign) == 0x000004, "Wrong alignment on Prop_swinger_C_MouseAssign");
static_assert(sizeof(Prop_swinger_C_MouseAssign) == 0x000008, "Wrong size on Prop_swinger_C_MouseAssign");
static_assert(offsetof(Prop_swinger_C_MouseAssign, MouseXY) == 0x000000, "Member 'Prop_swinger_C_MouseAssign::MouseXY' has a wrong offset!");

// Function prop_swinger.prop_swinger_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_swinger_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_swinger_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_swinger_C_ActionOptionIndex");
static_assert(sizeof(Prop_swinger_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_swinger_C_ActionOptionIndex");
static_assert(offsetof(Prop_swinger_C_ActionOptionIndex, Player_0) == 0x000000, "Member 'Prop_swinger_C_ActionOptionIndex::Player_0' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ActionOptionIndex, Hit_0) == 0x000008, "Member 'Prop_swinger_C_ActionOptionIndex::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_swinger_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_swinger.prop_swinger_C.set
// 0x0130 (0x0130 - 0x0000)
struct Prop_swinger_C_Set final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_swinger_C_Set) == 0x000010, "Wrong alignment on Prop_swinger_C_Set");
static_assert(sizeof(Prop_swinger_C_Set) == 0x000130, "Wrong size on Prop_swinger_C_Set");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'Prop_swinger_C_Set::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'Prop_swinger_C_Set::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_BreakTransform_Location) == 0x00003C, "Member 'Prop_swinger_C_Set::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_BreakTransform_Rotation) == 0x000048, "Member 'Prop_swinger_C_Set::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_BreakTransform_Scale) == 0x000054, "Member 'Prop_swinger_C_Set::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_ComposeRotators_ReturnValue) == 0x000060, "Member 'Prop_swinger_C_Set::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Prop_swinger_C_Set::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_Set, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000A0, "Member 'Prop_swinger_C_Set::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function prop_swinger.prop_swinger_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_swinger_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_swinger_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_swinger_C_GetActionOptions");
static_assert(sizeof(Prop_swinger_C_GetActionOptions) == 0x000060, "Wrong size on Prop_swinger_C_GetActionOptions");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, Player_0) == 0x000000, "Member 'Prop_swinger_C_GetActionOptions::Player_0' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_swinger_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_swinger_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_swinger_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_swinger_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_swinger_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_swinger_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_swinger_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function prop_swinger.prop_swinger_C.lookAt
// 0x0178 (0x0178 - 0x0000)
struct Prop_swinger_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00D0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0100(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_swinger_C_LookAt) == 0x000008, "Wrong alignment on Prop_swinger_C_LookAt");
static_assert(sizeof(Prop_swinger_C_LookAt) == 0x000178, "Wrong size on Prop_swinger_C_LookAt");
static_assert(offsetof(Prop_swinger_C_LookAt, Player_0) == 0x000000, "Member 'Prop_swinger_C_LookAt::Player_0' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, Hit_0) == 0x000008, "Member 'Prop_swinger_C_LookAt::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, Return) == 0x000090, "Member 'Prop_swinger_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, Text) == 0x000098, "Member 'Prop_swinger_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_swinger_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, Number) == 0x0000B0, "Member 'Prop_swinger_C_LookAt::Number' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, Temp_bool_Variable) == 0x0000B1, "Member 'Prop_swinger_C_LookAt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, Temp_text_Variable) == 0x0000B8, "Member 'Prop_swinger_C_LookAt::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, Temp_text_Variable_1) == 0x0000D0, "Member 'Prop_swinger_C_LookAt::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, K2Node_Select_Default) == 0x0000E8, "Member 'Prop_swinger_C_LookAt::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, K2Node_MakeStruct_FormatArgumentData) == 0x000100, "Member 'Prop_swinger_C_LookAt::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, K2Node_MakeArray_Array) == 0x000140, "Member 'Prop_swinger_C_LookAt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, CallFunc_Format_ReturnValue) == 0x000150, "Member 'Prop_swinger_C_LookAt::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_swinger_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x000168, "Member 'Prop_swinger_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

