#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_landmine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_landmine.prop_landmine_C
// 0x0028 (0x0380 - 0x0358)
class AProp_landmine_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_landmine_C;                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_landmine(int32 EntryPoint);
	void BndEvt__prop_landmine_Cylinder_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__prop_landmine_Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void SetPropProps(bool Static_0, bool Frozen_0, bool Active_0);
	void Init();
	void CanPickup(bool* Return);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_landmine_C">();
	}
	static class AProp_landmine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_landmine_C>();
	}
};
static_assert(alignof(AProp_landmine_C) == 0x000008, "Wrong alignment on AProp_landmine_C");
static_assert(sizeof(AProp_landmine_C) == 0x000380, "Wrong size on AProp_landmine_C");
static_assert(offsetof(AProp_landmine_C, UberGraphFrame_Prop_landmine_C) == 0x000358, "Member 'AProp_landmine_C::UberGraphFrame_Prop_landmine_C' has a wrong offset!");
static_assert(offsetof(AProp_landmine_C, Cylinder) == 0x000360, "Member 'AProp_landmine_C::Cylinder' has a wrong offset!");
static_assert(offsetof(AProp_landmine_C, Billboard) == 0x000368, "Member 'AProp_landmine_C::Billboard' has a wrong offset!");
static_assert(offsetof(AProp_landmine_C, Audio) == 0x000370, "Member 'AProp_landmine_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_landmine_C, Active) == 0x000378, "Member 'AProp_landmine_C::Active' has a wrong offset!");

}

