#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_funGun_crossbow

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_funGun_crossbow.prop_funGun_crossbow_C.ExecuteUbergraph_prop_funGun_crossbow
// 0x0040 (0x0040 - 0x0000)
struct Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow) == 0x000008, "Wrong alignment on Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow");
static_assert(sizeof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow) == 0x000040, "Wrong size on Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, EntryPoint) == 0x000000, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_SelectFloat_ReturnValue_1) == 0x00000C, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000010, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_LinearColorLerp_ReturnValue) == 0x000014, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_Lerp_ReturnValue) == 0x000024, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_Conv_FloatToString_ReturnValue) == 0x000028, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow, CallFunc_FInterpTo_ReturnValue) == 0x000038, "Member 'Prop_funGun_crossbow_C_ExecuteUbergraph_prop_funGun_crossbow::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function prop_funGun_crossbow.prop_funGun_crossbow_C.fireBulletPrimary
// 0x00C0 (0x00C0 - 0x0000)
struct Prop_funGun_crossbow_C_FireBulletPrimary final
{
public:
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_getView_OutLocation;                      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_getView_OutRotation;                      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACrossbowBolt_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_crossbow_C_FireBulletPrimary) == 0x000010, "Wrong alignment on Prop_funGun_crossbow_C_FireBulletPrimary");
static_assert(sizeof(Prop_funGun_crossbow_C_FireBulletPrimary) == 0x0000C0, "Wrong size on Prop_funGun_crossbow_C_FireBulletPrimary");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_RandomUnitVector_ReturnValue) == 0x000000, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_GetVelocity_ReturnValue) == 0x00000C, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_getView_OutLocation) == 0x000018, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_getView_OutLocation' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_getView_OutRotation) == 0x000024, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_getView_OutRotation' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_VSize_ReturnValue) == 0x000030, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_FClamp_ReturnValue) == 0x000080, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_Lerp_ReturnValue) == 0x000084, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_GetForwardVector_ReturnValue) == 0x000090, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_VLerp_ReturnValue) == 0x00009C, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_FireBulletPrimary, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'Prop_funGun_crossbow_C_FireBulletPrimary::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function prop_funGun_crossbow.prop_funGun_crossbow_C.updateMag
// 0x0001 (0x0001 - 0x0000)
struct Prop_funGun_crossbow_C_UpdateMag final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_funGun_crossbow_C_UpdateMag) == 0x000001, "Wrong alignment on Prop_funGun_crossbow_C_UpdateMag");
static_assert(sizeof(Prop_funGun_crossbow_C_UpdateMag) == 0x000001, "Wrong size on Prop_funGun_crossbow_C_UpdateMag");
static_assert(offsetof(Prop_funGun_crossbow_C_UpdateMag, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'Prop_funGun_crossbow_C_UpdateMag::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function prop_funGun_crossbow.prop_funGun_crossbow_C.Init
// 0x0010 (0x0010 - 0x0000)
struct Prop_funGun_crossbow_C_Init final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_crossbow_C_Init) == 0x000008, "Wrong alignment on Prop_funGun_crossbow_C_Init");
static_assert(sizeof(Prop_funGun_crossbow_C_Init) == 0x000010, "Wrong size on Prop_funGun_crossbow_C_Init");
static_assert(offsetof(Prop_funGun_crossbow_C_Init, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Prop_funGun_crossbow_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_Init, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Prop_funGun_crossbow_C_Init::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function prop_funGun_crossbow.prop_funGun_crossbow_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_funGun_crossbow_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_crossbow_C_LoadData) == 0x000010, "Wrong alignment on Prop_funGun_crossbow_C_LoadData");
static_assert(sizeof(Prop_funGun_crossbow_C_LoadData) == 0x0000E0, "Wrong size on Prop_funGun_crossbow_C_LoadData");
static_assert(offsetof(Prop_funGun_crossbow_C_LoadData, Data) == 0x000000, "Member 'Prop_funGun_crossbow_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_LoadData, Return) == 0x0000C0, "Member 'Prop_funGun_crossbow_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_funGun_crossbow_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_funGun_crossbow_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_funGun_crossbow_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_funGun_crossbow.prop_funGun_crossbow_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_funGun_crossbow_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_crossbow_C_GetData) == 0x000010, "Wrong alignment on Prop_funGun_crossbow_C_GetData");
static_assert(sizeof(Prop_funGun_crossbow_C_GetData) == 0x000280, "Wrong size on Prop_funGun_crossbow_C_GetData");
static_assert(offsetof(Prop_funGun_crossbow_C_GetData, Data) == 0x000000, "Member 'Prop_funGun_crossbow_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_funGun_crossbow_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_funGun_crossbow_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_GetData, K2Node_MakeStruct_struct_mFloat) == 0x000190, "Member 'Prop_funGun_crossbow_C_GetData::K2Node_MakeStruct_struct_mFloat' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_GetData, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Prop_funGun_crossbow_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_funGun_crossbow_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_crossbow_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_funGun_crossbow_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

