#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_cookingFood_rawSausage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_food_structs.hpp"
#include "Struct_prop3_structs.hpp"


namespace SDK::Params
{

// Function prop_cookingFood_rawSausage.prop_cookingFood_rawSausage_C.ExecuteUbergraph_prop_cookingFood_rawSausage
// 0x0230 (0x0230 - 0x0000)
struct Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x0020(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x0050(0x0080)(HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x00DC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0190(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage) == 0x000010, "Wrong alignment on Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage");
static_assert(sizeof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage) == 0x000230, "Wrong size on Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, EntryPoint) == 0x000000, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, Temp_int_Variable) == 0x000004, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, Temp_int_Variable_1) == 0x000010, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_propToObject_ReturnValue) == 0x00001C, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_propToObject_foodData) == 0x000020, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_propToObject_object) == 0x000040, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_propToObject_isFood) == 0x000048, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_propToObject_fuckYouRetard) == 0x000050, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, Temp_name_Variable) == 0x0000D0, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_IsValidClass_ReturnValue) == 0x0000D8, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, Temp_name_Variable_1) == 0x0000DC, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, Temp_int_Variable_2) == 0x0000E4, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, Temp_int_Variable_3) == 0x0000E8, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000EC, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000F0, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, K2Node_Event_player) == 0x0000F8, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, K2Node_Event_hit) == 0x000100, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, K2Node_Event_action) == 0x000188, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_GetTransform_ReturnValue) == 0x000190, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, K2Node_SwitchEnum_CmpSuccess) == 0x0001C0, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C8, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001D0, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D8, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, K2Node_DynamicCast_AsInt_Player) == 0x0001E0, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001F8, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_asProp_return) == 0x000200, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000208, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000210, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage, CallFunc_Conv_NameToString_ReturnValue) == 0x000218, "Member 'Prop_cookingFood_rawSausage_C_ExecuteUbergraph_prop_cookingFood_rawSausage::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function prop_cookingFood_rawSausage.prop_cookingFood_rawSausage_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_cookingFood_rawSausage_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_cookingFood_rawSausage_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_cookingFood_rawSausage_C_ActionOptionIndex");
static_assert(sizeof(Prop_cookingFood_rawSausage_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_cookingFood_rawSausage_C_ActionOptionIndex");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_cookingFood_rawSausage_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ActionOptionIndex, Hit_0) == 0x000008, "Member 'Prop_cookingFood_rawSausage_C_ActionOptionIndex::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_cookingFood_rawSausage_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_cookingFood_rawSausage.prop_cookingFood_rawSausage_C.lookAt
// 0x00B8 (0x00B8 - 0x0000)
struct Prop_cookingFood_rawSausage_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_cookingFood_rawSausage_C_LookAt) == 0x000008, "Wrong alignment on Prop_cookingFood_rawSausage_C_LookAt");
static_assert(sizeof(Prop_cookingFood_rawSausage_C_LookAt) == 0x0000B8, "Wrong size on Prop_cookingFood_rawSausage_C_LookAt");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_LookAt, Player) == 0x000000, "Member 'Prop_cookingFood_rawSausage_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_LookAt, Hit_0) == 0x000008, "Member 'Prop_cookingFood_rawSausage_C_LookAt::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_LookAt, Return) == 0x000090, "Member 'Prop_cookingFood_rawSausage_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_LookAt, Text) == 0x000098, "Member 'Prop_cookingFood_rawSausage_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_cookingFood_rawSausage_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_rawSausage_C_LookAt, Number) == 0x0000B0, "Member 'Prop_cookingFood_rawSausage_C_LookAt::Number' has a wrong offset!");

}

