#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_turbine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_wireComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wireComponent_turbine.prop_wireComponent_turbine_C
// 0x0030 (0x0390 - 0x0360)
class AProp_wireComponent_turbine_C final : public AProp_wireComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wireComponent_turbine_C;       // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        UnderwaterLoop;                                    // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Regular;                                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Force;                                             // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Underwater;                                        // 0x038C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_wireComponent_turbine(int32 EntryPoint);
	void ExitTheWater();
	void EnteredTheWater();
	void WirePass(class AWire_C* Wire);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wireComponent_turbine_C">();
	}
	static class AProp_wireComponent_turbine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wireComponent_turbine_C>();
	}
};
static_assert(alignof(AProp_wireComponent_turbine_C) == 0x000008, "Wrong alignment on AProp_wireComponent_turbine_C");
static_assert(sizeof(AProp_wireComponent_turbine_C) == 0x000390, "Wrong size on AProp_wireComponent_turbine_C");
static_assert(offsetof(AProp_wireComponent_turbine_C, UberGraphFrame_Prop_wireComponent_turbine_C) == 0x000360, "Member 'AProp_wireComponent_turbine_C::UberGraphFrame_Prop_wireComponent_turbine_C' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_turbine_C, UnderwaterLoop) == 0x000368, "Member 'AProp_wireComponent_turbine_C::UnderwaterLoop' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_turbine_C, Regular) == 0x000370, "Member 'AProp_wireComponent_turbine_C::Regular' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_turbine_C, ParticleSystem) == 0x000378, "Member 'AProp_wireComponent_turbine_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_turbine_C, Arrow) == 0x000380, "Member 'AProp_wireComponent_turbine_C::Arrow' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_turbine_C, Force) == 0x000388, "Member 'AProp_wireComponent_turbine_C::Force' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_turbine_C, Underwater) == 0x00038C, "Member 'AProp_wireComponent_turbine_C::Underwater' has a wrong offset!");

}

