#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_vending

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_prop3_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_food_structs.hpp"


namespace SDK::Params
{

// Function prop_vending.prop_vending_C.ExecuteUbergraph_prop_vending
// 0x0590 (0x0590 - 0x0000)
struct Prop_vending_C_ExecuteUbergraph_prop_vending final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x01BC(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object;                      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x01E8(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_1;                 // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return_1;                          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x030C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable_5;                               // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0xC];                                      // 0x03C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_8;                               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue_1;     // 0x0410(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0470(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0484(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue_1;               // 0x048D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E[0x2];                                      // 0x048E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData_1;                  // 0x0490(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object_1;                    // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood_1;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard_1;             // 0x04C0(0x0080)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_6;        // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_2;                 // 0x0558(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return_2;                          // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vending_C_ExecuteUbergraph_prop_vending) == 0x000010, "Wrong alignment on Prop_vending_C_ExecuteUbergraph_prop_vending");
static_assert(sizeof(Prop_vending_C_ExecuteUbergraph_prop_vending) == 0x000590, "Wrong size on Prop_vending_C_ExecuteUbergraph_prop_vending");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, EntryPoint) == 0x000000, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000010, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable) == 0x000040, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_1) == 0x000058, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_2) == 0x00005C, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_3) == 0x000068, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Array_Index_Variable) == 0x000074, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_Event_player) == 0x000078, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_Event_hit) == 0x000080, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_Event_name) == 0x000108, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_SwitchString_CmpSuccess) == 0x000118, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_4) == 0x00011C, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000120, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00012C, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Add_IntInt_ReturnValue_2) == 0x000130, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000134, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_GetForwardVector_ReturnValue) == 0x000140, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000180, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000190, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000198, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001A0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0001A8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_getSaveSlot_saveSlot) == 0x0001B0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_ReturnValue) == 0x0001B8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_foodData) == 0x0001BC, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_object) == 0x0001D8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_isFood) == 0x0001E0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_fuckYouRetard) == 0x0001E8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000268, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000270, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_IsValidClass_ReturnValue) == 0x000278, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000280, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_DynamicCast_AsInt_Player) == 0x000288, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_DynamicCast_bSuccess) == 0x000298, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_Select_Default) == 0x0002A0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_asProp_return) == 0x0002A8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_DynamicCast_AsInt_Player_1) == 0x0002B0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_DynamicCast_AsInt_Player_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_DynamicCast_bSuccess_1) == 0x0002C0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_asProp_return_1) == 0x0002C8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_asProp_return_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Conv_NameToString_ReturnValue) == 0x0002D0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Multiply_IntInt_ReturnValue) == 0x0002E0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_ComponentBoundEvent_HitComponent) == 0x0002E8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_ComponentBoundEvent_OtherActor) == 0x0002F0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_ComponentBoundEvent_OtherComp) == 0x0002F8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000300, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_ComponentBoundEvent_Hit) == 0x00030C, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_5) == 0x000394, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000398, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Add_IntInt_ReturnValue_3) == 0x00039C, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_6) == 0x0003A0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_7) == 0x0003A4, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0003A8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Add_IntInt_ReturnValue_4) == 0x0003AC, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x0003B0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Add_IntInt_ReturnValue_5) == 0x0003B4, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0003B8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_GetTransform_ReturnValue) == 0x0003D0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, Temp_int_Variable_8) == 0x000400, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_TransformLocation_ReturnValue) == 0x000404, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Conv_VectorToTransform_ReturnValue_1) == 0x000410, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Conv_VectorToTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x000440, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x000448, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x000450, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5) == 0x000458, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Add_IntInt_ReturnValue_6) == 0x000460, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_FinishSpawningActor_ReturnValue_5) == 0x000468, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_FinishSpawningActor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Map_Keys_Keys) == 0x000470, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Array_Length_ReturnValue) == 0x000480, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Array_Get_Item) == 0x000484, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Less_IntInt_ReturnValue) == 0x00048C, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_ReturnValue_1) == 0x00048D, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_foodData_1) == 0x000490, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_foodData_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_object_1) == 0x0004B0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_object_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_isFood_1) == 0x0004B8, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_isFood_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_propToObject_fuckYouRetard_1) == 0x0004C0, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_propToObject_fuckYouRetard_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6) == 0x000540, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_IsValidClass_ReturnValue_1) == 0x000548, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_FinishSpawningActor_ReturnValue_6) == 0x000550, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_FinishSpawningActor_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_DynamicCast_AsInt_Player_2) == 0x000558, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_DynamicCast_AsInt_Player_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, K2Node_DynamicCast_bSuccess_2) == 0x000568, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_asProp_return_2) == 0x000570, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_asProp_return_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ExecuteUbergraph_prop_vending, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000578, "Member 'Prop_vending_C_ExecuteUbergraph_prop_vending::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");

// Function prop_vending.prop_vending_C.BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit_0) == 0x000024, "Member 'Prop_vending_C_BndEvt__prop_vending_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit_0' has a wrong offset!");

// Function prop_vending.prop_vending_C.Add
// 0x000C (0x000C - 0x0000)
struct Prop_vending_C_Add final
{
public:
	int32                                         B;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vending_C_Add) == 0x000004, "Wrong alignment on Prop_vending_C_Add");
static_assert(sizeof(Prop_vending_C_Add) == 0x00000C, "Wrong size on Prop_vending_C_Add");
static_assert(offsetof(Prop_vending_C_Add, B) == 0x000000, "Member 'Prop_vending_C_Add::B' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_Add, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Prop_vending_C_Add::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_Add, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'Prop_vending_C_Add::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function prop_vending.prop_vending_C.updMsg
// 0x01B0 (0x01B0 - 0x0000)
struct Prop_vending_C_UpdMsg final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0040(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0050(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vending_C_UpdMsg) == 0x000008, "Wrong alignment on Prop_vending_C_UpdMsg");
static_assert(sizeof(Prop_vending_C_UpdMsg) == 0x0001B0, "Wrong size on Prop_vending_C_UpdMsg");
static_assert(offsetof(Prop_vending_C_UpdMsg, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'Prop_vending_C_UpdMsg::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_Map_Values_Values) == 0x000040, "Member 'Prop_vending_C_UpdMsg::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_Map_Keys_Keys) == 0x000050, "Member 'Prop_vending_C_UpdMsg::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_Array_Get_Item) == 0x000060, "Member 'Prop_vending_C_UpdMsg::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Prop_vending_C_UpdMsg::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'Prop_vending_C_UpdMsg::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F0, "Member 'Prop_vending_C_UpdMsg::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'Prop_vending_C_UpdMsg::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'Prop_vending_C_UpdMsg::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, K2Node_MakeArray_Array) == 0x000178, "Member 'Prop_vending_C_UpdMsg::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_Format_ReturnValue) == 0x000188, "Member 'Prop_vending_C_UpdMsg::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_UpdMsg, CallFunc_Conv_TextToString_ReturnValue) == 0x0001A0, "Member 'Prop_vending_C_UpdMsg::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function prop_vending.prop_vending_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Prop_vending_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Name_0;                                            // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vending_C_ActionName) == 0x000008, "Wrong alignment on Prop_vending_C_ActionName");
static_assert(sizeof(Prop_vending_C_ActionName) == 0x0000A0, "Wrong size on Prop_vending_C_ActionName");
static_assert(offsetof(Prop_vending_C_ActionName, Player) == 0x000000, "Member 'Prop_vending_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ActionName, Hit_0) == 0x000008, "Member 'Prop_vending_C_ActionName::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_ActionName, Name_0) == 0x000090, "Member 'Prop_vending_C_ActionName::Name_0' has a wrong offset!");

// Function prop_vending.prop_vending_C.lookAt
// 0x0140 (0x0140 - 0x0000)
struct Prop_vending_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Select_Default;                             // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vending_C_LookAt) == 0x000008, "Wrong alignment on Prop_vending_C_LookAt");
static_assert(sizeof(Prop_vending_C_LookAt) == 0x000140, "Wrong size on Prop_vending_C_LookAt");
static_assert(offsetof(Prop_vending_C_LookAt, Player) == 0x000000, "Member 'Prop_vending_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, Hit_0) == 0x000008, "Member 'Prop_vending_C_LookAt::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, Return) == 0x000090, "Member 'Prop_vending_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, Text) == 0x000098, "Member 'Prop_vending_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_vending_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, Number) == 0x0000B0, "Member 'Prop_vending_C_LookAt::Number' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, Temp_bool_Variable) == 0x0000B1, "Member 'Prop_vending_C_LookAt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B2, "Member 'Prop_vending_C_LookAt::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B3, "Member 'Prop_vending_C_LookAt::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, CallFunc_BreakHitResult_Time) == 0x0000B4, "Member 'Prop_vending_C_LookAt::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, CallFunc_BreakHitResult_Distance) == 0x0000B8, "Member 'Prop_vending_C_LookAt::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_vending_C_LookAt, CallFunc_BreakHitResult_Location) == 0x0000BC, "Member 'Prop_vending_C_LookAt::CallFunc_BreakHitResult_Location' has a wrong offset!");
