#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_saltrocket

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_saltrocket.prop_saltrocket_C.ExecuteUbergraph_prop_saltrocket
// 0x0140 (0x0140 - 0x0000)
struct Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMassScale_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket) == 0x000010, "Wrong alignment on Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket");
static_assert(sizeof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket) == 0x000140, "Wrong size on Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, EntryPoint) == 0x000000, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_RLerp_ReturnValue) == 0x00000C, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_VLerp_ReturnValue) == 0x000018, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_GetActorUpVector_ReturnValue) == 0x000024, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_GetMassScale_ReturnValue) == 0x000030, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_GetMassScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_GetCenterOfMass_ReturnValue) == 0x000034, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000044, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_GetAttachParentActor_ReturnValue) == 0x000058, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000060, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000069, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_IsValid_ReturnValue_2) == 0x00006A, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00006C, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000B0, "Member 'Prop_saltrocket_C_ExecuteUbergraph_prop_saltrocket::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");

// Function prop_saltrocket.prop_saltrocket_C.explode
// 0x00A0 (0x00A0 - 0x0000)
struct Prop_saltrocket_C_Explode final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_saltrocket_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_saltrocket_C_Explode) == 0x000010, "Wrong alignment on Prop_saltrocket_C_Explode");
static_assert(sizeof(Prop_saltrocket_C_Explode) == 0x0000A0, "Wrong size on Prop_saltrocket_C_Explode");
static_assert(offsetof(Prop_saltrocket_C_Explode, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'Prop_saltrocket_C_Explode::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_Explode, CallFunc_BreakTransform_Location) == 0x000030, "Member 'Prop_saltrocket_C_Explode::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_Explode, CallFunc_BreakTransform_Rotation) == 0x00003C, "Member 'Prop_saltrocket_C_Explode::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_Explode, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'Prop_saltrocket_C_Explode::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_Explode, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Prop_saltrocket_C_Explode::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_Explode, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'Prop_saltrocket_C_Explode::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_saltrocket_C_Explode, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'Prop_saltrocket_C_Explode::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

