#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wallbuilder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wallbuilder.prop_wallbuilder_C
// 0x00A8 (0x0400 - 0x0358)
class AProp_wallbuilder_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wallbuilder_C;                 // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Rot;                                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Pivot_B;                                           // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Pivot_A;                                           // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Editing;                                           // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Prev;                                              // 0x0394(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevVec;                                           // 0x03A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Len;                                               // 0x03AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComp_nametag_C*                        VisTextComp;                                       // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHit;                                             // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHeld;                                            // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C2[0x2];                                      // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Shape;                                             // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FirstNorm;                                         // 0x03C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FirstHit;                                          // 0x03D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CentralMode;                                       // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Cheat;                                             // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrevLoc;                                           // 0x03E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreNorm;                                           // 0x03F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material;                                          // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_wallbuilder(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnCompleted_8882420E4F2CF57684C98A8A5539FB1C(class FName NotifyName);
	void OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C(class FName NotifyName);
	void OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C(class FName NotifyName);
	void OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C(class FName NotifyName);
	void OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C(class FName NotifyName);
	void AddWall();
	void SetPivotLoc();
	void EditShape();
	void SetRot(const struct FVector& Vector);
	void EditMat();
	void ReceiveBeginPlay();
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void PlayerHandRelease_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wallbuilder_C">();
	}
	static class AProp_wallbuilder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wallbuilder_C>();
	}
};
static_assert(alignof(AProp_wallbuilder_C) == 0x000008, "Wrong alignment on AProp_wallbuilder_C");
static_assert(sizeof(AProp_wallbuilder_C) == 0x000400, "Wrong size on AProp_wallbuilder_C");
static_assert(offsetof(AProp_wallbuilder_C, UberGraphFrame_Prop_wallbuilder_C) == 0x000358, "Member 'AProp_wallbuilder_C::UberGraphFrame_Prop_wallbuilder_C' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Rot) == 0x000360, "Member 'AProp_wallbuilder_C::Rot' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, StaticMesh2) == 0x000368, "Member 'AProp_wallbuilder_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, StaticMesh1) == 0x000370, "Member 'AProp_wallbuilder_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Cube) == 0x000378, "Member 'AProp_wallbuilder_C::Cube' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Pivot_B) == 0x000380, "Member 'AProp_wallbuilder_C::Pivot_B' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Pivot_A) == 0x000388, "Member 'AProp_wallbuilder_C::Pivot_A' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Editing) == 0x000390, "Member 'AProp_wallbuilder_C::Editing' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Prev) == 0x000394, "Member 'AProp_wallbuilder_C::Prev' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, PrevVec) == 0x0003A0, "Member 'AProp_wallbuilder_C::PrevVec' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Len) == 0x0003AC, "Member 'AProp_wallbuilder_C::Len' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, VisTextComp) == 0x0003B8, "Member 'AProp_wallbuilder_C::VisTextComp' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, IsHit) == 0x0003C0, "Member 'AProp_wallbuilder_C::IsHit' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, IsHeld) == 0x0003C1, "Member 'AProp_wallbuilder_C::IsHeld' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Shape) == 0x0003C4, "Member 'AProp_wallbuilder_C::Shape' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, FirstNorm) == 0x0003C8, "Member 'AProp_wallbuilder_C::FirstNorm' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, FirstHit) == 0x0003D4, "Member 'AProp_wallbuilder_C::FirstHit' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, CentralMode) == 0x0003E0, "Member 'AProp_wallbuilder_C::CentralMode' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Cheat) == 0x0003E1, "Member 'AProp_wallbuilder_C::Cheat' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, PrevLoc) == 0x0003E4, "Member 'AProp_wallbuilder_C::PrevLoc' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, PreNorm) == 0x0003F0, "Member 'AProp_wallbuilder_C::PreNorm' has a wrong offset!");
static_assert(offsetof(AProp_wallbuilder_C, Material) == 0x0003FC, "Member 'AProp_wallbuilder_C::Material' has a wrong offset!");

}

