#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_jacko

#include "Basic.hpp"

#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_jacko.prop_jacko_C
// 0x0018 (0x0370 - 0x0358)
class AProp_jacko_C final : public AProp_C
{
public:
	class UStaticMeshComponent*                   Flame;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Candl;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_jacko_C">();
	}
	static class AProp_jacko_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_jacko_C>();
	}
};
static_assert(alignof(AProp_jacko_C) == 0x000008, "Wrong alignment on AProp_jacko_C");
static_assert(sizeof(AProp_jacko_C) == 0x000370, "Wrong size on AProp_jacko_C");
static_assert(offsetof(AProp_jacko_C, Flame) == 0x000358, "Member 'AProp_jacko_C::Flame' has a wrong offset!");
static_assert(offsetof(AProp_jacko_C, Candl) == 0x000360, "Member 'AProp_jacko_C::Candl' has a wrong offset!");
static_assert(offsetof(AProp_jacko_C, PointLight) == 0x000368, "Member 'AProp_jacko_C::PointLight' has a wrong offset!");

}

