#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_arirPhone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_arirPhone.prop_arirPhone_C
// 0x0018 (0x0370 - 0x0358)
class AProp_arirPhone_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_arirPhone_C;                   // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USlapperSummoner_C*                     SlapperSummoner;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SparkSh_Cue;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_arirPhone(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit_0, Enum_interactionActions Action);
	void Shock(class AMainPlayer_C* InputPin);
	void BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit_0);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_arirPhone_C">();
	}
	static class AProp_arirPhone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_arirPhone_C>();
	}
};
static_assert(alignof(AProp_arirPhone_C) == 0x000008, "Wrong alignment on AProp_arirPhone_C");
static_assert(sizeof(AProp_arirPhone_C) == 0x000370, "Wrong size on AProp_arirPhone_C");
static_assert(offsetof(AProp_arirPhone_C, UberGraphFrame_Prop_arirPhone_C) == 0x000358, "Member 'AProp_arirPhone_C::UberGraphFrame_Prop_arirPhone_C' has a wrong offset!");
static_assert(offsetof(AProp_arirPhone_C, SlapperSummoner) == 0x000360, "Member 'AProp_arirPhone_C::SlapperSummoner' has a wrong offset!");
static_assert(offsetof(AProp_arirPhone_C, SparkSh_Cue) == 0x000368, "Member 'AProp_arirPhone_C::SparkSh_Cue' has a wrong offset!");

}

