#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_rug

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_rug.prop_rug_C
// 0x0028 (0x0380 - 0x0358)
class AProp_rug_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_rug_C;                         // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        SpawnLoc;                                          // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Skin;                                              // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AMainPlayer_C*                          HoldingPlayer;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_rug(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit_0, Enum_interactionActions Action);
	void PlaceOnGround();
	void PlaceFromHand();
	void PlayerHold(class AMainPlayer_C* Player);
	void GamemodeBeginPlay();
	void ReceiveBeginPlay();
	void SetPropProps(bool Static_0, bool Frozen_0, bool Active);
	void SendName(class FName Name_0);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void UserConstructionScript();
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_rug_C">();
	}
	static class AProp_rug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_rug_C>();
	}
};
static_assert(alignof(AProp_rug_C) == 0x000008, "Wrong alignment on AProp_rug_C");
static_assert(sizeof(AProp_rug_C) == 0x000380, "Wrong size on AProp_rug_C");
static_assert(offsetof(AProp_rug_C, UberGraphFrame_Prop_rug_C) == 0x000358, "Member 'AProp_rug_C::UberGraphFrame_Prop_rug_C' has a wrong offset!");
static_assert(offsetof(AProp_rug_C, Decal) == 0x000360, "Member 'AProp_rug_C::Decal' has a wrong offset!");
static_assert(offsetof(AProp_rug_C, SpawnLoc) == 0x000368, "Member 'AProp_rug_C::SpawnLoc' has a wrong offset!");
static_assert(offsetof(AProp_rug_C, Type) == 0x000370, "Member 'AProp_rug_C::Type' has a wrong offset!");
static_assert(offsetof(AProp_rug_C, Skin) == 0x000374, "Member 'AProp_rug_C::Skin' has a wrong offset!");
static_assert(offsetof(AProp_rug_C, HoldingPlayer) == 0x000378, "Member 'AProp_rug_C::HoldingPlayer' has a wrong offset!");

}

