#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fishbait

#include "Basic.hpp"

#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_fishbait.prop_fishbait_C
// 0x0060 (0x03B8 - 0x0358)
class AProp_fishbait_C : public AProp_C
{
public:
	float                                         Exponent;                                          // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eat;                                               // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lure;                                              // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      AddLoot;                                           // 0x0368(0x0050)(Edit, BlueprintVisible)

public:
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit_0, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_fishbait_C">();
	}
	static class AProp_fishbait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_fishbait_C>();
	}
};
static_assert(alignof(AProp_fishbait_C) == 0x000008, "Wrong alignment on AProp_fishbait_C");
static_assert(sizeof(AProp_fishbait_C) == 0x0003B8, "Wrong size on AProp_fishbait_C");
static_assert(offsetof(AProp_fishbait_C, Exponent) == 0x000358, "Member 'AProp_fishbait_C::Exponent' has a wrong offset!");
static_assert(offsetof(AProp_fishbait_C, Eat) == 0x00035C, "Member 'AProp_fishbait_C::Eat' has a wrong offset!");
static_assert(offsetof(AProp_fishbait_C, Lure) == 0x000360, "Member 'AProp_fishbait_C::Lure' has a wrong offset!");
static_assert(offsetof(AProp_fishbait_C, AddLoot) == 0x000368, "Member 'AProp_fishbait_C::AddLoot' has a wrong offset!");

}

