#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_hose

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_hose.prop_hose_C.ExecuteUbergraph_prop_hose
// 0x0150 (0x0150 - 0x0000)
struct Prop_hose_C_ExecuteUbergraph_prop_hose final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_sprinkler_C*                      K2Node_DynamicCast_AsProp_Sprinkler;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFaucet_C*                              K2Node_DynamicCast_AsFaucet;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGroundHose_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_connectHose_return;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_hose_C_ExecuteUbergraph_prop_hose) == 0x000010, "Wrong alignment on Prop_hose_C_ExecuteUbergraph_prop_hose");
static_assert(sizeof(Prop_hose_C_ExecuteUbergraph_prop_hose) == 0x000150, "Wrong size on Prop_hose_C_ExecuteUbergraph_prop_hose");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, EntryPoint) == 0x000000, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, K2Node_Event_player) == 0x000008, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_bBlockingHit) == 0x000011, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_bInitialOverlap) == 0x000012, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_Time) == 0x000014, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_Distance) == 0x000018, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_Location) == 0x00001C, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_ImpactPoint) == 0x000028, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_Normal) == 0x000034, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_ImpactNormal) == 0x000040, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_PhysMat) == 0x000050, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_HitActor) == 0x000058, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_HitComponent) == 0x000060, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_HitBoneName) == 0x000068, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_HitItem) == 0x000070, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_ElementIndex) == 0x000074, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_FaceIndex) == 0x000078, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_TraceStart) == 0x00007C, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BreakHitResult_TraceEnd) == 0x000088, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, K2Node_DynamicCast_AsProp_Sprinkler) == 0x000098, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::K2Node_DynamicCast_AsProp_Sprinkler' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, K2Node_DynamicCast_AsFaucet) == 0x0000A8, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::K2Node_DynamicCast_AsFaucet' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_IsValid_ReturnValue_2) == 0x0000B1, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_IsValid_ReturnValue_3) == 0x0000B2, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_GetForwardVector_ReturnValue) == 0x0000B4, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C0, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000CC, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000110, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_FinishSpawningActor_ReturnValue) == 0x000138, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_ExecuteUbergraph_prop_hose, CallFunc_connectHose_return) == 0x000140, "Member 'Prop_hose_C_ExecuteUbergraph_prop_hose::CallFunc_connectHose_return' has a wrong offset!");

// Function prop_hose.prop_hose_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_hose_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_hose_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_hose_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_hose_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_hose_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_hose_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_hose_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function prop_hose.prop_hose_C.loadData
// 0x00D0 (0x00D0 - 0x0000)
struct Prop_hose_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_hose_C_LoadData) == 0x000010, "Wrong alignment on Prop_hose_C_LoadData");
static_assert(sizeof(Prop_hose_C_LoadData) == 0x0000D0, "Wrong size on Prop_hose_C_LoadData");
static_assert(offsetof(Prop_hose_C_LoadData, Data) == 0x000000, "Member 'Prop_hose_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_LoadData, Return) == 0x0000C0, "Member 'Prop_hose_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_hose_C_LoadData::CallFunc_loadData_return' has a wrong offset!");

// Function prop_hose.prop_hose_C.getData
// 0x0180 (0x0180 - 0x0000)
struct Prop_hose_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_hose_C_GetData) == 0x000010, "Wrong alignment on Prop_hose_C_GetData");
static_assert(sizeof(Prop_hose_C_GetData) == 0x000180, "Wrong size on Prop_hose_C_GetData");
static_assert(offsetof(Prop_hose_C_GetData, Data) == 0x000000, "Member 'Prop_hose_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_hose_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_hose_C_GetData::CallFunc_getData_data' has a wrong offset!");

}

