#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_waterShooter_arir

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_waterShooter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_waterShooter_arir.prop_waterShooter_arir_C
// 0x0040 (0x03D0 - 0x0390)
class AProp_waterShooter_arir_C final : public AProp_waterShooter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_waterShooter_arir_C;           // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Eff_succ2;                                         // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_succ1;                                         // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Sndtimeline_a_A64D305B4C44710E46910489FD09ED3F;    // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Sndtimeline__Direction_A64D305B4C44710E46910489FD09ED3F; // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Sndtimeline;                                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Snd;                                               // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_waterShooter_arir(int32 EntryPoint);
	void Sound();
	void ReceiveTick(float DeltaSeconds);
	void Sndtimeline__UpdateFunc();
	void Sndtimeline__FinishedFunc();
	void PlayerHandUse_RMB(class AMainPlayer_C* Player_0);
	void PlayerHandUse_LMB(class AMainPlayer_C* Player_0);
	void PlayerHandRelease_LMB(class AMainPlayer_C* Player_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_waterShooter_arir_C">();
	}
	static class AProp_waterShooter_arir_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_waterShooter_arir_C>();
	}
};
static_assert(alignof(AProp_waterShooter_arir_C) == 0x000008, "Wrong alignment on AProp_waterShooter_arir_C");
static_assert(sizeof(AProp_waterShooter_arir_C) == 0x0003D0, "Wrong size on AProp_waterShooter_arir_C");
static_assert(offsetof(AProp_waterShooter_arir_C, UberGraphFrame_Prop_waterShooter_arir_C) == 0x000390, "Member 'AProp_waterShooter_arir_C::UberGraphFrame_Prop_waterShooter_arir_C' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, Eff_succ2) == 0x000398, "Member 'AProp_waterShooter_arir_C::Eff_succ2' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, Eff_succ1) == 0x0003A0, "Member 'AProp_waterShooter_arir_C::Eff_succ1' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, PointLight) == 0x0003A8, "Member 'AProp_waterShooter_arir_C::PointLight' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, Audio) == 0x0003B0, "Member 'AProp_waterShooter_arir_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, Sndtimeline_a_A64D305B4C44710E46910489FD09ED3F) == 0x0003B8, "Member 'AProp_waterShooter_arir_C::Sndtimeline_a_A64D305B4C44710E46910489FD09ED3F' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, Sndtimeline__Direction_A64D305B4C44710E46910489FD09ED3F) == 0x0003BC, "Member 'AProp_waterShooter_arir_C::Sndtimeline__Direction_A64D305B4C44710E46910489FD09ED3F' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, Sndtimeline) == 0x0003C0, "Member 'AProp_waterShooter_arir_C::Sndtimeline' has a wrong offset!");
static_assert(offsetof(AProp_waterShooter_arir_C, Snd) == 0x0003C8, "Member 'AProp_waterShooter_arir_C::Snd' has a wrong offset!");

}

