#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_radCrystal_quartz

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_food_structs.hpp"
#include "Struct_prop3_structs.hpp"


namespace SDK::Params
{

// Function prop_radCrystal_quartz.prop_radCrystal_quartz_C.ExecuteUbergraph_prop_radCrystal_quartz
// 0x02D0 (0x02D0 - 0x0000)
struct Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food                           CallFunc_propToObject_foodData;                    // 0x002C(0x001C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop3                          CallFunc_propToObject_fuckYouRetard;               // 0x0058(0x0080)(HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x00E4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz) == 0x000010, "Wrong alignment on Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz");
static_assert(sizeof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz) == 0x0002D0, "Wrong size on Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, EntryPoint) == 0x000000, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_int_Variable) == 0x000004, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_int_Variable_1) == 0x000010, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_int_Variable_2) == 0x00001C, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000020, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_propToObject_ReturnValue) == 0x000028, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_propToObject_foodData) == 0x00002C, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_propToObject_object) == 0x000048, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_propToObject_isFood) == 0x000050, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_propToObject_fuckYouRetard) == 0x000058, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_propToObject_fuckYouRetard' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_name_Variable) == 0x0000D8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_IsValidClass_ReturnValue) == 0x0000E0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_name_Variable_1) == 0x0000E4, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_int_Variable_3) == 0x0000EC, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_int_Variable_4) == 0x0000F0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000F4, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, Temp_int_Variable_5) == 0x0000FC, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000100, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, K2Node_Event_player) == 0x000108, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, K2Node_Event_hit) == 0x000110, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, K2Node_Event_damage) == 0x000198, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_bBlockingHit) == 0x00019C, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_bInitialOverlap) == 0x00019D, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_Time) == 0x0001A0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_Distance) == 0x0001A4, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_Location) == 0x0001A8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B4, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_Normal) == 0x0001C0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_ImpactNormal) == 0x0001CC, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_PhysMat) == 0x0001D8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_HitActor) == 0x0001E0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_HitComponent) == 0x0001E8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_ElementIndex) == 0x0001FC, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_FaceIndex) == 0x000200, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_TraceStart) == 0x000204, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BreakHitResult_TraceEnd) == 0x000210, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000250, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000258, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_FinishSpawningActor_ReturnValue) == 0x000260, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000268, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, K2Node_DynamicCast_AsInt_Player) == 0x000270, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_asProp_return) == 0x000288, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000290, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_Conv_NameToString_ReturnValue) == 0x000298, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0002A8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002B0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0002B8, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0002C0, "Member 'Prop_radCrystal_quartz_C_ExecuteUbergraph_prop_radCrystal_quartz::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");

// Function prop_radCrystal_quartz.prop_radCrystal_quartz_C.damageByPlayer
// 0x0098 (0x0098 - 0x0000)
struct Prop_radCrystal_quartz_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit_0;                                             // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Damage;                                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_radCrystal_quartz_C_DamageByPlayer) == 0x000008, "Wrong alignment on Prop_radCrystal_quartz_C_DamageByPlayer");
static_assert(sizeof(Prop_radCrystal_quartz_C_DamageByPlayer) == 0x000098, "Wrong size on Prop_radCrystal_quartz_C_DamageByPlayer");
static_assert(offsetof(Prop_radCrystal_quartz_C_DamageByPlayer, Player) == 0x000000, "Member 'Prop_radCrystal_quartz_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_DamageByPlayer, Hit_0) == 0x000008, "Member 'Prop_radCrystal_quartz_C_DamageByPlayer::Hit_0' has a wrong offset!");
static_assert(offsetof(Prop_radCrystal_quartz_C_DamageByPlayer, Damage) == 0x000090, "Member 'Prop_radCrystal_quartz_C_DamageByPlayer::Damage' has a wrong offset!");

}

