#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_arirGamerYogur

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_arirGamerYogur.prop_arirGamerYogur_C
// 0x0010 (0x0368 - 0x0358)
class AProp_arirGamerYogur_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_arirGamerYogur_C;              // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Open;                                              // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Cap;                                               // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362[0x2];                                      // 0x0362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Uses;                                              // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_arirGamerYogur(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit_0, Enum_interactionActions Action);
	void Set();
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_arirGamerYogur_C">();
	}
	static class AProp_arirGamerYogur_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_arirGamerYogur_C>();
	}
};
static_assert(alignof(AProp_arirGamerYogur_C) == 0x000008, "Wrong alignment on AProp_arirGamerYogur_C");
static_assert(sizeof(AProp_arirGamerYogur_C) == 0x000368, "Wrong size on AProp_arirGamerYogur_C");
static_assert(offsetof(AProp_arirGamerYogur_C, UberGraphFrame_Prop_arirGamerYogur_C) == 0x000358, "Member 'AProp_arirGamerYogur_C::UberGraphFrame_Prop_arirGamerYogur_C' has a wrong offset!");
static_assert(offsetof(AProp_arirGamerYogur_C, Open) == 0x000360, "Member 'AProp_arirGamerYogur_C::Open' has a wrong offset!");
static_assert(offsetof(AProp_arirGamerYogur_C, Cap) == 0x000361, "Member 'AProp_arirGamerYogur_C::Cap' has a wrong offset!");
static_assert(offsetof(AProp_arirGamerYogur_C, Uses) == 0x000364, "Member 'AProp_arirGamerYogur_C::Uses' has a wrong offset!");

}

