#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_broom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_broom.prop_broom_C
// 0x0018 (0x0370 - 0x0358)
class AProp_broom_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_broom_C;                       // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMainPlayer_C*                          Player;                                            // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Force;                                             // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_broom(int32 EntryPoint);
	void OnCompleted_6E812E554132A6D770F1F3A21FF9EAC0(class FName NotifyName);
	void OnBlendOut_6E812E554132A6D770F1F3A21FF9EAC0(class FName NotifyName);
	void OnInterrupted_6E812E554132A6D770F1F3A21FF9EAC0(class FName NotifyName);
	void OnNotifyBegin_6E812E554132A6D770F1F3A21FF9EAC0(class FName NotifyName);
	void OnNotifyEnd_6E812E554132A6D770F1F3A21FF9EAC0(class FName NotifyName);
	void OnCompleted_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnBlendOut_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnInterrupted_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnNotifyBegin_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnNotifyEnd_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player_0);
	void PlayerHandRelease_RMB(class AMainPlayer_C* Player_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_broom_C">();
	}
	static class AProp_broom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_broom_C>();
	}
};
static_assert(alignof(AProp_broom_C) == 0x000008, "Wrong alignment on AProp_broom_C");
static_assert(sizeof(AProp_broom_C) == 0x000370, "Wrong size on AProp_broom_C");
static_assert(offsetof(AProp_broom_C, UberGraphFrame_Prop_broom_C) == 0x000358, "Member 'AProp_broom_C::UberGraphFrame_Prop_broom_C' has a wrong offset!");
static_assert(offsetof(AProp_broom_C, Player) == 0x000360, "Member 'AProp_broom_C::Player' has a wrong offset!");
static_assert(offsetof(AProp_broom_C, Force) == 0x000368, "Member 'AProp_broom_C::Force' has a wrong offset!");
static_assert(offsetof(AProp_broom_C, Speed) == 0x00036C, "Member 'AProp_broom_C::Speed' has a wrong offset!");

}

