#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadiotowerPoof

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function radiotowerPoof.radiotowerPoof_C.ExecuteUbergraph_radiotowerPoof
// 0x0050 (0x0050 - 0x0000)
struct RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof) == 0x000008, "Wrong alignment on RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof");
static_assert(sizeof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof) == 0x000050, "Wrong size on RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, EntryPoint) == 0x000000, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::EntryPoint' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000030, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000038, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000040, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_WasRecentlyRendered_ReturnValue_1) == 0x000041, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_WasRecentlyRendered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000048, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

}

