#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rockcandle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass rockcandle.rockcandle_C
// 0x0020 (0x0270 - 0x0250)
class ARockcandle_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Rockcandle_C;                       // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void AttemptIgnite();
	void ExecuteUbergraph_rockcandle(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"rockcandle_C">();
	}
	static class ARockcandle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockcandle_C>();
	}
};
static_assert(alignof(ARockcandle_C) == 0x000008, "Wrong alignment on ARockcandle_C");
static_assert(sizeof(ARockcandle_C) == 0x000270, "Wrong size on ARockcandle_C");
static_assert(offsetof(ARockcandle_C, UberGraphFrame_Rockcandle_C) == 0x000250, "Member 'ARockcandle_C::UberGraphFrame_Rockcandle_C' has a wrong offset!");
static_assert(offsetof(ARockcandle_C, PointLight) == 0x000258, "Member 'ARockcandle_C::PointLight' has a wrong offset!");
static_assert(offsetof(ARockcandle_C, Flame) == 0x000260, "Member 'ARockcandle_C::Flame' has a wrong offset!");
static_assert(offsetof(ARockcandle_C, StaticMesh) == 0x000268, "Member 'ARockcandle_C::StaticMesh' has a wrong offset!");

}

