#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkyUfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function skyUfo.skyUfo_C.ExecuteUbergraph_skyUfo
// 0x0440 (0x0440 - 0x0000)
struct SkyUfo_C_ExecuteUbergraph_skyUfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_2;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_3;         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue_1;       // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0138(0x0010)(ReferenceParm)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0164(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x02C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x2];                                      // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x03B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkyUfo_C_ExecuteUbergraph_skyUfo) == 0x000008, "Wrong alignment on SkyUfo_C_ExecuteUbergraph_skyUfo");
static_assert(sizeof(SkyUfo_C_ExecuteUbergraph_skyUfo) == 0x000440, "Wrong size on SkyUfo_C_ExecuteUbergraph_skyUfo");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, EntryPoint) == 0x000000, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, K2Node_MakeArray_Array) == 0x000008, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_GetForwardVector_ReturnValue) == 0x00002C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000044, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Normal_ReturnValue) == 0x00005C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue) == 0x000068, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000074, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue_2) == 0x000080, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue_3) == 0x00008C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000098, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeRotationFromAxes_ReturnValue_1) == 0x0000A4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeRotationFromAxes_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000B0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_VSize_ReturnValue) == 0x0000BC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Normal_ReturnValue_1) == 0x0000C0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000CC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000D0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeVector_ReturnValue) == 0x0000D4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_GetForwardVector_ReturnValue_1) == 0x0000E0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000EC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0000F8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Normal_ReturnValue_2) == 0x000104, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000110, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Dot_VectorVector_ReturnValue) == 0x000114, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeVector_ReturnValue_1) == 0x000118, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_FMax_ReturnValue) == 0x000124, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000134, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_obj_static_obj) == 0x000138, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Lerp_ReturnValue) == 0x000148, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00014C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000158, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000164, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0001EC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector2D_X) == 0x0001F0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector2D_Y) == 0x0001F4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_bBlockingHit) == 0x0001F8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001F9, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Time) == 0x0001FC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Distance) == 0x000200, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Location) == 0x000204, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_ImpactPoint) == 0x000210, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Normal) == 0x00021C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_ImpactNormal) == 0x000228, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_PhysMat) == 0x000238, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitActor) == 0x000240, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitComponent) == 0x000248, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitBoneName) == 0x000250, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitItem) == 0x000258, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_ElementIndex) == 0x00025C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_FaceIndex) == 0x000260, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_TraceStart) == 0x000264, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_TraceEnd) == 0x000270, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00027C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000288, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Add_VectorVector_ReturnValue_2) == 0x00028C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SelectVector_ReturnValue) == 0x000298, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector_X) == 0x0002A4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector_Y) == 0x0002A8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector_Z) == 0x0002AC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_FClamp_ReturnValue) == 0x0002B0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeVector_ReturnValue_2) == 0x0002B4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0002C0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000348, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000349, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00034C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000358, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00035C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Vector_Distance_ReturnValue) == 0x000368, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00036C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000370, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_FClamp_ReturnValue_1) == 0x00037C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000380, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RLerp_ReturnValue) == 0x000388, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000394, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SelectRotator_ReturnValue) == 0x0003A0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Vector_Distance_ReturnValue_1) == 0x0003AC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0003B0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000438, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BooleanOR_ReturnValue) == 0x000439, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00043A, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function skyUfo.skyUfo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SkyUfo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkyUfo_C_ReceiveTick) == 0x000004, "Wrong alignment on SkyUfo_C_ReceiveTick");
static_assert(sizeof(SkyUfo_C_ReceiveTick) == 0x000004, "Wrong size on SkyUfo_C_ReceiveTick");
static_assert(offsetof(SkyUfo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SkyUfo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

