#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spawnlist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass spawnlist.spawnlist_C
// 0x0038 (0x0298 - 0x0260)
class USpawnlist_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                DeleteButton;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_293;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_446;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RemoveID;                                          // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddSpawnButtons();
	void BndEvt__spawnlist_DeleteButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_spawnlist(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"spawnlist_C">();
	}
	static class USpawnlist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnlist_C>();
	}
};
static_assert(alignof(USpawnlist_C) == 0x000008, "Wrong alignment on USpawnlist_C");
static_assert(sizeof(USpawnlist_C) == 0x000298, "Wrong size on USpawnlist_C");
static_assert(offsetof(USpawnlist_C, UberGraphFrame) == 0x000260, "Member 'USpawnlist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpawnlist_C, DeleteButton) == 0x000268, "Member 'USpawnlist_C::DeleteButton' has a wrong offset!");
static_assert(offsetof(USpawnlist_C, Image) == 0x000270, "Member 'USpawnlist_C::Image' has a wrong offset!");
static_assert(offsetof(USpawnlist_C, Image_0) == 0x000278, "Member 'USpawnlist_C::Image_0' has a wrong offset!");
static_assert(offsetof(USpawnlist_C, Image_293) == 0x000280, "Member 'USpawnlist_C::Image_293' has a wrong offset!");
static_assert(offsetof(USpawnlist_C, ScrollBox_446) == 0x000288, "Member 'USpawnlist_C::ScrollBox_446' has a wrong offset!");
static_assert(offsetof(USpawnlist_C, RemoveID) == 0x000290, "Member 'USpawnlist_C::RemoveID' has a wrong offset!");

}

