#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spawnlist_item

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function spawnlist_item.spawnlist_item_C.ExecuteUbergraph_spawnlist_item
// 0x0080 (0x0080 - 0x0000)
struct Spawnlist_item_C_ExecuteUbergraph_spawnlist_item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item) == 0x000010, "Wrong alignment on Spawnlist_item_C_ExecuteUbergraph_spawnlist_item");
static_assert(sizeof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item) == 0x000080, "Wrong size on Spawnlist_item_C_ExecuteUbergraph_spawnlist_item");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, EntryPoint) == 0x000000, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_GetActorForwardVector_ReturnValue) == 0x00001C, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_Add_VectorVector_ReturnValue) == 0x000034, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000040, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spawnlist_item_C_ExecuteUbergraph_spawnlist_item, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Spawnlist_item_C_ExecuteUbergraph_spawnlist_item::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

