#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spawnlist_item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass spawnlist_item.spawnlist_item_C
// 0x0058 (0x02B8 - 0x0260)
class USpawnlist_item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_43;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_314;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_293;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemThumbnail;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModDescription;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModIDSource;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModName;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ActorToSpawn;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ToolTipReference;                                  // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                VoidModController;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_43_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_spawnlist_item(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"spawnlist_item_C">();
	}
	static class USpawnlist_item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnlist_item_C>();
	}
};
static_assert(alignof(USpawnlist_item_C) == 0x000008, "Wrong alignment on USpawnlist_item_C");
static_assert(sizeof(USpawnlist_item_C) == 0x0002B8, "Wrong size on USpawnlist_item_C");
static_assert(offsetof(USpawnlist_item_C, UberGraphFrame) == 0x000260, "Member 'USpawnlist_item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, Button_43) == 0x000268, "Member 'USpawnlist_item_C::Button_43' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, CanvasPanel_314) == 0x000270, "Member 'USpawnlist_item_C::CanvasPanel_314' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, Image_293) == 0x000278, "Member 'USpawnlist_item_C::Image_293' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, ItemThumbnail) == 0x000280, "Member 'USpawnlist_item_C::ItemThumbnail' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, ModDescription) == 0x000288, "Member 'USpawnlist_item_C::ModDescription' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, ModIDSource) == 0x000290, "Member 'USpawnlist_item_C::ModIDSource' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, ModName) == 0x000298, "Member 'USpawnlist_item_C::ModName' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, ActorToSpawn) == 0x0002A0, "Member 'USpawnlist_item_C::ActorToSpawn' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, ToolTipReference) == 0x0002A8, "Member 'USpawnlist_item_C::ToolTipReference' has a wrong offset!");
static_assert(offsetof(USpawnlist_item_C, VoidModController) == 0x0002B0, "Member 'USpawnlist_item_C::VoidModController' has a wrong offset!");

}

