#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_yellowWispSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ticker_yellowWispSpawner.ticker_yellowWispSpawner_C.ExecuteUbergraph_ticker_yellowWispSpawner
// 0x02B0 (0x02B0 - 0x0000)
struct Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AKillerwisp_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0100(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x011C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner) == 0x000010, "Wrong alignment on Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner");
static_assert(sizeof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner) == 0x0002B0, "Wrong size on Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, EntryPoint) == 0x000000, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, Temp_object_Variable) == 0x000008, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001D, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00001E, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BooleanAND_ReturnValue) == 0x00001F, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000020, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BooleanAND_ReturnValue_1) == 0x000029, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000090, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, K2Node_Event_DeltaSeconds) == 0x00009C, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_getMainGameInstance_AsGame_Inst) == 0x0000A0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000A8, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000AC, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_MakeVector_ReturnValue) == 0x0000B4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000C4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BooleanOR_ReturnValue_1) == 0x0000D0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x0000D4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x0000E0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000E1, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x0000E2, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BooleanOR_ReturnValue_2) == 0x0000E3, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BooleanAND_ReturnValue_2) == 0x0000E4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_RandomRotator_ReturnValue) == 0x0000E8, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_RandomUnitVector_ReturnValue) == 0x0000F4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_obj_static_obj) == 0x000100, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000110, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_LineTraceSingleForObjects_OutHit) == 0x00011C, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001A4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001A8, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001B5, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_Time) == 0x0001B8, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_Distance) == 0x0001BC, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_Location) == 0x0001C0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_ImpactPoint) == 0x0001CC, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_Normal) == 0x0001D8, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_PhysMat) == 0x0001F0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_HitActor) == 0x0001F8, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_HitComponent) == 0x000200, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_HitBoneName) == 0x000208, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_HitItem) == 0x000210, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_ElementIndex) == 0x000214, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_FaceIndex) == 0x000218, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_TraceStart) == 0x00021C, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BreakHitResult_TraceEnd) == 0x000228, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_MakeTransform_ReturnValue_1) == 0x000240, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Array_Contains_ReturnValue) == 0x000270, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Array_Get_Item) == 0x000278, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BooleanAND_ReturnValue_3) == 0x000280, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000288, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000290, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Array_Length_ReturnValue) == 0x000298, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Less_IntInt_ReturnValue) == 0x00029C, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0002A0, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Array_Length_ReturnValue_1) == 0x0002A4, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002A8, "Member 'Ticker_yellowWispSpawner_C_ExecuteUbergraph_ticker_yellowWispSpawner::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function ticker_yellowWispSpawner.ticker_yellowWispSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_yellowWispSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_yellowWispSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_yellowWispSpawner_C_ReceiveTick");
static_assert(sizeof(Ticker_yellowWispSpawner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_yellowWispSpawner_C_ReceiveTick");
static_assert(offsetof(Ticker_yellowWispSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_yellowWispSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

