#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ufo_pillfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ufo_pillfo.ufo_pillfo_C.ExecuteUbergraph_ufo_pillfo
// 0x02F8 (0x02F8 - 0x0000)
struct Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddWorldRotation_SweepHitResult;       // 0x0230(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo) == 0x000008, "Wrong alignment on Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo");
static_assert(sizeof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo) == 0x0002F8, "Wrong size on Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, EntryPoint) == 0x000000, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Ease_ReturnValue) == 0x000004, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Ease_ReturnValue_1) == 0x00000C, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Ease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000014, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Lerp_ReturnValue_2) == 0x000018, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_VLerp_ReturnValue) == 0x00001C, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Lerp_ReturnValue_3) == 0x000028, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_RotateAngleAxis_ReturnValue) == 0x000030, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00003C, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_MakeRotator_ReturnValue) == 0x000044, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000050, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000054, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000DC, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_VLerp_ReturnValue_1) == 0x0000E0, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000EC, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Add_VectorVector_ReturnValue) == 0x000174, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000180, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_VLerp_ReturnValue_2) == 0x00018C, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000198, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000220, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_MakeRotator_ReturnValue_1) == 0x000224, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_K2_AddWorldRotation_SweepHitResult) == 0x000230, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_K2_AddWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0002B8, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0002C0, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002C8, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002D0, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002D8, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002E4, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0002F0, "Member 'Ufo_pillfo_C_ExecuteUbergraph_ufo_pillfo::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function ufo_pillfo.ufo_pillfo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ufo_pillfo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ufo_pillfo_C_ReceiveTick) == 0x000004, "Wrong alignment on Ufo_pillfo_C_ReceiveTick");
static_assert(sizeof(Ufo_pillfo_C_ReceiveTick) == 0x000004, "Wrong size on Ufo_pillfo_C_ReceiveTick");
static_assert(offsetof(Ufo_pillfo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ufo_pillfo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

