#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ufo_joel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ufo_joel.ufo_joel_C.ExecuteUbergraph_ufo_joel
// 0x0320 (0x0320 - 0x0000)
struct Ufo_joel_C_ExecuteUbergraph_ufo_joel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0008(0x0010)(NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddWorldRotation_SweepHitResult;       // 0x00CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x019C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_6;    // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x028C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ufo_joel_C_ExecuteUbergraph_ufo_joel) == 0x000008, "Wrong alignment on Ufo_joel_C_ExecuteUbergraph_ufo_joel");
static_assert(sizeof(Ufo_joel_C_ExecuteUbergraph_ufo_joel) == 0x000320, "Wrong size on Ufo_joel_C_ExecuteUbergraph_ufo_joel");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, EntryPoint) == 0x000000, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Ease_ReturnValue) == 0x000004, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, K2Node_MakeStruct_WeightedBlendable) == 0x000008, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00001C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_MakeRotator_ReturnValue) == 0x000024, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000030, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000034, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000BC, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_MakeRotator_ReturnValue_1) == 0x0000C0, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_AddWorldRotation_SweepHitResult) == 0x0000CC, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_AddWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000154, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000160, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x00016C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_VLerp_ReturnValue) == 0x000178, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_VLerp_ReturnValue_1) == 0x000184, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_SelectVector_ReturnValue) == 0x000190, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00019C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000228, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000230, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x00023C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Vector_Distance_ReturnValue) == 0x000248, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x00024C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_GetComponentLocation_ReturnValue_6) == 0x000258, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_GetComponentLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Vector_Distance_ReturnValue_1) == 0x000264, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000268, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00026C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000270, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Ease_ReturnValue_1) == 0x000274, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Ease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_MapRangeClamped_ReturnValue) == 0x000278, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_VLerp_ReturnValue_2) == 0x00027C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_FClamp_ReturnValue) == 0x000288, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00028C, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Lerp_ReturnValue) == 0x000314, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ufo_joel_C_ExecuteUbergraph_ufo_joel, CallFunc_Lerp_ReturnValue_1) == 0x000318, "Member 'Ufo_joel_C_ExecuteUbergraph_ufo_joel::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");

// Function ufo_joel.ufo_joel_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ufo_joel_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ufo_joel_C_ReceiveTick) == 0x000004, "Wrong alignment on Ufo_joel_C_ReceiveTick");
static_assert(sizeof(Ufo_joel_C_ReceiveTick) == 0x000004, "Wrong size on Ufo_joel_C_ReceiveTick");
static_assert(offsetof(Ufo_joel_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ufo_joel_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

