#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ufo_pillfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ufo_pillfo.ufo_pillfo_C
// 0x0070 (0x0290 - 0x0220)
class AUfo_pillfo_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Eff_pillfoGlow;                                    // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PillfoLoop;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Center;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Point_B;                                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Point_A;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   UFO;                                               // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_a_F87DD6C54CB7B74CC01729B05B0C8967;     // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_F87DD6C54CB7B74CC01729B05B0C8967; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_4003EC194C59F5498CC22B8A29235EE9;              // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_4003EC194C59F5498CC22B8A29235EE9;     // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         R;                                                 // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ufo_pillfo(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Play();
	void ReceiveTick(float DeltaSeconds);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void A__UpdateFunc();
	void A__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ufo_pillfo_C">();
	}
	static class AUfo_pillfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUfo_pillfo_C>();
	}
};
static_assert(alignof(AUfo_pillfo_C) == 0x000008, "Wrong alignment on AUfo_pillfo_C");
static_assert(sizeof(AUfo_pillfo_C) == 0x000290, "Wrong size on AUfo_pillfo_C");
static_assert(offsetof(AUfo_pillfo_C, UberGraphFrame) == 0x000220, "Member 'AUfo_pillfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Eff_pillfoGlow) == 0x000228, "Member 'AUfo_pillfo_C::Eff_pillfoGlow' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, PillfoLoop) == 0x000230, "Member 'AUfo_pillfo_C::PillfoLoop' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Center) == 0x000238, "Member 'AUfo_pillfo_C::Center' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, PointLight) == 0x000240, "Member 'AUfo_pillfo_C::PointLight' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Point_B) == 0x000248, "Member 'AUfo_pillfo_C::Point_B' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Point_A) == 0x000250, "Member 'AUfo_pillfo_C::Point_A' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, UFO) == 0x000258, "Member 'AUfo_pillfo_C::UFO' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, DefaultSceneRoot) == 0x000260, "Member 'AUfo_pillfo_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Timeline_0_a_F87DD6C54CB7B74CC01729B05B0C8967) == 0x000268, "Member 'AUfo_pillfo_C::Timeline_0_a_F87DD6C54CB7B74CC01729B05B0C8967' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Timeline_0__Direction_F87DD6C54CB7B74CC01729B05B0C8967) == 0x00026C, "Member 'AUfo_pillfo_C::Timeline_0__Direction_F87DD6C54CB7B74CC01729B05B0C8967' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Timeline_0) == 0x000270, "Member 'AUfo_pillfo_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, A_a_4003EC194C59F5498CC22B8A29235EE9) == 0x000278, "Member 'AUfo_pillfo_C::A_a_4003EC194C59F5498CC22B8A29235EE9' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, A__Direction_4003EC194C59F5498CC22B8A29235EE9) == 0x00027C, "Member 'AUfo_pillfo_C::A__Direction_4003EC194C59F5498CC22B8A29235EE9' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, A) == 0x000280, "Member 'AUfo_pillfo_C::A' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, R) == 0x000288, "Member 'AUfo_pillfo_C::R' has a wrong offset!");
static_assert(offsetof(AUfo_pillfo_C, Debug) == 0x00028C, "Member 'AUfo_pillfo_C::Debug' has a wrong offset!");

}

