#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ufo_ballfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ufo_ballfo.ufo_ballfo_C
// 0x0078 (0x0298 - 0x0220)
class AUfo_ballfo_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   b3;                                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   b1;                                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   b2;                                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Lift;                                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    balls;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_light3;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_light2;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_light1;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    A;                                                 // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    B;                                                 // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Center;                                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ufo_ballfo(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void Set();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ufo_ballfo_C">();
	}
	static class AUfo_ballfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUfo_ballfo_C>();
	}
};
static_assert(alignof(AUfo_ballfo_C) == 0x000008, "Wrong alignment on AUfo_ballfo_C");
static_assert(sizeof(AUfo_ballfo_C) == 0x000298, "Wrong size on AUfo_ballfo_C");
static_assert(offsetof(AUfo_ballfo_C, UberGraphFrame) == 0x000220, "Member 'AUfo_ballfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, b3) == 0x000228, "Member 'AUfo_ballfo_C::b3' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, b1) == 0x000230, "Member 'AUfo_ballfo_C::b1' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, b2) == 0x000238, "Member 'AUfo_ballfo_C::b2' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Lift) == 0x000240, "Member 'AUfo_ballfo_C::Lift' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, balls) == 0x000248, "Member 'AUfo_ballfo_C::balls' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Eff_light3) == 0x000250, "Member 'AUfo_ballfo_C::Eff_light3' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Eff_light2) == 0x000258, "Member 'AUfo_ballfo_C::Eff_light2' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Eff_light1) == 0x000260, "Member 'AUfo_ballfo_C::Eff_light1' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, A) == 0x000268, "Member 'AUfo_ballfo_C::A' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, B) == 0x000270, "Member 'AUfo_ballfo_C::B' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Center) == 0x000278, "Member 'AUfo_ballfo_C::Center' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, DefaultSceneRoot) == 0x000280, "Member 'AUfo_ballfo_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Size) == 0x000288, "Member 'AUfo_ballfo_C::Size' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Speed) == 0x00028C, "Member 'AUfo_ballfo_C::Speed' has a wrong offset!");
static_assert(offsetof(AUfo_ballfo_C, Debug) == 0x000290, "Member 'AUfo_ballfo_C::Debug' has a wrong offset!");

}

