#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UfoAbducter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ufoAbducter.ufoAbducter_C.ExecuteUbergraph_ufoAbducter
// 0x0260 (0x0260 - 0x0000)
struct UfoAbducter_C_ExecuteUbergraph_ufoAbducter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AKerfurOmega_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKerfurOmega_C*                         CallFunc_Array_Random_OutItem;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AKerfurOmega_C*                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALampPost_C*                            CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACeilingLamp_C*                         CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue_1;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0148(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter) == 0x000008, "Wrong alignment on UfoAbducter_C_ExecuteUbergraph_ufoAbducter");
static_assert(sizeof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter) == 0x000260, "Wrong size on UfoAbducter_C_ExecuteUbergraph_ufoAbducter");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, EntryPoint) == 0x000000, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, Temp_int_Variable) == 0x000004, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000008, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, Temp_int_Variable_1) == 0x000010, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000048, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Array_Random_OutItem) == 0x000050, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Array_Random_OutIndex) == 0x000058, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000060, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000078, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Array_Get_Item) == 0x000088, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A1, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, Temp_bool_Has_Been_Initd_Variable) == 0x0000A2, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A4, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000B0, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000BC, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_VLerp_ReturnValue) == 0x0000C8, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000D8, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, K2Node_DynamicCast_AsPrimitive_Component) == 0x0000E0, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_MakeVector_ReturnValue) == 0x0000EC, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F8, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000104, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000110, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00011C, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000128, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x00012C, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_VInterpTo_ReturnValue) == 0x000130, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_VInterpTo_ReturnValue_1) == 0x00013C, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_VInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000148, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001D0, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(UfoAbducter_C_ExecuteUbergraph_ufoAbducter, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000258, "Member 'UfoAbducter_C_ExecuteUbergraph_ufoAbducter::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function ufoAbducter.ufoAbducter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct UfoAbducter_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UfoAbducter_C_ReceiveTick) == 0x000004, "Wrong alignment on UfoAbducter_C_ReceiveTick");
static_assert(sizeof(UfoAbducter_C_ReceiveTick) == 0x000004, "Wrong size on UfoAbducter_C_ReceiveTick");
static_assert(offsetof(UfoAbducter_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'UfoAbducter_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

