#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_disclaimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_disclaimer.umg_disclaimer_C
// 0x0050 (0x02B0 - 0x0260)
class UUmg_disclaimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_82;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_play;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_play_1;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Foreground;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_105;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_136;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         A;                                                 // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoTIck;                                            // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Dir;                                               // 0x02AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Clc;                                               // 0x02AE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void BndEvt__umg_disclaimer_button_play_1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_disclaimer_button_play_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__umg_disclaimer_Button_82_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_umg_disclaimer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_disclaimer_C">();
	}
	static class UUmg_disclaimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_disclaimer_C>();
	}
};
static_assert(alignof(UUmg_disclaimer_C) == 0x000008, "Wrong alignment on UUmg_disclaimer_C");
static_assert(sizeof(UUmg_disclaimer_C) == 0x0002B0, "Wrong size on UUmg_disclaimer_C");
static_assert(offsetof(UUmg_disclaimer_C, UberGraphFrame) == 0x000260, "Member 'UUmg_disclaimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, Button_82) == 0x000268, "Member 'UUmg_disclaimer_C::Button_82' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, button_play) == 0x000270, "Member 'UUmg_disclaimer_C::button_play' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, button_play_1) == 0x000278, "Member 'UUmg_disclaimer_C::button_play_1' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, Foreground) == 0x000280, "Member 'UUmg_disclaimer_C::Foreground' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, Image_0) == 0x000288, "Member 'UUmg_disclaimer_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, Image_1) == 0x000290, "Member 'UUmg_disclaimer_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, Image_105) == 0x000298, "Member 'UUmg_disclaimer_C::Image_105' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, RetainerBox_136) == 0x0002A0, "Member 'UUmg_disclaimer_C::RetainerBox_136' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, A) == 0x0002A8, "Member 'UUmg_disclaimer_C::A' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, DoTIck) == 0x0002AC, "Member 'UUmg_disclaimer_C::DoTIck' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, Dir) == 0x0002AD, "Member 'UUmg_disclaimer_C::Dir' has a wrong offset!");
static_assert(offsetof(UUmg_disclaimer_C, Clc) == 0x0002AE, "Member 'UUmg_disclaimer_C::Clc' has a wrong offset!");

}

