#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_radarScreen

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function umg_radarScreen.umg_radarScreen_C.ExecuteUbergraph_umg_radarScreen
// 0x0510 (0x0510 - 0x0000)
struct Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0020(0x0100)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0120(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x013C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active_calc;                    // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_downl;                   // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_coords;                  // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_play;                    // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_light;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Active_calc, bool Active_downl, bool Active_coords, bool Active_play, bool Active_light)> K2Node_CreateDelegate_OutputDelegate;              // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_radarPoint_C*                      CallFunc_Create_ReturnValue;                       // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0218(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0230(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0248(0x0018)()
	class FString                                 K2Node_Select_Default;                             // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0290(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URichTextBlock*>                 K2Node_MakeArray_Array;                            // 0x0330(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URichTextBlock*                         CallFunc_Array_Get_Item_1;                         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger;                 // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_1;               // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UComp_radarPoint_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_422[0x2];                                      // 0x0422(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue;                     // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0454(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0473(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0480(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0498(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen) == 0x000008, "Wrong alignment on Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen");
static_assert(sizeof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen) == 0x000510, "Wrong size on Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, EntryPoint) == 0x000000, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Variable) == 0x000004, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_IntInt_ReturnValue) == 0x000010, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_settings) == 0x000020, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_key) == 0x000120, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_pressed) == 0x000138, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_color) == 0x00013C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_picker) == 0x000150, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_texture) == 0x000158, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_index) == 0x000160, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_calc) == 0x000164, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_calc' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_downl) == 0x000165, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_downl' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_coords) == 0x000166, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_coords' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_play) == 0x000167, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_play' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_light) == 0x000168, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_light' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable_1) == 0x00016C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000170, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000174, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000178, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000180, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000184, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable_2) == 0x000190, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000194, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable_2) == 0x0001A4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CreateDelegate_OutputDelegate) == 0x0001A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0001C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Create_ReturnValue) == 0x0001D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue) == 0x0001D8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0001E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToString_ReturnValue) == 0x0001E8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_AddChild_ReturnValue) == 0x0001F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item) == 0x000200, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_1) == 0x000210, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000214, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000218, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000230, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000248, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Select_Default) == 0x000260, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x000270, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000280, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000290, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002AC, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectString_ReturnValue) == 0x0002B0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x0002C0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectString_ReturnValue_1) == 0x0002C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002D8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0002E8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0002F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_byte_Variable) == 0x000304, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000308, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_byte_Variable_1) == 0x000310, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_gamemode) == 0x000318, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToBool_ReturnValue) == 0x000320, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000321, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x000324, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000328, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_bool_Variable) == 0x000329, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_MakeArray_Array) == 0x000330, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item_1) == 0x000340, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Select_Default_1) == 0x000348, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_2) == 0x00034C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_2) == 0x000350, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue) == 0x000351, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000354, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000358, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00035C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000360, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000364, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000368, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Lerp_ReturnValue) == 0x00036C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item_2) == 0x000370, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getObjectFromKey_Output) == 0x000378, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetDisplayName_ReturnValue) == 0x000380, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_AsInt_Ttrigger) == 0x000390, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_AsInt_Ttrigger' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_bSuccess) == 0x0003A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0003A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0003B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_AsInt_Ttrigger_1) == 0x0003C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_AsInt_Ttrigger_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_bSuccess_1) == 0x0003D8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Add_ReturnValue) == 0x0003DC, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetComponentByClass_ReturnValue) == 0x0003F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0003F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000404, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectColor_ReturnValue) == 0x000410, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Contains_ReturnValue) == 0x000420, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000421, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Vector_Distance_ReturnValue) == 0x000424, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000428, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000434, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_X) == 0x000438, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_Y) == 0x00043C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_Z) == 0x000440, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000444, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_DegAtan2_ReturnValue) == 0x000448, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_FloatFloat_ReturnValue) == 0x00044C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000450, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_MakeVector2D_ReturnValue) == 0x000454, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Percent_FloatFloat_ReturnValue_1) == 0x00045C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Percent_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000460, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000464, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetRotated2D_ReturnValue) == 0x000468, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000470, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Contains_ReturnValue_1) == 0x000471, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_1) == 0x000472, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_2) == 0x000473, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_3) == 0x000474, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_3) == 0x000478, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_3) == 0x000479, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToText_ReturnValue) == 0x000480, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000498, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_TextToString_ReturnValue) == 0x0004B0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0004C0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0004D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0004E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0004F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000500, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");

// Function umg_radarScreen.umg_radarScreen_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Umg_radarScreen_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_radarScreen_C_StuffUpgraded) == 0x000008, "Wrong alignment on Umg_radarScreen_C_StuffUpgraded");
static_assert(sizeof(Umg_radarScreen_C_StuffUpgraded) == 0x000008, "Wrong size on Umg_radarScreen_C_StuffUpgraded");
static_assert(offsetof(Umg_radarScreen_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Umg_radarScreen_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function umg_radarScreen.umg_radarScreen_C.powerChanged
// 0x0005 (0x0005 - 0x0000)
struct Umg_radarScreen_C_PowerChanged final
{
public:
	bool                                          Active_calc;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_downl;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_coords;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_play;                                       // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_light;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_radarScreen_C_PowerChanged) == 0x000001, "Wrong alignment on Umg_radarScreen_C_PowerChanged");
static_assert(sizeof(Umg_radarScreen_C_PowerChanged) == 0x000005, "Wrong size on Umg_radarScreen_C_PowerChanged");
static_assert(offsetof(Umg_radarScreen_C_PowerChanged, Active_calc) == 0x000000, "Member 'Umg_radarScreen_C_PowerChanged::Active_calc' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_PowerChanged, Active_downl) == 0x000001, "Member 'Umg_radarScreen_C_PowerChanged::Active_downl' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_PowerChanged, Active_coords) == 0x000002, "Member 'Umg_radarScreen_C_PowerChanged::Active_coords' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_PowerChanged, Active_play) == 0x000003, "Member 'Umg_radarScreen_C_PowerChanged::Active_play' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_PowerChanged, Active_light) == 0x000004, "Member 'Umg_radarScreen_C_PowerChanged::Active_light' has a wrong offset!");

// Function umg_radarScreen.umg_radarScreen_C.texturePickerApply
// 0x0018 (0x0018 - 0x0000)
struct Umg_radarScreen_C_TexturePickerApply final
{
public:
	class UUmg_texturePicker_C*                   Picker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_radarScreen_C_TexturePickerApply) == 0x000008, "Wrong alignment on Umg_radarScreen_C_TexturePickerApply");
static_assert(sizeof(Umg_radarScreen_C_TexturePickerApply) == 0x000018, "Wrong size on Umg_radarScreen_C_TexturePickerApply");
