#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_helpButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_help_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_helpButton.umg_helpButton_C
// 0x0068 (0x02C8 - 0x0260)
class UUmg_helpButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_Help_0;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_text;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Textspoiler;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_help                           Data;                                              // 0x0288(0x0038)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UUmg_help_C*                            Owner;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_helpButton(int32 EntryPoint);
	void BndEvt__umg_helpButton_button_help_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Search();
	void Upd();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_helpButton_C">();
	}
	static class UUmg_helpButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_helpButton_C>();
	}
};
static_assert(alignof(UUmg_helpButton_C) == 0x000008, "Wrong alignment on UUmg_helpButton_C");
static_assert(sizeof(UUmg_helpButton_C) == 0x0002C8, "Wrong size on UUmg_helpButton_C");
static_assert(offsetof(UUmg_helpButton_C, UberGraphFrame) == 0x000260, "Member 'UUmg_helpButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_helpButton_C, button_Help_0) == 0x000268, "Member 'UUmg_helpButton_C::button_Help_0' has a wrong offset!");
static_assert(offsetof(UUmg_helpButton_C, Text_text) == 0x000270, "Member 'UUmg_helpButton_C::Text_text' has a wrong offset!");
static_assert(offsetof(UUmg_helpButton_C, Textspoiler) == 0x000278, "Member 'UUmg_helpButton_C::Textspoiler' has a wrong offset!");
static_assert(offsetof(UUmg_helpButton_C, Index_0) == 0x000280, "Member 'UUmg_helpButton_C::Index_0' has a wrong offset!");
static_assert(offsetof(UUmg_helpButton_C, Data) == 0x000288, "Member 'UUmg_helpButton_C::Data' has a wrong offset!");
static_assert(offsetof(UUmg_helpButton_C, Owner) == 0x0002C0, "Member 'UUmg_helpButton_C::Owner' has a wrong offset!");

}

