#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_badSun

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function umg_badSun.umg_badSun_C.ExecuteUbergraph_umg_badSun
// 0x0650 (0x0650 - 0x0000)
struct Umg_badSun_C_ExecuteUbergraph_umg_badSun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0090(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameover_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0188(0x0010)(ReferenceParm)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue_1;   // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0300(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0314(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0430(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0494(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x04A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x04D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_3;                               // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x04E8(0x0018)(ConstParm)
	class FName                                   K2Node_Select_Default;                             // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_2;       // 0x050C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_2;  // 0x0594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0595(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0596(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_597[0x1];                                      // 0x0597(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x05A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x05B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0608(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_615[0x3];                                      // 0x0615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0618(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x062A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x062B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x062D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x062E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F[0x1];                                      // 0x062F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x063A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x063B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x063D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63E[0x2];                                      // 0x063E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_badSun_C_ExecuteUbergraph_umg_badSun) == 0x000010, "Wrong alignment on Umg_badSun_C_ExecuteUbergraph_umg_badSun");
static_assert(sizeof(Umg_badSun_C_ExecuteUbergraph_umg_badSun) == 0x000650, "Wrong size on Umg_badSun_C_ExecuteUbergraph_umg_badSun");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, EntryPoint) == 0x000000, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetActorForwardVector_ReturnValue) == 0x000004, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable) == 0x000010, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000014, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000020, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable) == 0x000030, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_byte_Variable) == 0x000040, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_1) == 0x000044, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_bool_Variable) == 0x000050, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable_1) == 0x000090, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Event_MyGeometry) == 0x0000B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Event_InDeltaTime) == 0x0000E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000EC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000F0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerController_ReturnValue) == 0x0000F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000100, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000108, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue) == 0x000114, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000120, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x00012C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000134, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainPlayer_AsMain_Player) == 0x000138, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000144, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000150, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000160, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable) == 0x000168, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000170, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000180, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_obj_static_obj) == 0x000188, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getSaveSlot_saveSlot) == 0x000198, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0001A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000228, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bBlockingHit) == 0x000229, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bInitialOverlap) == 0x00022A, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Time) == 0x00022C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Distance) == 0x000230, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Location) == 0x000234, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactPoint) == 0x000240, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Normal) == 0x00024C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactNormal) == 0x000258, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_PhysMat) == 0x000268, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitActor) == 0x000270, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitComponent) == 0x000278, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitBoneName) == 0x000280, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitItem) == 0x000288, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ElementIndex) == 0x00028C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_FaceIndex) == 0x000290, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceStart) == 0x000294, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceEnd) == 0x0002A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0002AC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FindLookAtRotation_ReturnValue) == 0x0002B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_2) == 0x0002BC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainPlayer_AsMain_Player_1) == 0x0002C0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomPointInBoundingBox_ReturnValue_1) == 0x0002C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomPointInBoundingBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002D4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0002E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x0002F0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable_2) == 0x000300, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000310, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x000314, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x00039C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomRotator_ReturnValue) == 0x0003A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0003AC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0003AD, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Time_1) == 0x0003B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Distance_1) == 0x0003B4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Location_1) == 0x0003B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0003C4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Normal_1) == 0x0003D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0003DC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_PhysMat_1) == 0x0003E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitActor_1) == 0x0003F0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitComponent_1) == 0x0003F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitBoneName_1) == 0x000400, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitItem_1) == 0x000408, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ElementIndex_1) == 0x00040C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_FaceIndex_1) == 0x000410, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceStart_1) == 0x000414, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceEnd_1) == 0x000420, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_MakeTransform_ReturnValue_1) == 0x000430, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000460, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000468, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000470, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Lerp_ReturnValue) == 0x000478, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00047C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_1) == 0x000480, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000488, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00048C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000490, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_2) == 0x000494, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00049C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FClamp_ReturnValue) == 0x0004A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Array_Contains_ReturnValue) == 0x0004A4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Not_PreBool_ReturnValue_1) == 0x0004A5, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BooleanAND_ReturnValue) == 0x0004A6, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0004A7, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0004A8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerController_ReturnValue_1) == 0x0004B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetControlRotation_ReturnValue) == 0x0004B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0004C4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_3) == 0x0004C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0004D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RLerp_ReturnValue) == 0x0004D4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_3) == 0x0004E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_text_Variable) == 0x0004E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Select_Default) == 0x000500, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_IsGamePaused_ReturnValue) == 0x000508, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_IsGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_OutHit_2) == 0x00050C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_OutHit_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_ReturnValue_2) == 0x000594, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bBlockingHit_2) == 0x000595, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x000596, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Time_2) == 0x000598, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Distance_2) == 0x00059C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Location_2) == 0x0005A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactPoint_2) == 0x0005AC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Normal_2) == 0x0005B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
