#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoidMod_Terminal

#include "Basic.hpp"

#include "VoidMod_CustomCommandData_structs.hpp"


namespace SDK::Params
{

// Function VoidMod_Terminal.VoidMod_Terminal_C.RegisterHelpCommand
// 0x0058 (0x0058 - 0x0000)
struct VoidMod_Terminal_C_RegisterHelpCommand final
{
public:
	class FString                                 CommandUsage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CommandDescription;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVoidMod_CustomCommandData             K2Node_MakeStruct_VoidMod_CustomCommandData;       // 0x0028(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoidMod_Terminal_C_RegisterHelpCommand) == 0x000008, "Wrong alignment on VoidMod_Terminal_C_RegisterHelpCommand");
static_assert(sizeof(VoidMod_Terminal_C_RegisterHelpCommand) == 0x000058, "Wrong size on VoidMod_Terminal_C_RegisterHelpCommand");
static_assert(offsetof(VoidMod_Terminal_C_RegisterHelpCommand, CommandUsage) == 0x000000, "Member 'VoidMod_Terminal_C_RegisterHelpCommand::CommandUsage' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_RegisterHelpCommand, CommandDescription) == 0x000010, "Member 'VoidMod_Terminal_C_RegisterHelpCommand::CommandDescription' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_RegisterHelpCommand, __WorldContext) == 0x000020, "Member 'VoidMod_Terminal_C_RegisterHelpCommand::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_RegisterHelpCommand, K2Node_MakeStruct_VoidMod_CustomCommandData) == 0x000028, "Member 'VoidMod_Terminal_C_RegisterHelpCommand::K2Node_MakeStruct_VoidMod_CustomCommandData' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_RegisterHelpCommand, CallFunc_GetVoidmodInstance_Instance) == 0x000048, "Member 'VoidMod_Terminal_C_RegisterHelpCommand::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_RegisterHelpCommand, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'VoidMod_Terminal_C_RegisterHelpCommand::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function VoidMod_Terminal.VoidMod_Terminal_C.GetHelpCommandOutput
// 0x00B8 (0x00B8 - 0x0000)
struct VoidMod_Terminal_C_GetHelpCommandOutput final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 HelpCommandOutput;                                 // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CurrentOutput;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendMultiple_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoidMod_CustomCommandData             CallFunc_Array_Get_Item;                           // 0x0050(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AppendMultiple_ReturnValue_1;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendMultiple_ReturnValue_2;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendMultiple_ReturnValue_3;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendMultiple_ReturnValue_4;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(VoidMod_Terminal_C_GetHelpCommandOutput) == 0x000008, "Wrong alignment on VoidMod_Terminal_C_GetHelpCommandOutput");
static_assert(sizeof(VoidMod_Terminal_C_GetHelpCommandOutput) == 0x0000B8, "Wrong size on VoidMod_Terminal_C_GetHelpCommandOutput");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, __WorldContext) == 0x000000, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, HelpCommandOutput) == 0x000008, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::HelpCommandOutput' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CurrentOutput) == 0x000018, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CurrentOutput' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, Temp_int_Array_Index_Variable) == 0x000028, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_GetVoidmodInstance_Instance) == 0x000038, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_AppendMultiple_ReturnValue) == 0x000040, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_AppendMultiple_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_Array_Get_Item) == 0x000050, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_AppendMultiple_ReturnValue_1) == 0x000078, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_AppendMultiple_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_AppendMultiple_ReturnValue_2) == 0x000088, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_AppendMultiple_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_AppendMultiple_ReturnValue_3) == 0x000098, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_AppendMultiple_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_GetHelpCommandOutput, CallFunc_AppendMultiple_ReturnValue_4) == 0x0000A8, "Member 'VoidMod_Terminal_C_GetHelpCommandOutput::CallFunc_AppendMultiple_ReturnValue_4' has a wrong offset!");

// Function VoidMod_Terminal.VoidMod_Terminal_C.WriteConsoleLine
// 0x0020 (0x0020 - 0x0000)
struct VoidMod_Terminal_C_WriteConsoleLine final
{
public:
	class FString                                 NewLine;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_console_C*                         CallFunc_GetFirstWidgetOfClass_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoidMod_Terminal_C_WriteConsoleLine) == 0x000008, "Wrong alignment on VoidMod_Terminal_C_WriteConsoleLine");
static_assert(sizeof(VoidMod_Terminal_C_WriteConsoleLine) == 0x000020, "Wrong size on VoidMod_Terminal_C_WriteConsoleLine");
static_assert(offsetof(VoidMod_Terminal_C_WriteConsoleLine, NewLine) == 0x000000, "Member 'VoidMod_Terminal_C_WriteConsoleLine::NewLine' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_WriteConsoleLine, __WorldContext) == 0x000010, "Member 'VoidMod_Terminal_C_WriteConsoleLine::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_WriteConsoleLine, CallFunc_GetFirstWidgetOfClass_ReturnValue) == 0x000018, "Member 'VoidMod_Terminal_C_WriteConsoleLine::CallFunc_GetFirstWidgetOfClass_ReturnValue' has a wrong offset!");

// Function VoidMod_Terminal.VoidMod_Terminal_C.DeleteLastLine
// 0x0070 (0x0070 - 0x0000)
struct VoidMod_Terminal_C_DeleteLastLine final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_console_C*                         CallFunc_GetFirstWidgetOfClass_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_String__ExplodeString_OutputStrings;      // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoidMod_Terminal_C_DeleteLastLine) == 0x000008, "Wrong alignment on VoidMod_Terminal_C_DeleteLastLine");
static_assert(sizeof(VoidMod_Terminal_C_DeleteLastLine) == 0x000070, "Wrong size on VoidMod_Terminal_C_DeleteLastLine");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, __WorldContext) == 0x000000, "Member 'VoidMod_Terminal_C_DeleteLastLine::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_GetVoidmodInstance_Instance) == 0x000008, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_GetFirstWidgetOfClass_ReturnValue) == 0x000010, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_GetFirstWidgetOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_JoinStringArray_ReturnValue) == 0x000018, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_String__ExplodeString_OutputStrings) == 0x000058, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_String__ExplodeString_OutputStrings' has a wrong offset!");
static_assert(offsetof(VoidMod_Terminal_C_DeleteLastLine, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'VoidMod_Terminal_C_DeleteLastLine::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

