#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoidMod_CustomActor

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct VoidMod_CustomActor.VoidMod_CustomActor
// 0x0048 (0x0048 - 0x0000)
struct FVoidMod_CustomActor final
{
public:
	class UClass*                                 Actor_2_8018A4144F60346D2B048BAD667FB9C7;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 StringID_8_D13AA7E74C186314FBA238BAC0D172BE;       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SpawnMenuName_26_24FA0440419A30FDDE8061B3FC49E7AC; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SpawnMenuDescription_27_767F99994D99204370A2C3960C0A8797; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Spawnable_21_237373EF40BE93BDFAE34E9C72D8E6B1;     // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             AssociatedIcon_14_53160F1D4B858017C86831BBDB6F0C4C; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FVoidMod_CustomActor) == 0x000008, "Wrong alignment on FVoidMod_CustomActor");
static_assert(sizeof(FVoidMod_CustomActor) == 0x000048, "Wrong size on FVoidMod_CustomActor");
static_assert(offsetof(FVoidMod_CustomActor, Actor_2_8018A4144F60346D2B048BAD667FB9C7) == 0x000000, "Member 'FVoidMod_CustomActor::Actor_2_8018A4144F60346D2B048BAD667FB9C7' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomActor, StringID_8_D13AA7E74C186314FBA238BAC0D172BE) == 0x000008, "Member 'FVoidMod_CustomActor::StringID_8_D13AA7E74C186314FBA238BAC0D172BE' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomActor, SpawnMenuName_26_24FA0440419A30FDDE8061B3FC49E7AC) == 0x000018, "Member 'FVoidMod_CustomActor::SpawnMenuName_26_24FA0440419A30FDDE8061B3FC49E7AC' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomActor, SpawnMenuDescription_27_767F99994D99204370A2C3960C0A8797) == 0x000028, "Member 'FVoidMod_CustomActor::SpawnMenuDescription_27_767F99994D99204370A2C3960C0A8797' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomActor, Spawnable_21_237373EF40BE93BDFAE34E9C72D8E6B1) == 0x000038, "Member 'FVoidMod_CustomActor::Spawnable_21_237373EF40BE93BDFAE34E9C72D8E6B1' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomActor, AssociatedIcon_14_53160F1D4B858017C86831BBDB6F0C4C) == 0x000040, "Member 'FVoidMod_CustomActor::AssociatedIcon_14_53160F1D4B858017C86831BBDB6F0C4C' has a wrong offset!");

}

