#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoidMod_CustomRoomCheck

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BaseRoom_structs.hpp"


namespace SDK
{

// UserDefinedStruct VoidMod_CustomRoomCheck.VoidMod_CustomRoomCheck
// 0x001C (0x001C - 0x0000)
struct FVoidMod_CustomRoomCheck final
{
public:
	EBaseRoom                                     BaseRoom_8_2064D7234E61D05236113CA9F7AFE69A;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CornerA_4_66314F93441F95CA227EDAA1EB0579C5;        // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CornerB_5_A9CD3179452DDE0E6C2F1B90ECE9282B;        // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FVoidMod_CustomRoomCheck) == 0x000004, "Wrong alignment on FVoidMod_CustomRoomCheck");
static_assert(sizeof(FVoidMod_CustomRoomCheck) == 0x00001C, "Wrong size on FVoidMod_CustomRoomCheck");
static_assert(offsetof(FVoidMod_CustomRoomCheck, BaseRoom_8_2064D7234E61D05236113CA9F7AFE69A) == 0x000000, "Member 'FVoidMod_CustomRoomCheck::BaseRoom_8_2064D7234E61D05236113CA9F7AFE69A' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomRoomCheck, CornerA_4_66314F93441F95CA227EDAA1EB0579C5) == 0x000004, "Member 'FVoidMod_CustomRoomCheck::CornerA_4_66314F93441F95CA227EDAA1EB0579C5' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomRoomCheck, CornerB_5_A9CD3179452DDE0E6C2F1B90ECE9282B) == 0x000010, "Member 'FVoidMod_CustomRoomCheck::CornerB_5_A9CD3179452DDE0E6C2F1B90ECE9282B' has a wrong offset!");

}

