#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoidMod_CustomEvent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct VoidMod_CustomEvent.VoidMod_CustomEvent
// 0x0060 (0x0060 - 0x0000)
struct FVoidMod_CustomEvent final
{
public:
	class UClass*                                 EventActor_26_D05379864EB3F1C65FB5949D1F7161A3;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EventID_25_24A0B02B4561FE8361ACEA88FF78D87F;       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         EventWeightChance_24_A354F32048EA3289A0EBE7A894E5F6E7; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredDay_23_B41E874043F9C0956C7E6E86A86D5BF7;   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredHour_22_E65C982E47BF6BE0042840BAC7969F01;  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredMinute_21_BBB6D3724B94B27238529DB026E9C918; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRandom_20_683BC762429505A2AD00369B5BB6868D;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CreateActorAt_29_E4D1730A450FCF0F24DB2C95EA4337FC; // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FVoidMod_CustomEvent) == 0x000010, "Wrong alignment on FVoidMod_CustomEvent");
static_assert(sizeof(FVoidMod_CustomEvent) == 0x000060, "Wrong size on FVoidMod_CustomEvent");
static_assert(offsetof(FVoidMod_CustomEvent, EventActor_26_D05379864EB3F1C65FB5949D1F7161A3) == 0x000000, "Member 'FVoidMod_CustomEvent::EventActor_26_D05379864EB3F1C65FB5949D1F7161A3' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomEvent, EventID_25_24A0B02B4561FE8361ACEA88FF78D87F) == 0x000008, "Member 'FVoidMod_CustomEvent::EventID_25_24A0B02B4561FE8361ACEA88FF78D87F' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomEvent, EventWeightChance_24_A354F32048EA3289A0EBE7A894E5F6E7) == 0x000018, "Member 'FVoidMod_CustomEvent::EventWeightChance_24_A354F32048EA3289A0EBE7A894E5F6E7' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomEvent, RequiredDay_23_B41E874043F9C0956C7E6E86A86D5BF7) == 0x00001C, "Member 'FVoidMod_CustomEvent::RequiredDay_23_B41E874043F9C0956C7E6E86A86D5BF7' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomEvent, RequiredHour_22_E65C982E47BF6BE0042840BAC7969F01) == 0x000020, "Member 'FVoidMod_CustomEvent::RequiredHour_22_E65C982E47BF6BE0042840BAC7969F01' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomEvent, RequiredMinute_21_BBB6D3724B94B27238529DB026E9C918) == 0x000024, "Member 'FVoidMod_CustomEvent::RequiredMinute_21_BBB6D3724B94B27238529DB026E9C918' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomEvent, IsRandom_20_683BC762429505A2AD00369B5BB6868D) == 0x000028, "Member 'FVoidMod_CustomEvent::IsRandom_20_683BC762429505A2AD00369B5BB6868D' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomEvent, CreateActorAt_29_E4D1730A450FCF0F24DB2C95EA4337FC) == 0x000030, "Member 'FVoidMod_CustomEvent::CreateActorAt_29_E4D1730A450FCF0F24DB2C95EA4337FC' has a wrong offset!");

}

