#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoidMod_CustomVariable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct VoidMod_CustomVariable.VoidMod_CustomVariable
// 0x0070 (0x0070 - 0x0000)
struct FVoidMod_CustomVariable final
{
public:
	class FString                                 VariableID_2_543529A5449EE8B168042C8DCE6092FD;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          BoolVal_8_24DF8822475148FA6A742592F32ADFAD;        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntVal_19_652205494E7091906A76609601856368;        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatVal_10_56A494EB4F2C3CCE953FFD9D6282EAE3;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringVal_11_1227E748486D7422D8186D9F19C3889E;     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                VectorVal_20_48A38B9C44044E94079479AE95897E41;     // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformVal_21_8B850FF7430BB13FDFF778BDDD838469;  // 0x0040(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FVoidMod_CustomVariable) == 0x000010, "Wrong alignment on FVoidMod_CustomVariable");
static_assert(sizeof(FVoidMod_CustomVariable) == 0x000070, "Wrong size on FVoidMod_CustomVariable");
static_assert(offsetof(FVoidMod_CustomVariable, VariableID_2_543529A5449EE8B168042C8DCE6092FD) == 0x000000, "Member 'FVoidMod_CustomVariable::VariableID_2_543529A5449EE8B168042C8DCE6092FD' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomVariable, BoolVal_8_24DF8822475148FA6A742592F32ADFAD) == 0x000010, "Member 'FVoidMod_CustomVariable::BoolVal_8_24DF8822475148FA6A742592F32ADFAD' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomVariable, IntVal_19_652205494E7091906A76609601856368) == 0x000014, "Member 'FVoidMod_CustomVariable::IntVal_19_652205494E7091906A76609601856368' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomVariable, FloatVal_10_56A494EB4F2C3CCE953FFD9D6282EAE3) == 0x000018, "Member 'FVoidMod_CustomVariable::FloatVal_10_56A494EB4F2C3CCE953FFD9D6282EAE3' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomVariable, StringVal_11_1227E748486D7422D8186D9F19C3889E) == 0x000020, "Member 'FVoidMod_CustomVariable::StringVal_11_1227E748486D7422D8186D9F19C3889E' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomVariable, VectorVal_20_48A38B9C44044E94079479AE95897E41) == 0x000030, "Member 'FVoidMod_CustomVariable::VectorVal_20_48A38B9C44044E94079479AE95897E41' has a wrong offset!");
static_assert(offsetof(FVoidMod_CustomVariable, TransformVal_21_8B850FF7430BB13FDFF778BDDD838469) == 0x000040, "Member 'FVoidMod_CustomVariable::TransformVal_21_8B850FF7430BB13FDFF778BDDD838469' has a wrong offset!");

}

