#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoidMod_ConfigVariable

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct VoidMod_ConfigVariable.VoidMod_ConfigVariable
// 0x0050 (0x0050 - 0x0000)
struct FVoidMod_ConfigVariable final
{
public:
	class FString                                 ModId_2_BF2E16D049E750A86C68EFA6ADBD6212;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VariableId_4_5D0E72DA4D982AA1DF98538F406FB02B;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value_7_5C105EE24D8119486033A291CB301BE6;          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DefaultValue_10_B0407F1440E31EF4A2A82EB798607089;  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Description_12_9F20785B428104CFD75BD982ED3E62AE;   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FVoidMod_ConfigVariable) == 0x000008, "Wrong alignment on FVoidMod_ConfigVariable");
static_assert(sizeof(FVoidMod_ConfigVariable) == 0x000050, "Wrong size on FVoidMod_ConfigVariable");
static_assert(offsetof(FVoidMod_ConfigVariable, ModId_2_BF2E16D049E750A86C68EFA6ADBD6212) == 0x000000, "Member 'FVoidMod_ConfigVariable::ModId_2_BF2E16D049E750A86C68EFA6ADBD6212' has a wrong offset!");
static_assert(offsetof(FVoidMod_ConfigVariable, VariableId_4_5D0E72DA4D982AA1DF98538F406FB02B) == 0x000010, "Member 'FVoidMod_ConfigVariable::VariableId_4_5D0E72DA4D982AA1DF98538F406FB02B' has a wrong offset!");
static_assert(offsetof(FVoidMod_ConfigVariable, Value_7_5C105EE24D8119486033A291CB301BE6) == 0x000020, "Member 'FVoidMod_ConfigVariable::Value_7_5C105EE24D8119486033A291CB301BE6' has a wrong offset!");
static_assert(offsetof(FVoidMod_ConfigVariable, DefaultValue_10_B0407F1440E31EF4A2A82EB798607089) == 0x000030, "Member 'FVoidMod_ConfigVariable::DefaultValue_10_B0407F1440E31EF4A2A82EB798607089' has a wrong offset!");
static_assert(offsetof(FVoidMod_ConfigVariable, Description_12_9F20785B428104CFD75BD982ED3E62AE) == 0x000040, "Member 'FVoidMod_ConfigVariable::Description_12_9F20785B428104CFD75BD982ED3E62AE' has a wrong offset!");

}

