#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoidMod_SaveData

#include "Basic.hpp"

#include "VoidMod_CustomVariable_structs.hpp"


namespace SDK::Params
{

// Function VoidMod_SaveData.VoidMod_SaveData_C.GetCustomSaveVariable
// 0x01E0 (0x01E0 - 0x0000)
struct VoidMod_SaveData_C_GetCustomSaveVariable final
{
public:
	class FString                                 VariableId;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoidMod_CustomVariable                FetchedVariable;                                   // 0x0020(0x0070)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoidMod_CustomVariable                CallFunc_Array_Get_Item;                           // 0x00D0(0x0070)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToLower_ReturnValue_1;                    // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoidMod_CustomVariable                CallFunc_Array_Get_Item_1;                         // 0x0160(0x0070)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoidMod_SaveData_C_GetCustomSaveVariable) == 0x000010, "Wrong alignment on VoidMod_SaveData_C_GetCustomSaveVariable");
static_assert(sizeof(VoidMod_SaveData_C_GetCustomSaveVariable) == 0x0001E0, "Wrong size on VoidMod_SaveData_C_GetCustomSaveVariable");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, VariableId) == 0x000000, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::VariableId' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, __WorldContext) == 0x000010, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, FetchedVariable) == 0x000020, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::FetchedVariable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, Success) == 0x000090, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::Success' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_ToLower_ReturnValue) == 0x000098, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_ToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, Temp_int_Array_Index_Variable) == 0x0000A8, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_GetVoidmodInstance_Instance) == 0x0000B8, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_ToLower_ReturnValue_1) == 0x000148, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_ToLower_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_GetCustomSaveVariable, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0001D0, "Member 'VoidMod_SaveData_C_GetCustomSaveVariable::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function VoidMod_SaveData.VoidMod_SaveData_C.SetCustomSaveVariable
// 0x01B0 (0x01B0 - 0x0000)
struct VoidMod_SaveData_C_SetCustomSaveVariable final
{
public:
	struct FVoidMod_CustomVariable                CustomVariable;                                    // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FoundIndex;                                        // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVoidMod_CustomVariable                K2Node_MakeStruct_VoidMod_CustomVariable;          // 0x0080(0x0070)(HasGetValueTypeHash)
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoidMod_CustomVariable                CallFunc_Array_Get_Item;                           // 0x0120(0x0070)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToLower_ReturnValue_1;                    // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoidMod_SaveData_C_SetCustomSaveVariable) == 0x000010, "Wrong alignment on VoidMod_SaveData_C_SetCustomSaveVariable");
static_assert(sizeof(VoidMod_SaveData_C_SetCustomSaveVariable) == 0x0001B0, "Wrong size on VoidMod_SaveData_C_SetCustomSaveVariable");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CustomVariable) == 0x000000, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CustomVariable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, __WorldContext) == 0x000070, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, FoundIndex) == 0x000078, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::FoundIndex' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, Temp_int_Array_Index_Variable) == 0x00007C, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, K2Node_MakeStruct_VoidMod_CustomVariable) == 0x000080, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::K2Node_MakeStruct_VoidMod_CustomVariable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_ToLower_ReturnValue) == 0x0000F0, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_ToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, Temp_int_Loop_Counter_Variable) == 0x000100, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000108, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_Not_PreBool_ReturnValue) == 0x000109, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_GetVoidmodInstance_Instance) == 0x000110, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_Array_Get_Item) == 0x000120, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_Less_IntInt_ReturnValue) == 0x000194, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_ToLower_ReturnValue_1) == 0x000198, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_ToLower_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0001A8, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SetCustomSaveVariable, CallFunc_Array_Add_ReturnValue) == 0x0001AC, "Member 'VoidMod_SaveData_C_SetCustomSaveVariable::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function VoidMod_SaveData.VoidMod_SaveData_C.LoadModGameData
// 0x0050 (0x0050 - 0x0000)
struct VoidMod_SaveData_C_LoadModGameData final
{
public:
	class FString                                 SaveName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_DynamicCast_AsVoid_Mod_Data_Save;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoidMod_SaveData_C_LoadModGameData) == 0x000008, "Wrong alignment on VoidMod_SaveData_C_LoadModGameData");
static_assert(sizeof(VoidMod_SaveData_C_LoadModGameData) == 0x000050, "Wrong size on VoidMod_SaveData_C_LoadModGameData");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, SaveName) == 0x000000, "Member 'VoidMod_SaveData_C_LoadModGameData::SaveName' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, __WorldContext) == 0x000010, "Member 'VoidMod_SaveData_C_LoadModGameData::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, Success) == 0x000018, "Member 'VoidMod_SaveData_C_LoadModGameData::Success' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, CallFunc_GetVoidmodInstance_Instance) == 0x000020, "Member 'VoidMod_SaveData_C_LoadModGameData::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000028, "Member 'VoidMod_SaveData_C_LoadModGameData::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000030, "Member 'VoidMod_SaveData_C_LoadModGameData::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, K2Node_DynamicCast_AsVoid_Mod_Data_Save) == 0x000038, "Member 'VoidMod_SaveData_C_LoadModGameData::K2Node_DynamicCast_AsVoid_Mod_Data_Save' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'VoidMod_SaveData_C_LoadModGameData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_LoadModGameData, CallFunc_GetVoidmodInstance_Instance_1) == 0x000048, "Member 'VoidMod_SaveData_C_LoadModGameData::CallFunc_GetVoidmodInstance_Instance_1' has a wrong offset!");

// Function VoidMod_SaveData.VoidMod_SaveData_C.SaveModGameData
// 0x00D0 (0x00D0 - 0x0000)
struct VoidMod_SaveData_C_SaveModGameData final
{
public:
	class FString                                 SaveName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVoidModInstance_C*                     CallFunc_GetVoidmodInstance_Instance;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoidMod_CustomVariable                CallFunc_Array_Get_Item;                           // 0x0040(0x0070)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoidMod_SaveData_C_SaveModGameData) == 0x000010, "Wrong alignment on VoidMod_SaveData_C_SaveModGameData");
static_assert(sizeof(VoidMod_SaveData_C_SaveModGameData) == 0x0000D0, "Wrong size on VoidMod_SaveData_C_SaveModGameData");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, SaveName) == 0x000000, "Member 'VoidMod_SaveData_C_SaveModGameData::SaveName' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, __WorldContext) == 0x000010, "Member 'VoidMod_SaveData_C_SaveModGameData::__WorldContext' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, Success) == 0x000018, "Member 'VoidMod_SaveData_C_SaveModGameData::Success' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'VoidMod_SaveData_C_SaveModGameData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'VoidMod_SaveData_C_SaveModGameData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000028, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_GetVoidmodInstance_Instance) == 0x000030, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_GetVoidmodInstance_Instance' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_SaveGameToSlot_ReturnValue) == 0x000038, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_Array_Get_Item) == 0x000040, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_GetPlayerController_ReturnValue) == 0x0000B8, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoidMod_SaveData_C_SaveModGameData, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'VoidMod_SaveData_C_SaveModGameData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

